#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Recall_Base_Physics

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "PsRealVehiclePlugin_structs.hpp"
#include "PsRealVehiclePlugin_classes.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_Recall_Base_Physics.ABP_Recall_Base_Physics_C
// 0x1640 (0x2200 - 0x0BC0)
class UABP_Recall_Base_Physics_C final : public UPrvVehicleAnimationInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0BC8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0BD0(0x0008)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_11;             // 0x0BD8(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_10;             // 0x0D00(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_9;              // 0x0E28(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_8;              // 0x0F50(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_7;              // 0x1078(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_6;              // 0x11A0(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_5;              // 0x12C8(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_4;              // 0x13F0(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_3;              // 0x1518(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_2;              // 0x1640(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_1;              // 0x1768(0x0128)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_5;                          // 0x1890(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_4;                          // 0x1980(0x00F0)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController;                // 0x1A70(0x0128)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_3;                          // 0x1B98(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_2;                          // 0x1C88(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_1;                          // 0x1D78(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x1E68(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x1F58(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x1FA0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1FE8(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2030(0x0020)()
	struct FAnimNode_PrvWheelHandler              AnimGraphNode_PrvWheelHandler;                     // 0x2050(0x00E0)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose;                         // 0x2130(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2140(0x0020)()
	struct FRotator                               WheelRotation;                                     // 0x2160(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               HatchRotation;                                     // 0x2178(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               TurretRotation;                                    // 0x2190(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               GunRotattion;                                      // 0x21A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               TracksMID;                                         // 0x21C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Tank;                                              // 0x21C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBPC_TurretBaseComponent_C*             TurretComponent;                                   // 0x21D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Delta_Time_X;                                      // 0x21D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Gun_Recoil_Alpha;                                  // 0x21E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Turret_Yaw;                                        // 0x21E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Gun_Pitch;                                         // 0x21F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintBeginPlay();
	void ExecuteUbergraph_ABP_Recall_Base_Physics(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Recall_Base_Physics_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Recall_Base_Physics_C")
	}
	static class UABP_Recall_Base_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Recall_Base_Physics_C>();
	}
};
DUMPER7_ASSERTS_UABP_Recall_Base_Physics_C;

SDK_NAMESPACE_END
