#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorModifierCore

#include "Basic.hpp"

#include "ActorModifierCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function ActorModifierCore.ActorModifierCoreBase.SetModifierEnabled
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierCoreBase_SetModifierEnabled final
{
public:
	bool                                          bInEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierCoreBase_SetModifierEnabled;

// Function ActorModifierCore.ActorModifierCoreBlueprintBase.OnModifierAddedEvent
// 0x0010 (0x0010 - 0x0000)
struct ActorModifierCoreBlueprintBase_OnModifierAddedEvent final
{
public:
	class AActor*                                 InTargetActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EActorModifierCoreEnableReason                InReason;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreBlueprintBase_OnModifierAddedEvent;

// Function ActorModifierCore.ActorModifierCoreBlueprintBase.OnModifierApplyEvent
// 0x0020 (0x0020 - 0x0000)
struct ActorModifierCoreBlueprintBase_OnModifierApplyEvent final
{
public:
	class AActor*                                 InTargetActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   OutFailReason;                                     // 0x0008(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreBlueprintBase_OnModifierApplyEvent;

// Function ActorModifierCore.ActorModifierCoreBlueprintBase.OnModifierDisabledEvent
// 0x0010 (0x0010 - 0x0000)
struct ActorModifierCoreBlueprintBase_OnModifierDisabledEvent final
{
public:
	class AActor*                                 InTargetActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EActorModifierCoreDisableReason               InReason;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreBlueprintBase_OnModifierDisabledEvent;

// Function ActorModifierCore.ActorModifierCoreBlueprintBase.OnModifierEnabledEvent
// 0x0010 (0x0010 - 0x0000)
struct ActorModifierCoreBlueprintBase_OnModifierEnabledEvent final
{
public:
	class AActor*                                 InTargetActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EActorModifierCoreEnableReason                InReason;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreBlueprintBase_OnModifierEnabledEvent;

// Function ActorModifierCore.ActorModifierCoreBlueprintBase.OnModifierRemovedEvent
// 0x0010 (0x0010 - 0x0000)
struct ActorModifierCoreBlueprintBase_OnModifierRemovedEvent final
{
public:
	class AActor*                                 InTargetActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EActorModifierCoreDisableReason               InReason;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreBlueprintBase_OnModifierRemovedEvent;

// Function ActorModifierCore.ActorModifierCoreBlueprintBase.OnModifierReplacedEvent
// 0x0008 (0x0008 - 0x0000)
struct ActorModifierCoreBlueprintBase_OnModifierReplacedEvent final
{
public:
	class AActor*                                 InTargetActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierCoreBlueprintBase_OnModifierReplacedEvent;

// Function ActorModifierCore.ActorModifierCoreBlueprintBase.OnModifierRestoreStateEvent
// 0x0008 (0x0008 - 0x0000)
struct ActorModifierCoreBlueprintBase_OnModifierRestoreStateEvent final
{
public:
	class AActor*                                 InTargetActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierCoreBlueprintBase_OnModifierRestoreStateEvent;

// Function ActorModifierCore.ActorModifierCoreBlueprintBase.OnModifierSaveStateEvent
// 0x0008 (0x0008 - 0x0000)
struct ActorModifierCoreBlueprintBase_OnModifierSaveStateEvent final
{
public:
	class AActor*                                 InTargetActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierCoreBlueprintBase_OnModifierSaveStateEvent;

// Function ActorModifierCore.ActorModifierCoreBlueprintBase.OnModifierSetupEvent
// 0x03E0 (0x03E0 - 0x0000)
struct ActorModifierCoreBlueprintBase_OnModifierSetupEvent final
{
public:
	struct FActorModifierCoreMetadata             InMetaData;                                        // 0x0000(0x01F0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FActorModifierCoreMetadata             OutMetadata;                                       // 0x01F0(0x01F0)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierCoreBlueprintBase_OnModifierSetupEvent;

// Function ActorModifierCore.ActorModifierCoreComponent.GetModifierStack
// 0x0008 (0x0008 - 0x0000)
struct ActorModifierCoreComponent_GetModifierStack final
{
public:
	class UActorModifierCoreStack*                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierCoreComponent_GetModifierStack;

// Function ActorModifierCore.ActorModifierCoreLibrary.AddModifierMetadataDependency
// 0x03F0 (0x03F0 - 0x0000)
struct ActorModifierCoreLibrary_AddModifierMetadataDependency final
{
public:
	struct FActorModifierCoreMetadata             InMetaData;                                        // 0x0000(0x01F0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSubclassOf<class UActorModifierCoreBase>     InModifierClass;                                   // 0x01F0(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F8[0x8];                                      // 0x01F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActorModifierCoreMetadata             ReturnValue;                                       // 0x0200(0x01F0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_AddModifierMetadataDependency;

// Function ActorModifierCore.ActorModifierCoreLibrary.CloneModifier
// 0x0030 (0x0030 - 0x0000)
struct ActorModifierCoreLibrary_CloneModifier final
{
public:
	class UActorModifierCoreStack*                InModifierStack;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FActorModifierCoreCloneOperation       InOperation;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UActorModifierCoreBase*                 OutNewModifier;                                    // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_CloneModifier;

// Function ActorModifierCore.ActorModifierCoreLibrary.ContainsModifier
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierCoreLibrary_ContainsModifier final
{
public:
	class UActorModifierCoreStack*                InModifierStack;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorModifierCoreBase*                 InModifier;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_ContainsModifier;

// Function ActorModifierCore.ActorModifierCoreLibrary.EnableModifier
// 0x0010 (0x0010 - 0x0000)
struct ActorModifierCoreLibrary_EnableModifier final
{
public:
	class UActorModifierCoreBase*                 InModifier;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInState;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_EnableModifier;

// Function ActorModifierCore.ActorModifierCoreLibrary.FindModifierByClass
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierCoreLibrary_FindModifierByClass final
{
public:
	class UActorModifierCoreStack*                InModifierStack;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UActorModifierCoreBase>     InModifierClass;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorModifierCoreBase*                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_FindModifierByClass;

// Function ActorModifierCore.ActorModifierCoreLibrary.FindModifierByName
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierCoreLibrary_FindModifierByName final
{
public:
	const class UActorModifierCoreStack*          InModifierStack;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InModifierName;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorModifierCoreBase*                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_FindModifierByName;

// Function ActorModifierCore.ActorModifierCoreLibrary.FindModifiersByClass
// 0x0020 (0x0020 - 0x0000)
struct ActorModifierCoreLibrary_FindModifiersByClass final
{
public:
	class UActorModifierCoreStack*                InModifierStack;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UActorModifierCoreBase>     InModifierClass;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UActorModifierCoreBase*>         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_FindModifiersByClass;

// Function ActorModifierCore.ActorModifierCoreLibrary.FindModifiersByName
// 0x0020 (0x0020 - 0x0000)
struct ActorModifierCoreLibrary_FindModifiersByName final
{
public:
	class UActorModifierCoreStack*                InModifierStack;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InModifierName;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UActorModifierCoreBase*>         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_FindModifiersByName;

// Function ActorModifierCore.ActorModifierCoreLibrary.FindModifierStack
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierCoreLibrary_FindModifierStack final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorModifierCoreStack*                OutModifierStack;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInCreateIfNone;                                   // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_FindModifierStack;

// Function ActorModifierCore.ActorModifierCoreLibrary.GetAvailableModifiers
// 0x0058 (0x0058 - 0x0000)
struct ActorModifierCoreLibrary_GetAvailableModifiers final
{
public:
	TSet<TSubclassOf<class UActorModifierCoreBase>> OutAvailableModifierClasses;                     // 0x0000(0x0050)(Parm, OutParm, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_GetAvailableModifiers;

// Function ActorModifierCore.ActorModifierCoreLibrary.GetDependentModifiers
// 0x0060 (0x0060 - 0x0000)
struct ActorModifierCoreLibrary_GetDependentModifiers final
{
public:
	class UActorModifierCoreBase*                 InModifier;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class UActorModifierCoreBase*>           OutModifiers;                                      // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_GetDependentModifiers;

// Function ActorModifierCore.ActorModifierCoreLibrary.GetModifierActor
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierCoreLibrary_GetModifierActor final
{
public:
	const class UActorModifierCoreBase*           InModifier;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OutModifiedActor;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_GetModifierActor;

// Function ActorModifierCore.ActorModifierCoreLibrary.GetModifierCategories
// 0x0058 (0x0058 - 0x0000)
struct ActorModifierCoreLibrary_GetModifierCategories final
{
public:
	TSet<class FName>                             OutModifierCategories;                             // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_GetModifierCategories;

// Function ActorModifierCore.ActorModifierCoreLibrary.GetModifierCategory
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierCoreLibrary_GetModifierCategory final
{
public:
	const class UActorModifierCoreBase*           InModifier;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutModifierCategory;                               // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_GetModifierCategory;

// Function ActorModifierCore.ActorModifierCoreLibrary.GetModifierCategoryByClass
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierCoreLibrary_GetModifierCategoryByClass final
{
public:
	TSubclassOf<class UActorModifierCoreBase>     InModifierClass;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutModifierCategory;                               // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_GetModifierCategoryByClass;

// Function ActorModifierCore.ActorModifierCoreLibrary.GetModifierClass
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierCoreLibrary_GetModifierClass final
{
public:
	class FName                                   InModifierName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UActorModifierCoreBase>     OutModifierClass;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_GetModifierClass;

// Function ActorModifierCore.ActorModifierCoreLibrary.GetModifierName
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierCoreLibrary_GetModifierName final
{
public:
	const class UActorModifierCoreBase*           InModifier;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutModifierName;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_GetModifierName;

// Function ActorModifierCore.ActorModifierCoreLibrary.GetModifierNameByClass
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierCoreLibrary_GetModifierNameByClass final
{
public:
	TSubclassOf<class UActorModifierCoreBase>     InModifierClass;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutModifierName;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_GetModifierNameByClass;

// Function ActorModifierCore.ActorModifierCoreLibrary.GetModifiersByCategory
// 0x0060 (0x0060 - 0x0000)
struct ActorModifierCoreLibrary_GetModifiersByCategory final
{
public:
	class FName                                   InCategory;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<TSubclassOf<class UActorModifierCoreBase>> OutSupportedModifierClasses;                     // 0x0008(0x0050)(Parm, OutParm, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_GetModifiersByCategory;

// Function ActorModifierCore.ActorModifierCoreLibrary.GetModifierStack
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierCoreLibrary_GetModifierStack final
{
public:
	const class UActorModifierCoreBase*           InModifier;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorModifierCoreStack*                OutModifierStack;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_GetModifierStack;

// Function ActorModifierCore.ActorModifierCoreLibrary.GetRequiredModifiers
// 0x0060 (0x0060 - 0x0000)
struct ActorModifierCoreLibrary_GetRequiredModifiers final
{
public:
	class UActorModifierCoreBase*                 InModifier;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class UActorModifierCoreBase*>           OutModifiers;                                      // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_GetRequiredModifiers;

// Function ActorModifierCore.ActorModifierCoreLibrary.GetStackModifiers
// 0x0020 (0x0020 - 0x0000)
struct ActorModifierCoreLibrary_GetStackModifiers final
{
public:
	const class UActorModifierCoreStack*          InModifierStack;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UActorModifierCoreBase*>         OutModifiers;                                      // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_GetStackModifiers;

// Function ActorModifierCore.ActorModifierCoreLibrary.GetSupportedModifiers
// 0x0070 (0x0070 - 0x0000)
struct ActorModifierCoreLibrary_GetSupportedModifiers final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<TSubclassOf<class UActorModifierCoreBase>> OutSupportedModifierClasses;                     // 0x0008(0x0050)(Parm, OutParm, UObjectWrapper, NativeAccessSpecifierPublic)
	EActorModifierCoreStackPosition               InContextPosition;                                 // 0x0058(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorModifierCoreBase*                 InContextModifier;                                 // 0x0060(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_GetSupportedModifiers;

// Function ActorModifierCore.ActorModifierCoreLibrary.InsertModifier
// 0x0030 (0x0030 - 0x0000)
struct ActorModifierCoreLibrary_InsertModifier final
{
public:
	class UActorModifierCoreStack*                InModifierStack;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FActorModifierCoreInsertOperation      InOperation;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UActorModifierCoreBase*                 OutNewModifier;                                    // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_InsertModifier;

// Function ActorModifierCore.ActorModifierCoreLibrary.IsModifierEnabled
// 0x0010 (0x0010 - 0x0000)
struct ActorModifierCoreLibrary_IsModifierEnabled final
{
public:
	const class UActorModifierCoreBase*           InModifier;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutEnabled;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_IsModifierEnabled;

// Function ActorModifierCore.ActorModifierCoreLibrary.MoveModifier
// 0x0028 (0x0028 - 0x0000)
struct ActorModifierCoreLibrary_MoveModifier final
{
public:
	class UActorModifierCoreStack*                InModifierStack;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FActorModifierCoreMoveOperation        InOperation;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_MoveModifier;

// Function ActorModifierCore.ActorModifierCoreLibrary.RemoveModifier
// 0x0020 (0x0020 - 0x0000)
struct ActorModifierCoreLibrary_RemoveModifier final
{
public:
	class UActorModifierCoreStack*                InModifierStack;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FActorModifierCoreRemoveOperation      InOperation;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_RemoveModifier;

// Function ActorModifierCore.ActorModifierCoreLibrary.SetModifierMetadataCategory
// 0x03F0 (0x03F0 - 0x0000)
struct ActorModifierCoreLibrary_SetModifierMetadataCategory final
{
public:
	struct FActorModifierCoreMetadata             InMetaData;                                        // 0x0000(0x01F0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   InCategory;                                        // 0x01F0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F8[0x8];                                      // 0x01F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActorModifierCoreMetadata             ReturnValue;                                       // 0x0200(0x01F0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_SetModifierMetadataCategory;

// Function ActorModifierCore.ActorModifierCoreLibrary.SetModifierMetadataCompatibilityRule
// 0x03F0 (0x03F0 - 0x0000)
struct ActorModifierCoreLibrary_SetModifierMetadataCompatibilityRule final
{
public:
	struct FActorModifierCoreMetadata             InMetaData;                                        // 0x0000(0x01F0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const class AActor* InTargetActor)> InDelegate;                                   // 0x01F0(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FActorModifierCoreMetadata             ReturnValue;                                       // 0x0200(0x01F0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_SetModifierMetadataCompatibilityRule;

// Function ActorModifierCore.ActorModifierCoreLibrary.SetModifierMetadataDescription
// 0x03F0 (0x03F0 - 0x0000)
struct ActorModifierCoreLibrary_SetModifierMetadataDescription final
{
public:
	struct FActorModifierCoreMetadata             InMetaData;                                        // 0x0000(0x01F0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   InDescription;                                     // 0x01F0(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FActorModifierCoreMetadata             ReturnValue;                                       // 0x0200(0x01F0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_SetModifierMetadataDescription;

// Function ActorModifierCore.ActorModifierCoreLibrary.SetModifierMetadataDisplayName
// 0x03F0 (0x03F0 - 0x0000)
struct ActorModifierCoreLibrary_SetModifierMetadataDisplayName final
{
public:
	struct FActorModifierCoreMetadata             InMetaData;                                        // 0x0000(0x01F0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   InName;                                            // 0x01F0(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FActorModifierCoreMetadata             ReturnValue;                                       // 0x0200(0x01F0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_SetModifierMetadataDisplayName;

// Function ActorModifierCore.ActorModifierCoreLibrary.SetModifierMetadataName
// 0x03F0 (0x03F0 - 0x0000)
struct ActorModifierCoreLibrary_SetModifierMetadataName final
{
public:
	struct FActorModifierCoreMetadata             InMetaData;                                        // 0x0000(0x01F0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   InName;                                            // 0x01F0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F8[0x8];                                      // 0x01F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActorModifierCoreMetadata             ReturnValue;                                       // 0x0200(0x01F0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierCoreLibrary_SetModifierMetadataName;

// Function ActorModifierCore.ActorModifierCoreSharedActor.OnActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct ActorModifierCoreSharedActor_OnActorDestroyed final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierCoreSharedActor_OnActorDestroyed;

// Function ActorModifierCore.ActorModifierCoreStack.OnActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct ActorModifierCoreStack_OnActorDestroyed final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierCoreStack_OnActorDestroyed;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
