#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorModifierLayout

#include "Basic.hpp"

#include "ActorModifier_structs.hpp"
#include "ActorModifierLayout_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function ActorModifierLayout.ActorModifierAlignBetweenModifier.AddReferenceActor
// 0x0014 (0x0014 - 0x0000)
struct ActorModifierAlignBetweenModifier_AddReferenceActor final
{
public:
	struct FActorModifierAlignBetweenWeightedActor InReferenceActor;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierAlignBetweenModifier_AddReferenceActor;

// Function ActorModifierLayout.ActorModifierAlignBetweenModifier.RemoveReferenceActor
// 0x0010 (0x0010 - 0x0000)
struct ActorModifierAlignBetweenModifier_RemoveReferenceActor final
{
public:
	const class AActor*                           InActor;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierAlignBetweenModifier_RemoveReferenceActor;

// Function ActorModifierLayout.ActorModifierAlignBetweenModifier.SetReferenceActors
// 0x0050 (0x0050 - 0x0000)
struct ActorModifierAlignBetweenModifier_SetReferenceActors final
{
public:
	TSet<struct FActorModifierAlignBetweenWeightedActor> InReferenceActors;                          // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierAlignBetweenModifier_SetReferenceActors;

// Function ActorModifierLayout.ActorModifierAlignBetweenModifier.FindReferenceActor
// 0x0020 (0x0020 - 0x0000)
struct ActorModifierAlignBetweenModifier_FindReferenceActor final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FActorModifierAlignBetweenWeightedActor OutReferenceActor;                                // 0x0008(0x0010)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorModifierAlignBetweenModifier_FindReferenceActor;

// Function ActorModifierLayout.ActorModifierAlignBetweenModifier.GetReferenceActors
// 0x0050 (0x0050 - 0x0000)
struct ActorModifierAlignBetweenModifier_GetReferenceActors final
{
public:
	TSet<struct FActorModifierAlignBetweenWeightedActor> ReturnValue;                                // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierAlignBetweenModifier_GetReferenceActors;

// Function ActorModifierLayout.ActorModifierAutoFollowModifier.SetDefaultDistance
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierAutoFollowModifier_SetDefaultDistance final
{
public:
	struct FVector                                InDefaultDistance;                                 // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierAutoFollowModifier_SetDefaultDistance;

// Function ActorModifierLayout.ActorModifierAutoFollowModifier.SetFollowedAlignment
// 0x0006 (0x0006 - 0x0000)
struct ActorModifierAutoFollowModifier_SetFollowedAlignment final
{
public:
	struct FActorModifierAnchorAlignment          InFollowedAlignment;                               // 0x0000(0x0006)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierAutoFollowModifier_SetFollowedAlignment;

// Function ActorModifierLayout.ActorModifierAutoFollowModifier.SetFollowedAxis
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierAutoFollowModifier_SetFollowedAxis final
{
public:
	int32                                         InFollowedAxis;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierAutoFollowModifier_SetFollowedAxis;

// Function ActorModifierLayout.ActorModifierAutoFollowModifier.SetLocalAlignment
// 0x0006 (0x0006 - 0x0000)
struct ActorModifierAutoFollowModifier_SetLocalAlignment final
{
public:
	struct FActorModifierAnchorAlignment          InLocalAlignment;                                  // 0x0000(0x0006)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierAutoFollowModifier_SetLocalAlignment;

// Function ActorModifierLayout.ActorModifierAutoFollowModifier.SetMaxDistance
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierAutoFollowModifier_SetMaxDistance final
{
public:
	struct FVector                                InMaxDistance;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierAutoFollowModifier_SetMaxDistance;

// Function ActorModifierLayout.ActorModifierAutoFollowModifier.SetOffsetAxis
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierAutoFollowModifier_SetOffsetAxis final
{
public:
	struct FVector                                InOffsetAxis;                                      // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierAutoFollowModifier_SetOffsetAxis;

// Function ActorModifierLayout.ActorModifierAutoFollowModifier.SetProgress
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierAutoFollowModifier_SetProgress final
{
public:
	struct FVector                                InProgress;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierAutoFollowModifier_SetProgress;

// Function ActorModifierLayout.ActorModifierAutoFollowModifier.SetReferenceActor
// 0x0098 (0x0098 - 0x0000)
struct ActorModifierAutoFollowModifier_SetReferenceActor final
{
public:
	struct FActorModifierSceneTreeActor           InReferenceActor;                                  // 0x0000(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierAutoFollowModifier_SetReferenceActor;

// Function ActorModifierLayout.ActorModifierAutoFollowModifier.GetDefaultDistance
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierAutoFollowModifier_GetDefaultDistance final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierAutoFollowModifier_GetDefaultDistance;

// Function ActorModifierLayout.ActorModifierAutoFollowModifier.GetFollowedAlignment
// 0x0006 (0x0006 - 0x0000)
struct ActorModifierAutoFollowModifier_GetFollowedAlignment final
{
public:
	struct FActorModifierAnchorAlignment          ReturnValue;                                       // 0x0000(0x0006)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierAutoFollowModifier_GetFollowedAlignment;

// Function ActorModifierLayout.ActorModifierAutoFollowModifier.GetFollowedAxis
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierAutoFollowModifier_GetFollowedAxis final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierAutoFollowModifier_GetFollowedAxis;

// Function ActorModifierLayout.ActorModifierAutoFollowModifier.GetLocalAlignment
// 0x0006 (0x0006 - 0x0000)
struct ActorModifierAutoFollowModifier_GetLocalAlignment final
{
public:
	struct FActorModifierAnchorAlignment          ReturnValue;                                       // 0x0000(0x0006)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierAutoFollowModifier_GetLocalAlignment;

// Function ActorModifierLayout.ActorModifierAutoFollowModifier.GetMaxDistance
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierAutoFollowModifier_GetMaxDistance final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierAutoFollowModifier_GetMaxDistance;

// Function ActorModifierLayout.ActorModifierAutoFollowModifier.GetOffsetAxis
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierAutoFollowModifier_GetOffsetAxis final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierAutoFollowModifier_GetOffsetAxis;

// Function ActorModifierLayout.ActorModifierAutoFollowModifier.GetProgress
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierAutoFollowModifier_GetProgress final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierAutoFollowModifier_GetProgress;

// Function ActorModifierLayout.ActorModifierAutoFollowModifier.GetReferenceActor
// 0x0098 (0x0098 - 0x0000)
struct ActorModifierAutoFollowModifier_GetReferenceActor final
{
public:
	struct FActorModifierSceneTreeActor           ReturnValue;                                       // 0x0000(0x0098)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierAutoFollowModifier_GetReferenceActor;

// Function ActorModifierLayout.ActorModifierGridArrangeModifier.SetCount
// 0x0008 (0x0008 - 0x0000)
struct ActorModifierGridArrangeModifier_SetCount final
{
public:
	struct FIntPoint                              InCount;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierGridArrangeModifier_SetCount;

// Function ActorModifierLayout.ActorModifierGridArrangeModifier.SetSpread
// 0x0010 (0x0010 - 0x0000)
struct ActorModifierGridArrangeModifier_SetSpread final
{
public:
	struct FVector2D                              InSpread;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierGridArrangeModifier_SetSpread;

// Function ActorModifierLayout.ActorModifierGridArrangeModifier.SetStartCorner
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierGridArrangeModifier_SetStartCorner final
{
public:
	EActorModifierGridArrangeCorner2D             InCorner;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierGridArrangeModifier_SetStartCorner;

// Function ActorModifierLayout.ActorModifierGridArrangeModifier.SetStartDirection
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierGridArrangeModifier_SetStartDirection final
{
public:
	EActorModifierGridArrangeDirection            InDirection;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierGridArrangeModifier_SetStartDirection;

// Function ActorModifierLayout.ActorModifierGridArrangeModifier.GetCount
// 0x0008 (0x0008 - 0x0000)
struct ActorModifierGridArrangeModifier_GetCount final
{
public:
	struct FIntPoint                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierGridArrangeModifier_GetCount;

// Function ActorModifierLayout.ActorModifierGridArrangeModifier.GetSpread
// 0x0010 (0x0010 - 0x0000)
struct ActorModifierGridArrangeModifier_GetSpread final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierGridArrangeModifier_GetSpread;

// Function ActorModifierLayout.ActorModifierGridArrangeModifier.GetStartCorner
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierGridArrangeModifier_GetStartCorner final
{
public:
	EActorModifierGridArrangeCorner2D             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierGridArrangeModifier_GetStartCorner;

// Function ActorModifierLayout.ActorModifierGridArrangeModifier.GetStartDirection
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierGridArrangeModifier_GetStartDirection final
{
public:
	EActorModifierGridArrangeDirection            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierGridArrangeModifier_GetStartDirection;

// Function ActorModifierLayout.ActorModifierJustifyModifier.SetDepthAlignment
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierJustifyModifier_SetDepthAlignment final
{
public:
	EActorModifierJustifyDepth                    InDepthAlignment;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierJustifyModifier_SetDepthAlignment;

// Function ActorModifierLayout.ActorModifierJustifyModifier.SetDepthAnchor
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierJustifyModifier_SetDepthAnchor final
{
public:
	float                                         InDepthAnchor;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierJustifyModifier_SetDepthAnchor;

// Function ActorModifierLayout.ActorModifierJustifyModifier.SetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierJustifyModifier_SetHorizontalAlignment final
{
public:
	EActorModifierJustifyHorizontal               InHorizontalAlignment;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierJustifyModifier_SetHorizontalAlignment;

// Function ActorModifierLayout.ActorModifierJustifyModifier.SetHorizontalAnchor
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierJustifyModifier_SetHorizontalAnchor final
{
public:
	float                                         InHorizontalAnchor;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierJustifyModifier_SetHorizontalAnchor;

// Function ActorModifierLayout.ActorModifierJustifyModifier.SetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierJustifyModifier_SetVerticalAlignment final
{
public:
	EActorModifierJustifyVertical                 InVerticalAlignment;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierJustifyModifier_SetVerticalAlignment;

// Function ActorModifierLayout.ActorModifierJustifyModifier.SetVerticalAnchor
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierJustifyModifier_SetVerticalAnchor final
{
public:
	float                                         InVerticalAnchor;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierJustifyModifier_SetVerticalAnchor;

// Function ActorModifierLayout.ActorModifierJustifyModifier.GetDepthAlignment
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierJustifyModifier_GetDepthAlignment final
{
public:
	EActorModifierJustifyDepth                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierJustifyModifier_GetDepthAlignment;

// Function ActorModifierLayout.ActorModifierJustifyModifier.GetDepthAnchor
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierJustifyModifier_GetDepthAnchor final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierJustifyModifier_GetDepthAnchor;

// Function ActorModifierLayout.ActorModifierJustifyModifier.GetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierJustifyModifier_GetHorizontalAlignment final
{
public:
	EActorModifierJustifyHorizontal               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierJustifyModifier_GetHorizontalAlignment;

// Function ActorModifierLayout.ActorModifierJustifyModifier.GetHorizontalAnchor
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierJustifyModifier_GetHorizontalAnchor final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierJustifyModifier_GetHorizontalAnchor;

// Function ActorModifierLayout.ActorModifierJustifyModifier.GetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierJustifyModifier_GetVerticalAlignment final
{
public:
	EActorModifierJustifyVertical                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierJustifyModifier_GetVerticalAlignment;

// Function ActorModifierLayout.ActorModifierJustifyModifier.GetVerticalAnchor
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierJustifyModifier_GetVerticalAnchor final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierJustifyModifier_GetVerticalAnchor;

// Function ActorModifierLayout.ActorModifierLookAtModifier.SetFlipAxis
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierLookAtModifier_SetFlipAxis final
{
public:
	bool                                          bInFlipAxis;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierLookAtModifier_SetFlipAxis;

// Function ActorModifierLayout.ActorModifierLookAtModifier.SetOrientationAxis
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierLookAtModifier_SetOrientationAxis final
{
public:
	EActorModifierAxis                            InAxis;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierLookAtModifier_SetOrientationAxis;

// Function ActorModifierLayout.ActorModifierLookAtModifier.SetReferenceActor
// 0x0098 (0x0098 - 0x0000)
struct ActorModifierLookAtModifier_SetReferenceActor final
{
public:
	struct FActorModifierSceneTreeActor           InReferenceActor;                                  // 0x0000(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierLookAtModifier_SetReferenceActor;

// Function ActorModifierLayout.ActorModifierLookAtModifier.GetFlipAxis
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierLookAtModifier_GetFlipAxis final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierLookAtModifier_GetFlipAxis;

// Function ActorModifierLayout.ActorModifierLookAtModifier.GetOrientationAxis
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierLookAtModifier_GetOrientationAxis final
{
public:
	EActorModifierAxis                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierLookAtModifier_GetOrientationAxis;

// Function ActorModifierLayout.ActorModifierLookAtModifier.GetReferenceActor
// 0x0098 (0x0098 - 0x0000)
struct ActorModifierLookAtModifier_GetReferenceActor final
{
public:
	struct FActorModifierSceneTreeActor           ReturnValue;                                       // 0x0000(0x0098)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierLookAtModifier_GetReferenceActor;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.SetArrangement
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierRadialArrangeModifier_SetArrangement final
{
public:
	EActorModifierRadialArrangeMode               InArrangement;                                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_SetArrangement;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.SetBaseOrientation
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierRadialArrangeModifier_SetBaseOrientation final
{
public:
	struct FRotator                               InRotation;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_SetBaseOrientation;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.SetCount
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierRadialArrangeModifier_SetCount final
{
public:
	int32                                         InCount;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_SetCount;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.SetEndAngle
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierRadialArrangeModifier_SetEndAngle final
{
public:
	float                                         InEndAngle;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_SetEndAngle;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.SetFlipOrient
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierRadialArrangeModifier_SetFlipOrient final
{
public:
	bool                                          bInFlipOrient;                                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_SetFlipOrient;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.SetInnerRadius
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierRadialArrangeModifier_SetInnerRadius final
{
public:
	float                                         InInnerRadius;                                     // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_SetInnerRadius;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.SetOrient
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierRadialArrangeModifier_SetOrient final
{
public:
	bool                                          bInOrient;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_SetOrient;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.SetOrientationAxis
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierRadialArrangeModifier_SetOrientationAxis final
{
public:
	EActorModifierAxis                            InAxis;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_SetOrientationAxis;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.SetOuterRadius
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierRadialArrangeModifier_SetOuterRadius final
{
public:
	float                                         InOuterRadius;                                     // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_SetOuterRadius;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.SetRings
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierRadialArrangeModifier_SetRings final
{
public:
	int32                                         InRings;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_SetRings;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.SetStartAngle
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierRadialArrangeModifier_SetStartAngle final
{
public:
	float                                         InStartAngle;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_SetStartAngle;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.SetStartFromOuterRadius
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierRadialArrangeModifier_SetStartFromOuterRadius final
{
public:
	bool                                          bInStartFromOuterRadius;                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_SetStartFromOuterRadius;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.GetArrangement
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierRadialArrangeModifier_GetArrangement final
{
public:
	EActorModifierRadialArrangeMode               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_GetArrangement;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.GetBaseOrientation
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierRadialArrangeModifier_GetBaseOrientation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_GetBaseOrientation;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.GetCount
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierRadialArrangeModifier_GetCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_GetCount;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.GetEndAngle
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierRadialArrangeModifier_GetEndAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_GetEndAngle;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.GetFlipOrient
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierRadialArrangeModifier_GetFlipOrient final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_GetFlipOrient;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.GetInnerRadius
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierRadialArrangeModifier_GetInnerRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_GetInnerRadius;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.GetOrient
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierRadialArrangeModifier_GetOrient final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_GetOrient;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.GetOrientationAxis
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierRadialArrangeModifier_GetOrientationAxis final
{
public:
	EActorModifierAxis                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_GetOrientationAxis;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.GetOuterRadius
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierRadialArrangeModifier_GetOuterRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_GetOuterRadius;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.GetRings
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierRadialArrangeModifier_GetRings final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_GetRings;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.GetStartAngle
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierRadialArrangeModifier_GetStartAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_GetStartAngle;

// Function ActorModifierLayout.ActorModifierRadialArrangeModifier.GetStartFromOuterRadius
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierRadialArrangeModifier_GetStartFromOuterRadius final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierRadialArrangeModifier_GetStartFromOuterRadius;

// Function ActorModifierLayout.ActorModifierSplinePathModifier.SetBaseOrientation
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierSplinePathModifier_SetBaseOrientation final
{
public:
	struct FRotator                               InOrientation;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierSplinePathModifier_SetBaseOrientation;

// Function ActorModifierLayout.ActorModifierSplinePathModifier.SetDistance
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierSplinePathModifier_SetDistance final
{
public:
	float                                         InDistance;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierSplinePathModifier_SetDistance;

// Function ActorModifierLayout.ActorModifierSplinePathModifier.SetOrient
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierSplinePathModifier_SetOrient final
{
public:
	bool                                          bInOrient;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierSplinePathModifier_SetOrient;

// Function ActorModifierLayout.ActorModifierSplinePathModifier.SetPointIndex
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierSplinePathModifier_SetPointIndex final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierSplinePathModifier_SetPointIndex;

// Function ActorModifierLayout.ActorModifierSplinePathModifier.SetProgress
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierSplinePathModifier_SetProgress final
{
public:
	float                                         InProgress;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierSplinePathModifier_SetProgress;

// Function ActorModifierLayout.ActorModifierSplinePathModifier.SetSampleMode
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierSplinePathModifier_SetSampleMode final
{
public:
	EActorModifierLayoutSplinePathSampleMode      InMode;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierSplinePathModifier_SetSampleMode;

// Function ActorModifierLayout.ActorModifierSplinePathModifier.SetScale
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierSplinePathModifier_SetScale final
{
public:
	bool                                          bInScale;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierSplinePathModifier_SetScale;

// Function ActorModifierLayout.ActorModifierSplinePathModifier.SetSplineActor
// 0x0008 (0x0008 - 0x0000)
struct ActorModifierSplinePathModifier_SetSplineActor final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierSplinePathModifier_SetSplineActor;

// Function ActorModifierLayout.ActorModifierSplinePathModifier.SetTime
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierSplinePathModifier_SetTime final
{
public:
	float                                         InTime;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierSplinePathModifier_SetTime;

// Function ActorModifierLayout.ActorModifierSplinePathModifier.GetBaseOrientation
// 0x0018 (0x0018 - 0x0000)
struct ActorModifierSplinePathModifier_GetBaseOrientation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierSplinePathModifier_GetBaseOrientation;

// Function ActorModifierLayout.ActorModifierSplinePathModifier.GetDistance
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierSplinePathModifier_GetDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierSplinePathModifier_GetDistance;

// Function ActorModifierLayout.ActorModifierSplinePathModifier.GetOrient
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierSplinePathModifier_GetOrient final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierSplinePathModifier_GetOrient;

// Function ActorModifierLayout.ActorModifierSplinePathModifier.GetPointIndex
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierSplinePathModifier_GetPointIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierSplinePathModifier_GetPointIndex;

// Function ActorModifierLayout.ActorModifierSplinePathModifier.GetProgress
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierSplinePathModifier_GetProgress final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierSplinePathModifier_GetProgress;

// Function ActorModifierLayout.ActorModifierSplinePathModifier.GetSampleMode
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierSplinePathModifier_GetSampleMode final
{
public:
	EActorModifierLayoutSplinePathSampleMode      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierSplinePathModifier_GetSampleMode;

// Function ActorModifierLayout.ActorModifierSplinePathModifier.GetScale
// 0x0001 (0x0001 - 0x0000)
struct ActorModifierSplinePathModifier_GetScale final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierSplinePathModifier_GetScale;

// Function ActorModifierLayout.ActorModifierSplinePathModifier.GetSplineActor
// 0x0008 (0x0008 - 0x0000)
struct ActorModifierSplinePathModifier_GetSplineActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierSplinePathModifier_GetSplineActor;

// Function ActorModifierLayout.ActorModifierSplinePathModifier.GetTime
// 0x0004 (0x0004 - 0x0000)
struct ActorModifierSplinePathModifier_GetTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorModifierSplinePathModifier_GetTime;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
