#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorModifierCore

#include "Basic.hpp"


SDK_NAMESPACE_START

// Enum ActorModifierCore.EActorModifierCoreEnableReason
// NumValues: 0x0005
enum class EActorModifierCoreEnableReason : uint8
{
	User                                     = 0,
	Load                                     = 1,
	Undo                                     = 2,
	Duplicate                                = 3,
	EActorModifierCoreEnableReason_MAX       = 4,
};

// Enum ActorModifierCore.EActorModifierCoreDisableReason
// NumValues: 0x0004
enum class EActorModifierCoreDisableReason : uint8
{
	User                                     = 0,
	Undo                                     = 1,
	Destroyed                                = 2,
	EActorModifierCoreDisableReason_MAX      = 3,
};

// Enum ActorModifierCore.EActorModifierCoreStackPosition
// NumValues: 0x0003
enum class EActorModifierCoreStackPosition : uint8
{
	Before                                   = 0,
	After                                    = 1,
	EActorModifierCoreStackPosition_MAX      = 2,
};

// ScriptStruct ActorModifierCore.ActorModifierCoreMetadata
// 0x01F0 (0x01F0 - 0x0000)
struct alignas(0x10) FActorModifierCoreMetadata final
{
public:
	uint8                                         Pad_0[0x1F0];                                      // 0x0000(0x01F0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FActorModifierCoreMetadata;

// ScriptStruct ActorModifierCore.ActorModifierCoreExecutionTask
// 0x0020 (0x0020 - 0x0000)
struct FActorModifierCoreExecutionTask final
{
public:
	class UActorModifierCoreStack*                ModifierStack;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<class UActorModifierCoreBase*>         Modifiers;                                         // 0x0008(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FActorModifierCoreExecutionTask;

// ScriptStruct ActorModifierCore.ActorModifierCoreInsertOperation
// 0x0018 (0x0018 - 0x0000)
struct FActorModifierCoreInsertOperation final
{
public:
	TSubclassOf<class UActorModifierCoreBase>     ModifierClass;                                     // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EActorModifierCoreStackPosition               InsertPosition;                                    // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorModifierCoreBase*                 InsertPositionContext;                             // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FActorModifierCoreInsertOperation;

// ScriptStruct ActorModifierCore.ActorModifierCoreCloneOperation
// 0x0018 (0x0018 - 0x0000)
struct FActorModifierCoreCloneOperation final
{
public:
	class UActorModifierCoreBase*                 CloneModifier;                                     // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	EActorModifierCoreStackPosition               ClonePosition;                                     // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorModifierCoreBase*                 ClonePositionContext;                              // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FActorModifierCoreCloneOperation;

// ScriptStruct ActorModifierCore.ActorModifierCoreMoveOperation
// 0x0018 (0x0018 - 0x0000)
struct FActorModifierCoreMoveOperation final
{
public:
	class UActorModifierCoreBase*                 MoveModifier;                                      // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	EActorModifierCoreStackPosition               MovePosition;                                      // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorModifierCoreBase*                 MovePositionContext;                               // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FActorModifierCoreMoveOperation;

// ScriptStruct ActorModifierCore.ActorModifierCoreRemoveOperation
// 0x0010 (0x0010 - 0x0000)
struct FActorModifierCoreRemoveOperation final
{
public:
	class UActorModifierCoreBase*                 RemoveModifier;                                    // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	bool                                          bRemoveDependencies;                               // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FActorModifierCoreRemoveOperation;

SDK_NAMESPACE_END
