#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorModifier

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// Enum ActorModifier.EActorModifierReferenceContainer
// NumValues: 0x0006
enum class EActorModifierReferenceContainer : uint8
{
	Previous                                 = 0,
	Next                                     = 1,
	First                                    = 2,
	Last                                     = 3,
	Other                                    = 4,
	EActorModifierReferenceContainer_MAX     = 5,
};

// Enum ActorModifier.EActorModifierTransformSharedState
// NumValues: 0x0009
enum class EActorModifierTransformSharedState : uint8
{
	None                                     = 0,
	Location                                 = 1,
	Rotation                                 = 2,
	Scale                                    = 4,
	LocationRotation                         = 3,
	LocationScale                            = 5,
	RotationScale                            = 6,
	All                                      = 7,
	EActorModifierTransformSharedState_MAX   = 8,
};

// Enum ActorModifier.EActorModifierAxis
// NumValues: 0x0005
enum class EActorModifierAxis : uint8
{
	None                                     = 0,
	X                                        = 1,
	Y                                        = 2,
	Z                                        = 4,
	EActorModifierAxis_MAX                   = 5,
};

// Enum ActorModifier.EActorModifierVerticalAlignment
// NumValues: 0x0004
enum class EActorModifierVerticalAlignment : uint8
{
	Top                                      = 0,
	Center                                   = 1,
	Bottom                                   = 2,
	EActorModifierVerticalAlignment_MAX      = 3,
};

// Enum ActorModifier.EActorModifierHorizontalAlignment
// NumValues: 0x0004
enum class EActorModifierHorizontalAlignment : uint8
{
	Left                                     = 0,
	Center                                   = 1,
	Right                                    = 2,
	EActorModifierHorizontalAlignment_MAX    = 3,
};

// Enum ActorModifier.EActorModifierDepthAlignment
// NumValues: 0x0004
enum class EActorModifierDepthAlignment : uint8
{
	Front                                    = 0,
	Center                                   = 1,
	Back                                     = 2,
	EActorModifierDepthAlignment_MAX         = 3,
};

// Enum ActorModifier.EActorModifierAlignment
// NumValues: 0x0004
enum class EActorModifierAlignment : uint8
{
	Horizontal                               = 0,
	Vertical                                 = 1,
	Depth                                    = 2,
	EActorModifierAlignment_MAX              = 3,
};

// Enum ActorModifier.EActorModifierVisibilityActor
// NumValues: 0x0005
enum class EActorModifierVisibilityActor : uint8
{
	None                                     = 0,
	Game                                     = 1,
	Editor                                   = 2,
	GameAndEditor                            = 3,
	EActorModifierVisibilityActor_MAX        = 4,
};

// ScriptStruct ActorModifier.ActorModifierSceneTreeActor
// 0x0098 (0x0098 - 0x0000)
struct FActorModifierSceneTreeActor final
{
public:
	EActorModifierReferenceContainer              ReferenceContainer;                                // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  ReferenceActorWeak;                                // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipHiddenActors;                                 // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<TWeakObjectPtr<class AActor>>            ReferenceActorChildrenWeak;                        // 0x0010(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AActor>>          ReferenceActorDirectChildrenWeak;                  // 0x0060(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AActor>>          ReferenceActorsWeak;                               // 0x0070(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AActor>>          ReferenceActorParentsWeak;                         // 0x0080(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  LocalActorWeak;                                    // 0x0090(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FActorModifierSceneTreeActor;

// ScriptStruct ActorModifier.ActorModifierTransformSharedModifierState
// 0x0080 (0x0080 - 0x0000)
struct FActorModifierTransformSharedModifierState final
{
public:
	TWeakObjectPtr<class UActorModifierCoreBase>  ModifierWeak;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ActorTransform;                                    // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EActorModifierTransformSharedState            SaveState;                                         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FActorModifierTransformSharedModifierState;

// ScriptStruct ActorModifier.ActorModifierTransformSharedActorState
// 0x00D0 (0x00D0 - 0x0000)
struct FActorModifierTransformSharedActorState final
{
public:
	TSet<struct FActorModifierTransformSharedModifierState> ModifierStates;                          // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  ActorWeak;                                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ActorTransform;                                    // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EActorModifierTransformSharedState            SaveState;                                         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0xF];                                       // 0x00C1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FActorModifierTransformSharedActorState;

// ScriptStruct ActorModifier.ActorModifierAnchorAlignment
// 0x0006 (0x0006 - 0x0000)
struct FActorModifierAnchorAlignment final
{
public:
	bool                                          bUseHorizontal;                                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseVertical;                                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDepth;                                         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EActorModifierHorizontalAlignment             Horizontal;                                        // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EActorModifierVerticalAlignment               Vertical;                                          // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EActorModifierDepthAlignment                  Depth;                                             // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FActorModifierAnchorAlignment;

// ScriptStruct ActorModifier.ActorModifierVisibilitySharedModifierState
// 0x000C (0x000C - 0x0000)
struct FActorModifierVisibilitySharedModifierState final
{
public:
	TWeakObjectPtr<class UActorModifierCoreBase>  ModifierWeak;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActorHiddenInGame;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FActorModifierVisibilitySharedModifierState;

// ScriptStruct ActorModifier.ActorModifierVisibilitySharedActorState
// 0x0060 (0x0060 - 0x0000)
struct FActorModifierVisibilitySharedActorState final
{
public:
	TSet<struct FActorModifierVisibilitySharedModifierState> ModifierStates;                         // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  ActorWeak;                                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActorHiddenInGame;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FActorModifierVisibilitySharedActorState;

SDK_NAMESPACE_END
