#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Agones

#include "Basic.hpp"

#include "Agones_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function Agones.AgonesComponent.Allocate
// 0x0020 (0x0020 - 0x0000)
struct AgonesComponent_Allocate final
{
public:
	TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate;                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesComponent_Allocate;

// Function Agones.AgonesComponent.ConnectSuccess
// 0x0138 (0x0138 - 0x0000)
struct AgonesComponent_ConnectSuccess final
{
public:
	struct FGameServerResponse                    GameServerResponse;                                // 0x0000(0x0138)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesComponent_ConnectSuccess;

// Function Agones.AgonesComponent.GameServer
// 0x0020 (0x0020 - 0x0000)
struct AgonesComponent_GameServer final
{
public:
	TDelegate<void(const struct FGameServerResponse& Response)> SuccessDelegate;                     // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesComponent_GameServer;

// Function Agones.AgonesComponent.GetConnectedPlayers
// 0x0020 (0x0020 - 0x0000)
struct AgonesComponent_GetConnectedPlayers final
{
public:
	TDelegate<void(const struct FConnectedPlayersResponse& Response)> SuccessDelegate;               // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesComponent_GetConnectedPlayers;

// Function Agones.AgonesComponent.GetPlayerCapacity
// 0x0020 (0x0020 - 0x0000)
struct AgonesComponent_GetPlayerCapacity final
{
public:
	TDelegate<void(const struct FCountResponse& Response)> SuccessDelegate;                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesComponent_GetPlayerCapacity;

// Function Agones.AgonesComponent.GetPlayerCount
// 0x0020 (0x0020 - 0x0000)
struct AgonesComponent_GetPlayerCount final
{
public:
	TDelegate<void(const struct FCountResponse& Response)> SuccessDelegate;                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesComponent_GetPlayerCount;

// Function Agones.AgonesComponent.Health
// 0x0020 (0x0020 - 0x0000)
struct AgonesComponent_Health final
{
public:
	TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate;                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesComponent_Health;

// Function Agones.AgonesComponent.HealthPing
// 0x0004 (0x0004 - 0x0000)
struct AgonesComponent_HealthPing final
{
public:
	float                                         RateSeconds;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesComponent_HealthPing;

// Function Agones.AgonesComponent.IsPlayerConnected
// 0x0030 (0x0030 - 0x0000)
struct AgonesComponent_IsPlayerConnected final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FConnectedResponse& Response)> SuccessDelegate;                      // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesComponent_IsPlayerConnected;

// Function Agones.AgonesComponent.PlayerConnect
// 0x0030 (0x0030 - 0x0000)
struct AgonesComponent_PlayerConnect final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FConnectedResponse& Response)> SuccessDelegate;                      // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesComponent_PlayerConnect;

// Function Agones.AgonesComponent.PlayerDisconnect
// 0x0030 (0x0030 - 0x0000)
struct AgonesComponent_PlayerDisconnect final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FDisconnectResponse& Response)> SuccessDelegate;                     // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesComponent_PlayerDisconnect;

// Function Agones.AgonesComponent.Ready
// 0x0020 (0x0020 - 0x0000)
struct AgonesComponent_Ready final
{
public:
	TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate;                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesComponent_Ready;

// Function Agones.AgonesComponent.Reserve
// 0x0028 (0x0028 - 0x0000)
struct AgonesComponent_Reserve final
{
public:
	int64                                         Seconds;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate;                          // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesComponent_Reserve;

// Function Agones.AgonesComponent.SetAnnotation
// 0x0040 (0x0040 - 0x0000)
struct AgonesComponent_SetAnnotation final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate;                          // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0030(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesComponent_SetAnnotation;

// Function Agones.AgonesComponent.SetLabel
// 0x0040 (0x0040 - 0x0000)
struct AgonesComponent_SetLabel final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate;                          // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0030(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesComponent_SetLabel;

// Function Agones.AgonesComponent.SetPlayerCapacity
// 0x0028 (0x0028 - 0x0000)
struct AgonesComponent_SetPlayerCapacity final
{
public:
	int64                                         Count;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate;                          // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesComponent_SetPlayerCapacity;

// Function Agones.AgonesComponent.Shutdown
// 0x0020 (0x0020 - 0x0000)
struct AgonesComponent_Shutdown final
{
public:
	TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate;                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesComponent_Shutdown;

// Function Agones.AgonesComponent.WatchGameServer
// 0x0010 (0x0010 - 0x0000)
struct AgonesComponent_WatchGameServer final
{
public:
	TDelegate<void(const struct FGameServerResponse& Response)> WatchDelegate;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesComponent_WatchGameServer;

// Function Agones.AgonesSubsystem.Allocate
// 0x0020 (0x0020 - 0x0000)
struct AgonesSubsystem_Allocate final
{
public:
	TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate;                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesSubsystem_Allocate;

// Function Agones.AgonesSubsystem.ConnectSuccess
// 0x0138 (0x0138 - 0x0000)
struct AgonesSubsystem_ConnectSuccess final
{
public:
	struct FGameServerResponse                    GameServerResponse;                                // 0x0000(0x0138)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesSubsystem_ConnectSuccess;

// Function Agones.AgonesSubsystem.GameServer
// 0x0020 (0x0020 - 0x0000)
struct AgonesSubsystem_GameServer final
{
public:
	TDelegate<void(const struct FGameServerResponse& Response)> SuccessDelegate;                     // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesSubsystem_GameServer;

// Function Agones.AgonesSubsystem.GetConnectedPlayers
// 0x0020 (0x0020 - 0x0000)
struct AgonesSubsystem_GetConnectedPlayers final
{
public:
	TDelegate<void(const struct FConnectedPlayersResponse& Response)> SuccessDelegate;               // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesSubsystem_GetConnectedPlayers;

// Function Agones.AgonesSubsystem.GetPlayerCapacity
// 0x0020 (0x0020 - 0x0000)
struct AgonesSubsystem_GetPlayerCapacity final
{
public:
	TDelegate<void(const struct FCountResponse& Response)> SuccessDelegate;                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesSubsystem_GetPlayerCapacity;

// Function Agones.AgonesSubsystem.GetPlayerCount
// 0x0020 (0x0020 - 0x0000)
struct AgonesSubsystem_GetPlayerCount final
{
public:
	TDelegate<void(const struct FCountResponse& Response)> SuccessDelegate;                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesSubsystem_GetPlayerCount;

// Function Agones.AgonesSubsystem.Health
// 0x0020 (0x0020 - 0x0000)
struct AgonesSubsystem_Health final
{
public:
	TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate;                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesSubsystem_Health;

// Function Agones.AgonesSubsystem.HealthPing
// 0x0004 (0x0004 - 0x0000)
struct AgonesSubsystem_HealthPing final
{
public:
	float                                         RateSeconds;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesSubsystem_HealthPing;

// Function Agones.AgonesSubsystem.IsConnected
// 0x0001 (0x0001 - 0x0000)
struct AgonesSubsystem_IsConnected final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesSubsystem_IsConnected;

// Function Agones.AgonesSubsystem.IsPlayerConnected
// 0x0030 (0x0030 - 0x0000)
struct AgonesSubsystem_IsPlayerConnected final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FConnectedResponse& Response)> SuccessDelegate;                      // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesSubsystem_IsPlayerConnected;

// Function Agones.AgonesSubsystem.PlayerConnect
// 0x0030 (0x0030 - 0x0000)
struct AgonesSubsystem_PlayerConnect final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FConnectedResponse& Response)> SuccessDelegate;                      // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesSubsystem_PlayerConnect;

// Function Agones.AgonesSubsystem.PlayerDisconnect
// 0x0030 (0x0030 - 0x0000)
struct AgonesSubsystem_PlayerDisconnect final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FDisconnectResponse& Response)> SuccessDelegate;                     // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesSubsystem_PlayerDisconnect;

// Function Agones.AgonesSubsystem.Ready
// 0x0020 (0x0020 - 0x0000)
struct AgonesSubsystem_Ready final
{
public:
	TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate;                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesSubsystem_Ready;

// Function Agones.AgonesSubsystem.Reserve
// 0x0028 (0x0028 - 0x0000)
struct AgonesSubsystem_Reserve final
{
public:
	int64                                         Seconds;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate;                          // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesSubsystem_Reserve;

// Function Agones.AgonesSubsystem.SetAnnotation
// 0x0040 (0x0040 - 0x0000)
struct AgonesSubsystem_SetAnnotation final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate;                          // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0030(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesSubsystem_SetAnnotation;

// Function Agones.AgonesSubsystem.SetLabel
// 0x0040 (0x0040 - 0x0000)
struct AgonesSubsystem_SetLabel final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate;                          // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0030(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesSubsystem_SetLabel;

// Function Agones.AgonesSubsystem.SetPlayerCapacity
// 0x0028 (0x0028 - 0x0000)
struct AgonesSubsystem_SetPlayerCapacity final
{
public:
	int64                                         Count;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate;                          // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesSubsystem_SetPlayerCapacity;

// Function Agones.AgonesSubsystem.Shutdown
// 0x0020 (0x0020 - 0x0000)
struct AgonesSubsystem_Shutdown final
{
public:
	TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate;                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesSubsystem_Shutdown;

// Function Agones.AgonesSubsystem.WatchGameServer
// 0x0010 (0x0010 - 0x0000)
struct AgonesSubsystem_WatchGameServer final
{
public:
	TDelegate<void(const struct FGameServerResponse& Response)> WatchDelegate;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AgonesSubsystem_WatchGameServer;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
