#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Agones

#include "Basic.hpp"

#include "Agones_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// Class Agones.AgonesComponent
// 0x0070 (0x0128 - 0x00B8)
class UAgonesComponent final : public UActorComponent
{
public:
	class FString                                 HttpPort;                                          // 0x00B8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HealthRateSeconds;                                 // 0x00C8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableAutoConnect;                               // 0x00CC(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FGameServerResponse& Response)> ConnectedDelegate;    // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0[0x48];                                      // 0x00E0(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Allocate(TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void Connect();
	void ConnectSuccess(const struct FGameServerResponse& GameServerResponse);
	void GameServer(TDelegate<void(const struct FGameServerResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void GetConnectedPlayers(TDelegate<void(const struct FConnectedPlayersResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void GetPlayerCapacity(TDelegate<void(const struct FCountResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void GetPlayerCount(TDelegate<void(const struct FCountResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void Health(TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void HealthPing(float RateSeconds);
	void IsPlayerConnected(const class FString& PlayerId, TDelegate<void(const struct FConnectedResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void PlayerConnect(const class FString& PlayerId, TDelegate<void(const struct FConnectedResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void PlayerDisconnect(const class FString& PlayerId, TDelegate<void(const struct FDisconnectResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void Ready(TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void Reserve(int64 Seconds, TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void SetAnnotation(const class FString& Key, const class FString& Value, TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void SetLabel(const class FString& Key, const class FString& Value, TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void SetPlayerCapacity(int64 Count, TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void Shutdown(TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void WatchGameServer(TDelegate<void(const struct FGameServerResponse& Response)> WatchDelegate);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AgonesComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AgonesComponent")
	}
	static class UAgonesComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAgonesComponent>();
	}
};
DUMPER7_ASSERTS_UAgonesComponent;

// Class Agones.AgonesSubsystem
// 0x0078 (0x00A8 - 0x0030)
class UAgonesSubsystem final : public UGameInstanceSubsystem
{
public:
	class FString                                 HttpPort;                                          // 0x0030(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HealthRateSeconds;                                 // 0x0040(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FGameServerResponse& Response)> ConnectedDelegate;    // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x50];                                      // 0x0058(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Allocate(TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void Connect();
	void ConnectSuccess(const struct FGameServerResponse& GameServerResponse);
	void GameServer(TDelegate<void(const struct FGameServerResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void GetConnectedPlayers(TDelegate<void(const struct FConnectedPlayersResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void GetPlayerCapacity(TDelegate<void(const struct FCountResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void GetPlayerCount(TDelegate<void(const struct FCountResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void Health(TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void HealthPing(float RateSeconds);
	bool IsConnected();
	void IsPlayerConnected(const class FString& PlayerId, TDelegate<void(const struct FConnectedResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void PlayerConnect(const class FString& PlayerId, TDelegate<void(const struct FConnectedResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void PlayerDisconnect(const class FString& PlayerId, TDelegate<void(const struct FDisconnectResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void Ready(TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void Reserve(int64 Seconds, TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void SetAnnotation(const class FString& Key, const class FString& Value, TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void SetLabel(const class FString& Key, const class FString& Value, TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void SetPlayerCapacity(int64 Count, TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void Shutdown(TDelegate<void(const struct FEmptyResponse& Response)> SuccessDelegate, TDelegate<void(const struct FAgonesError& Error)> ErrorDelegate);
	void WatchGameServer(TDelegate<void(const struct FGameServerResponse& Response)> WatchDelegate);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AgonesSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AgonesSubsystem")
	}
	static class UAgonesSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAgonesSubsystem>();
	}
};
DUMPER7_ASSERTS_UAgonesSubsystem;

SDK_NAMESPACE_END
