#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Avalanche

#include "Basic.hpp"

#include "AvalancheTag_structs.hpp"
#include "AvalancheRemoteControl_structs.hpp"
#include "AvalancheTransition_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function Avalanche.AvaTransitionAttributeLibrary.AddNameAttribute
// 0x0018 (0x0018 - 0x0000)
struct AvaTransitionAttributeLibrary_AddNameAttribute final
{
public:
	class UObject*                                InTransitionNode;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InName;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AvaTransitionAttributeLibrary_AddNameAttribute;

// Function Avalanche.AvaTransitionAttributeLibrary.AddTagAttribute
// 0x0028 (0x0028 - 0x0000)
struct AvaTransitionAttributeLibrary_AddTagAttribute final
{
public:
	class UObject*                                InTransitionNode;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAvaTagHandle                          InTagHandle;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AvaTransitionAttributeLibrary_AddTagAttribute;

// Function Avalanche.AvaTransitionAttributeLibrary.ContainsNameAttribute
// 0x0018 (0x0018 - 0x0000)
struct AvaTransitionAttributeLibrary_ContainsNameAttribute final
{
public:
	class UObject*                                InTransitionNode;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InName;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AvaTransitionAttributeLibrary_ContainsNameAttribute;

// Function Avalanche.AvaTransitionAttributeLibrary.ContainsTagAttribute
// 0x0028 (0x0028 - 0x0000)
struct AvaTransitionAttributeLibrary_ContainsTagAttribute final
{
public:
	class UObject*                                InTransitionNode;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAvaTagHandle                          InTagHandle;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AvaTransitionAttributeLibrary_ContainsTagAttribute;

// Function Avalanche.AvaTransitionAttributeLibrary.RemoveNameAttribute
// 0x0018 (0x0018 - 0x0000)
struct AvaTransitionAttributeLibrary_RemoveNameAttribute final
{
public:
	class UObject*                                InTransitionNode;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InName;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AvaTransitionAttributeLibrary_RemoveNameAttribute;

// Function Avalanche.AvaTransitionAttributeLibrary.RemoveTagAttribute
// 0x0028 (0x0028 - 0x0000)
struct AvaTransitionAttributeLibrary_RemoveTagAttribute final
{
public:
	class UObject*                                InTransitionNode;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAvaTagHandle                          InTagHandle;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AvaTransitionAttributeLibrary_RemoveTagAttribute;

// Function Avalanche.AvaTransitionRCLibrary.CompareRCControllerValues
// 0x0018 (0x0018 - 0x0000)
struct AvaTransitionRCLibrary_CompareRCControllerValues final
{
public:
	class UObject*                                InTransitionNode;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAvaRCControllerId                     InControllerId;                                    // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EAvaTransitionComparisonResult                InValueComparisonType;                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AvaTransitionRCLibrary_CompareRCControllerValues;

// Function Avalanche.AvaTransitionRCLibrary.GetChangedRCControllers
// 0x0018 (0x0018 - 0x0000)
struct AvaTransitionRCLibrary_GetChangedRCControllers final
{
public:
	class UObject*                                InTransitionNode;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class URCVirtualPropertyBase*>         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaTransitionRCLibrary_GetChangedRCControllers;

// Function Avalanche.AvaGizmoObjectInterface.ToggleGizmo
// 0x0010 (0x0010 - 0x0000)
struct AvaGizmoObjectInterface_ToggleGizmo final
{
public:
	const class UAvaGizmoComponent*               InGizmoComponent;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowAsGizmo;                                      // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AvaGizmoObjectInterface_ToggleGizmo;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
