#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvalancheModifiers

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ActorModifierCore_classes.hpp"
#include "AvalancheModifiers_structs.hpp"
#include "ActorModifier_structs.hpp"
#include "ActorModifier_classes.hpp"
#include "ClonerEffectorMeshBuilder_structs.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START

// Class AvalancheModifiers.AvaGeometryBaseModifier
// 0x0270 (0x0330 - 0x00C0)
class UAvaGeometryBaseModifier : public UActorModifierCoreBase
{
public:
	uint8                                         Pad_C0[0x268];                                     // 0x00C0(0x0268)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UDynamicMeshComponent>   MeshComponent;                                     // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaGeometryBaseModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaGeometryBaseModifier")
	}
	static class UAvaGeometryBaseModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaGeometryBaseModifier>();
	}
};
DUMPER7_ASSERTS_UAvaGeometryBaseModifier;

// Class AvalancheModifiers.AvaAutoSizeModifier
// 0x0158 (0x0488 - 0x0330)
class UAvaAutoSizeModifier final : public UAvaGeometryBaseModifier
{
public:
	uint8                                         Pad_330[0x18];                                     // 0x0330(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActorModifierSceneTreeActor           ReferenceActor;                                    // 0x0348(0x0098)(Edit, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	EActorModifierReferenceContainer              ReferenceContainer;                                // 0x03E0(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  ReferenceActorWeak;                                // 0x03E4(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIgnoreHiddenActors;                               // 0x03EC(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3ED[0x3];                                      // 0x03ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PaddingVertical;                                   // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        PaddingHorizontal;                                 // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAvaAutoSizeFitMode                           FitMode;                                           // 0x0400(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIncludeChildren;                                  // 0x0401(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_402[0x2];                                      // 0x0402(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                Padding;                                           // 0x0404(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              PreModifierShapeDynMesh2DSize;                     // 0x0418(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UAvaShape2DDynMeshBase>  ShapeDynMesh2DWeak;                                // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                CachedFollowLocation;                              // 0x0430(0x0018)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, TextExportTransient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBox                                   CachedReferenceBounds;                             // 0x0448(0x0038)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, TextExportTransient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDeprecatedPropertiesMigrated;                     // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetFitMode(const EAvaAutoSizeFitMode InFitMode);
	void SetIncludeChildren(bool bInIncludeChildren);
	void SetPaddingHorizontal(double InPadding);
	void SetPaddingVertical(double InPadding);
	void SetReferenceActor(const struct FActorModifierSceneTreeActor& InReferenceActor);

	EAvaAutoSizeFitMode GetFitMode() const;
	bool GetIncludeChildren() const;
	double GetPaddingHorizontal() const;
	double GetPaddingVertical() const;
	const struct FActorModifierSceneTreeActor GetReferenceActor() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaAutoSizeModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaAutoSizeModifier")
	}
	static class UAvaAutoSizeModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaAutoSizeModifier>();
	}
};
DUMPER7_ASSERTS_UAvaAutoSizeModifier;

// Class AvalancheModifiers.AvaBendModifier
// 0x0040 (0x0370 - 0x0330)
class UAvaBendModifier final : public UAvaGeometryBaseModifier
{
public:
	struct FVector                                BendPosition;                                      // 0x0330(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               BendRotation;                                      // 0x0348(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         Angle;                                             // 0x0360(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Extent;                                            // 0x0364(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSymmetricExtents;                                 // 0x0368(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBidirectional;                                    // 0x0369(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_36A[0x6];                                      // 0x036A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAngle(float InAngle);
	void SetBendPosition(const struct FVector& InBendPosition);
	void SetBendRotation(const struct FRotator& InBendRotation);
	void SetBidirectional(bool bInBidirectional);
	void SetExtent(float InExtent);
	void SetSymmetricExtents(bool bInSymmetricExtents);

	float GetAngle() const;
	const struct FVector GetBendPosition() const;
	const struct FRotator GetBendRotation() const;
	bool GetBidirectional() const;
	float GetExtent() const;
	bool GetSymmetricExtents() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaBendModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaBendModifier")
	}
	static class UAvaBendModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaBendModifier>();
	}
};
DUMPER7_ASSERTS_UAvaBendModifier;

// Class AvalancheModifiers.AvaBevelModifier
// 0x0010 (0x0340 - 0x0330)
class UAvaBevelModifier final : public UAvaGeometryBaseModifier
{
public:
	float                                         Inset;                                             // 0x0330(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         Iterations;                                        // 0x0334(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Roundness;                                         // 0x0338(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetInset(float InBevel);
	void SetIterations(int32 InIterations);
	void SetRoundness(float InRoundness);

	float GetInset() const;
	int32 GetIterations() const;
	float GetRoundness() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaBevelModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaBevelModifier")
	}
	static class UAvaBevelModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaBevelModifier>();
	}
};
DUMPER7_ASSERTS_UAvaBevelModifier;

// Class AvalancheModifiers.AvaBooleanModifier
// 0x0110 (0x0440 - 0x0330)
class UAvaBooleanModifier final : public UAvaGeometryBaseModifier
{
public:
	uint8                                         Pad_330[0x8];                                      // 0x0330(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EAvaBooleanMode                               Mode;                                              // 0x0338(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Channel;                                           // 0x0339(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_33A[0x6];                                      // 0x033A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaModifiersParametricMaterial        ParametricMaskMaterial;                            // 0x0340(0x0020)(Transient, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UMaterialInterface*>             OriginalMaterials;                                 // 0x0360(0x0010)(ZeroConstructor, DuplicateTransient, NonTransactional, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	TSet<TWeakObjectPtr<class UAvaBooleanModifier>> CollidingModifiers;                              // 0x0370(0x0050)(DuplicateTransient, NonTransactional, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FAvaBooleanModifierSharedChannelInfo   ChannelInfo;                                       // 0x03C0(0x0014)(Transient, DuplicateTransient, NoDestructor, Protected, TextExportTransient, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D4[0xC];                                      // 0x03D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LastTransform;                                     // 0x03E0(0x0060)(Transient, DuplicateTransient, IsPlainOldData, NoDestructor, TextExportTransient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetChannel(uint8 InChannel);
	void SetMode(EAvaBooleanMode InMode);

	uint8 GetChannel() const;
	EAvaBooleanMode GetMode() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaBooleanModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaBooleanModifier")
	}
	static class UAvaBooleanModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaBooleanModifier>();
	}
};
DUMPER7_ASSERTS_UAvaBooleanModifier;

// Class AvalancheModifiers.AvaBooleanModifierShared
// 0x0050 (0x0078 - 0x0028)
class UAvaBooleanModifierShared final : public UActorModifierCoreSharedObject
{
public:
	TMap<uint8, struct FAvaBooleanModifierSharedChannel> Channels;                                   // 0x0028(0x0050)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaBooleanModifierShared")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaBooleanModifierShared")
	}
	static class UAvaBooleanModifierShared* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaBooleanModifierShared>();
	}
};
DUMPER7_ASSERTS_UAvaBooleanModifierShared;

// Class AvalancheModifiers.AvaDynamicMeshConverterModifier
// 0x01D8 (0x0508 - 0x0330)
class UAvaDynamicMeshConverterModifier final : public UAvaGeometryBaseModifier
{
public:
	uint8                                         Pad_330[0x10];                                     // 0x0330(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  SourceActorWeak;                                   // 0x0340(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ComponentType;                                     // 0x0348(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAvaDynamicMeshConverterModifierFilter        FilterActorMode;                                   // 0x034C(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<TSubclassOf<class AActor>>               FilterActorClasses;                                // 0x0350(0x0050)(Edit, DisableEditOnTemplate, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	bool                                          bIncludeAttachedActors;                            // 0x03A0(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHideConvertedMesh;                                // 0x03A1(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A2[0x2];                                      // 0x03A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UpdateInterval;                                    // 0x03A4(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bComponentCreated;                                 // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FAvaDynamicMeshConverterModifierComponentState> ConvertedComponents;                 // 0x03B0(0x0050)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FCEMeshBuilder                         MeshBuilder;                                       // 0x0400(0x0068)(Transient, DuplicateTransient, NonTransactional, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_468[0xA0];                                     // 0x0468(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetComponentTypes(const TSet<EAvaDynamicMeshConverterModifierType>& InTypes);
	void SetFilterActorClasses(const TSet<TSubclassOf<class AActor>>& InClasses);
	void SetFilterActorMode(EAvaDynamicMeshConverterModifierFilter InFilter);
	void SetHideConvertedMesh(bool bInHide);
	void SetIncludeAttachedActors(bool bInInclude);
	void SetSourceActor(class AActor* InActor);
	void SetUpdateInterval(float InInterval);

	TSet<EAvaDynamicMeshConverterModifierType> GetComponentTypes() const;
	const TSet<TSubclassOf<class AActor>> GetFilterActorClasses() const;
	EAvaDynamicMeshConverterModifierFilter GetFilterActorMode() const;
	bool GetHideConvertedMesh() const;
	bool GetIncludeAttachedActors() const;
	class AActor* GetSourceActor() const;
	float GetUpdateInterval() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaDynamicMeshConverterModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaDynamicMeshConverterModifier")
	}
	static class UAvaDynamicMeshConverterModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaDynamicMeshConverterModifier>();
	}
};
DUMPER7_ASSERTS_UAvaDynamicMeshConverterModifier;

// Class AvalancheModifiers.AvaExtrudeModifier
// 0x0008 (0x0338 - 0x0330)
class UAvaExtrudeModifier final : public UAvaGeometryBaseModifier
{
public:
	float                                         Depth;                                             // 0x0330(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCloseBack;                                        // 0x0334(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMoveMeshOppositeDirection;                        // 0x0335(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAvaExtrudeMode                               ExtrudeMode;                                       // 0x0336(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_337[0x1];                                      // 0x0337(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCloseBack(bool bInCloseBack);
	void SetDepth(float InDepth);
	void SetExtrudeMode(EAvaExtrudeMode InExtrudeMode);

	bool GetCloseBack() const;
	float GetDepth() const;
	EAvaExtrudeMode GetExtrudeMode() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaExtrudeModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaExtrudeModifier")
	}
	static class UAvaExtrudeModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaExtrudeModifier>();
	}
};
DUMPER7_ASSERTS_UAvaExtrudeModifier;

// Class AvalancheModifiers.AvaMaterialParameterModifier
// 0x0150 (0x0310 - 0x01C0)
class UAvaMaterialParameterModifier : public UActorModifierArrangeBaseModifier
{
public:
	struct FAvaMaterialParameterMap               MaterialParameters;                                // 0x01C0(0x00F0)(Edit, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	TMap<TWeakObjectPtr<class UMaterialInstanceDynamic>, struct FAvaMaterialParameterMap> SavedMaterialParameters; // 0x02B0(0x0050)(Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UMaterialInstanceDynamic>   MaterialClass;                                     // 0x0300(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUpdateChildren;                                   // 0x0308(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetMaterialParameters(const struct FAvaMaterialParameterMap& InParameterMap);
	void SetUpdateChildren(bool bInUpdateChildren);

	const struct FAvaMaterialParameterMap GetMaterialParameters() const;
	bool GetUpdateChildren() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaMaterialParameterModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaMaterialParameterModifier")
	}
	static class UAvaMaterialParameterModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaMaterialParameterModifier>();
	}
};
DUMPER7_ASSERTS_UAvaMaterialParameterModifier;

// Class AvalancheModifiers.AvaGlobalOpacityModifier
// 0x0008 (0x0318 - 0x0310)
class UAvaGlobalOpacityModifier final : public UAvaMaterialParameterModifier
{
public:
	float                                         GlobalOpacity;                                     // 0x0310(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SupportedOpacityMaterialCount;                     // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetGlobalOpacity(float InOpacity);

	float GetGlobalOpacity() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaGlobalOpacityModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaGlobalOpacityModifier")
	}
	static class UAvaGlobalOpacityModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaGlobalOpacityModifier>();
	}
};
DUMPER7_ASSERTS_UAvaGlobalOpacityModifier;

// Class AvalancheModifiers.AvaHideEmptyModifier
// 0x0018 (0x01D8 - 0x01C0)
class UAvaHideEmptyModifier final : public UActorModifierArrangeBaseModifier
{
public:
	TWeakObjectPtr<class AActor>                  ContainerActorWeak;                                // 0x01C0(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInvertVisibility;                                 // 0x01C8(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UText3DComponent>        TextComponent;                                     // 0x01CC(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetContainerActor(class AActor* InActor);
	void SetInvertVisibility(bool bInInvert);

	class AActor* GetContainerActor() const;
	bool GetInvertVisibility() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaHideEmptyModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaHideEmptyModifier")
	}
	static class UAvaHideEmptyModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaHideEmptyModifier>();
	}
};
DUMPER7_ASSERTS_UAvaHideEmptyModifier;

// Class AvalancheModifiers.AvaMirrorModifier
// 0x0038 (0x0368 - 0x0330)
class UAvaMirrorModifier final : public UAvaGeometryBaseModifier
{
public:
	struct FVector                                MirrorFramePosition;                               // 0x0330(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               MirrorFrameRotation;                               // 0x0348(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bApplyPlaneCut;                                    // 0x0360(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFlipCutSide;                                      // 0x0361(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWeldAlongPlane;                                   // 0x0362(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_363[0x5];                                      // 0x0363(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetApplyPlaneCut(bool bInApplyPlaneCut);
	void SetFlipCutSide(bool bInFlipCutSide);
	void SetMirrorFramePosition(const struct FVector& InMirrorFramePosition);
	void SetMirrorFrameRotation(const struct FRotator& InMirrorFrameRotation);
	void SetWeldAlongPlane(bool bInWeldAlongPlane);

	bool GetApplyPlaneCut() const;
	bool GetFlipCutSide() const;
	const struct FVector GetMirrorFramePosition() const;
	const struct FRotator GetMirrorFrameRotation() const;
	bool GetWeldAlongPlane() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaMirrorModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaMirrorModifier")
	}
	static class UAvaMirrorModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaMirrorModifier>();
	}
};
DUMPER7_ASSERTS_UAvaMirrorModifier;

// Class AvalancheModifiers.AvaNormalModifier
// 0x0018 (0x0348 - 0x0330)
class UAvaNormalModifier final : public UAvaGeometryBaseModifier
{
public:
	bool                                          bAngleWeighted;                                    // 0x0330(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAreaWeighted;                                     // 0x0331(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInvert;                                           // 0x0332(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAvaNormalModifierSplitMethod                 SplitMethod;                                       // 0x0333(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AngleThreshold;                                    // 0x0334(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 PolyGroupLayer;                                    // 0x0338(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetAngleThreshold(float InAngleThreshold);
	void SetAngleWeighted(bool bInAngleWeighted);
	void SetAreaWeighted(bool bInAreaWeighted);
	void SetInvert(bool bInInvert);
	void SetPolyGroupLayerIdx(int32 InPolyGroupLayer);
	void SetSplitMethod(EAvaNormalModifierSplitMethod InSplitMethod);

	float GetAngleThreshold() const;
	bool GetAngleWeighted() const;
	bool GetAreaWeighted() const;
	bool GetInvert() const;
	int32 GetPolyGroupLayerIdx() const;
	TArray<class FString> GetPolyGroupLayers() const;
	EAvaNormalModifierSplitMethod GetSplitMethod() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaNormalModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaNormalModifier")
	}
	static class UAvaNormalModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaNormalModifier>();
	}
};
DUMPER7_ASSERTS_UAvaNormalModifier;

// Class AvalancheModifiers.AvaOutlineModifier
// 0x0010 (0x0340 - 0x0330)
class UAvaOutlineModifier final : public UAvaGeometryBaseModifier
{
public:
	EAvaOutlineMode                               Mode;                                              // 0x0330(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Distance;                                          // 0x0334(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRemoveInside;                                     // 0x0338(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetDistance(float InDistance);
	void SetMode(EAvaOutlineMode InMode);
	void SetRemoveInside(bool bInRemoveInside);

	float GetDistance() const;
	EAvaOutlineMode GetMode() const;
	bool GetRemoveInside() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaOutlineModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaOutlineModifier")
	}
	static class UAvaOutlineModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaOutlineModifier>();
	}
};
DUMPER7_ASSERTS_UAvaOutlineModifier;

// Class AvalancheModifiers.AvaPatternModifier
// 0x0140 (0x0470 - 0x0330)
class UAvaPatternModifier final : public UAvaGeometryBaseModifier
{
public:
	TSubclassOf<class UAvaPatternModifierTool>    ActiveToolClass;                                   // 0x0330(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, NoClear, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAvaPatternModifierTool*                ActiveTool;                                        // 0x0338(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, DuplicateTransient, NoDestructor, Protected, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<class UAvaPatternModifierTool*>        Tools;                                             // 0x0340(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	EAvaPatternModifierLayout                     Layout;                                            // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaPatternModifierLineLayoutOptions   LineLayoutOptions;                                 // 0x0358(0x0040)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FAvaPatternModifierGridLayoutOptions   GridLayoutOptions;                                 // 0x0398(0x0058)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FAvaPatternModifierCircleLayoutOptions CircleLayoutOptions;                               // 0x03F0(0x0048)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FBox                                   OriginalMeshBounds;                                // 0x0438(0x0038)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, TextExportTransient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetActiveToolClass(const TSubclassOf<class UAvaPatternModifierTool>& InClass);

	TSubclassOf<class UAvaPatternModifierTool> GetActiveToolClass() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPatternModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPatternModifier")
	}
	static class UAvaPatternModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPatternModifier>();
	}
};
DUMPER7_ASSERTS_UAvaPatternModifier;

// Class AvalancheModifiers.AvaPatternModifierTool
// 0x0000 (0x0028 - 0x0028)
class UAvaPatternModifierTool : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPatternModifierTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPatternModifierTool")
	}
	static class UAvaPatternModifierTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPatternModifierTool>();
	}
};
DUMPER7_ASSERTS_UAvaPatternModifierTool;

// Class AvalancheModifiers.AvaPatternModifierCircleTool
// 0x0048 (0x0070 - 0x0028)
class UAvaPatternModifierCircleTool final : public UAvaPatternModifierTool
{
public:
	EAvaPatternModifierPlane                      CirclePlane;                                       // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CircleRadius;                                      // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CircleStartAngle;                                  // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CircleFullAngle;                                   // 0x0034(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CircleCount;                                       // 0x0038(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCircleAccumulateTransform;                        // 0x003C(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CircleRotation;                                    // 0x0040(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                                CircleScale;                                       // 0x0058(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetCircleAccumulateTransform(bool bInCircleAccumulateTransform);
	void SetCircleCount(int32 InCircleCount);
	void SetCircleFullAngle(float InCircleFullAngle);
	void SetCirclePlane(EAvaPatternModifierPlane InCirclePlane);
	void SetCircleRadius(float InCircleRadius);
	void SetCircleRotation(const struct FRotator& InCircleRotation);
	void SetCircleScale(const struct FVector& InCircleScale);
	void SetCircleStartAngle(float InCircleStartAngle);

	bool GetCircleAccumulateTransform() const;
	int32 GetCircleCount() const;
	float GetCircleFullAngle() const;
	EAvaPatternModifierPlane GetCirclePlane() const;
	float GetCircleRadius() const;
	struct FRotator GetCircleRotation() const;
	struct FVector GetCircleScale() const;
	float GetCircleStartAngle() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPatternModifierCircleTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPatternModifierCircleTool")
	}
	static class UAvaPatternModifierCircleTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPatternModifierCircleTool>();
	}
};
DUMPER7_ASSERTS_UAvaPatternModifierCircleTool;

// Class AvalancheModifiers.AvaPatternModifierGridTool
// 0x0048 (0x0070 - 0x0028)
class UAvaPatternModifierGridTool final : public UAvaPatternModifierTool
{
public:
	EAvaPatternModifierPlane                      GridPlane;                                         // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAvaPatternModifierGridAlignment              GridAlignment;                                     // 0x0029(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GridCountX;                                        // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         GridCountY;                                        // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GridSpacingX;                                      // 0x0034(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GridSpacingY;                                      // 0x0038(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bGridAccumulateTransform;                          // 0x003C(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               GridRotation;                                      // 0x0040(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                                GridScale;                                         // 0x0058(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetGridAccumulateTransform(bool bInGridAccumulateTransform);
	void SetGridAlignment(EAvaPatternModifierGridAlignment InGridAlignment);
	void SetGridCountX(int32 InGridCountX);
	void SetGridCountY(int32 InGridCountY);
	void SetGridPlane(EAvaPatternModifierPlane InGridPlane);
	void SetGridRotation(const struct FRotator& InGridRotation);
	void SetGridScale(const struct FVector& InGridScale);
	void SetGridSpacingX(float InGridSpacingX);
	void SetGridSpacingY(float InGridSpacingY);

	bool GetGridAccumulateTransform() const;
	EAvaPatternModifierGridAlignment GetGridAlignment() const;
	int32 GetGridCountX() const;
	int32 GetGridCountY() const;
	EAvaPatternModifierPlane GetGridPlane() const;
	struct FRotator GetGridRotation() const;
	struct FVector GetGridScale() const;
	float GetGridSpacingX() const;
	float GetGridSpacingY() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPatternModifierGridTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPatternModifierGridTool")
	}
	static class UAvaPatternModifierGridTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPatternModifierGridTool>();
	}
};
DUMPER7_ASSERTS_UAvaPatternModifierGridTool;

// Class AvalancheModifiers.AvaPatternModifierLineTool
// 0x0040 (0x0068 - 0x0028)
class UAvaPatternModifierLineTool final : public UAvaPatternModifierTool
{
public:
	EAvaPatternModifierAxis                       LineAxis;                                          // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAvaPatternModifierLineAlignment              LineAlignment;                                     // 0x0029(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LineCount;                                         // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LineSpacing;                                       // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLineAccumulateTransform;                          // 0x0034(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               LineRotation;                                      // 0x0038(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                                LineScale;                                         // 0x0050(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetLineAccumulateTransform(bool bInLineAccumulateTransform);
	void SetLineAlignment(EAvaPatternModifierLineAlignment InLineAlignment);
	void SetLineAxis(EAvaPatternModifierAxis InLineAxis);
	void SetLineCount(int32 InLineCount);
	void SetLineRotation(const struct FRotator& InLineRotation);
	void SetLineScale(const struct FVector& InLineScale);
	void SetLineSpacing(float InLineSpacing);

	bool GetLineAccumulateTransform() const;
	EAvaPatternModifierLineAlignment GetLineAlignment() const;
	EAvaPatternModifierAxis GetLineAxis() const;
	int32 GetLineCount() const;
	struct FRotator GetLineRotation() const;
	struct FVector GetLineScale() const;
	float GetLineSpacing() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPatternModifierLineTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPatternModifierLineTool")
	}
	static class UAvaPatternModifierLineTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPatternModifierLineTool>();
	}
};
DUMPER7_ASSERTS_UAvaPatternModifierLineTool;

// Class AvalancheModifiers.AvaPlaneCutModifier
// 0x0028 (0x0358 - 0x0330)
class UAvaPlaneCutModifier final : public UAvaGeometryBaseModifier
{
public:
	float                                         PlaneOrigin;                                       // 0x0330(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               PlaneRotation;                                     // 0x0338(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bInvertCut;                                        // 0x0350(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFillHoles;                                        // 0x0351(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_352[0x6];                                      // 0x0352(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetFillHoles(bool bInFillHoles);
	void SetInvertCut(bool bInInvertCut);
	void SetPlaneOrigin(float InOrigin);
	void SetPlaneRotation(const struct FRotator& InRotation);

	bool GetFillHoles() const;
	bool GetInvertCut() const;
	float GetPlaneOrigin() const;
	const struct FRotator GetPlaneRotation() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlaneCutModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlaneCutModifier")
	}
	static class UAvaPlaneCutModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlaneCutModifier>();
	}
};
DUMPER7_ASSERTS_UAvaPlaneCutModifier;

// Class AvalancheModifiers.AvaSizeToTextureModifier
// 0x0058 (0x0388 - 0x0330)
class UAvaSizeToTextureModifier final : public UAvaGeometryBaseModifier
{
public:
	uint8                                         Pad_330[0x8];                                      // 0x0330(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Texture;                                           // 0x0338(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	EAvaSizeToTextureRule                         Rule;                                              // 0x0340(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FixedHeight;                                       // 0x0344(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FixedWidth;                                        // 0x0348(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              PreModifierShape2DSize;                            // 0x0350(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_360[0x20];                                     // 0x0360(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UAvaShape2DDynMeshBase>  Shape2DWeak;                                       // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetFixedHeight(float InFixedHeight);
	void SetFixedWidth(float InFixedWidth);
	void SetRule(EAvaSizeToTextureRule InRule);
	void SetTexture(class UTexture* InTexture);

	float GetFixedHeight() const;
	float GetFixedWidth() const;
	EAvaSizeToTextureRule GetRule() const;
	class UTexture* GetTexture() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaSizeToTextureModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaSizeToTextureModifier")
	}
	static class UAvaSizeToTextureModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaSizeToTextureModifier>();
	}
};
DUMPER7_ASSERTS_UAvaSizeToTextureModifier;

// Class AvalancheModifiers.AvaSplineSweepModifier
// 0x0050 (0x0380 - 0x0330)
class UAvaSplineSweepModifier final : public UAvaGeometryBaseModifier
{
public:
	uint8                                         Pad_330[0x8];                                      // 0x0330(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  SplineActorWeak;                                   // 0x0338(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAvaSplineSweepSampleMode                     SampleMode;                                        // 0x0340(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SampleDistance;                                    // 0x0344(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         Steps;                                             // 0x0348(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ProgressOffset;                                    // 0x034C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ProgressStart;                                     // 0x0350(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ProgressEnd;                                       // 0x0354(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ScaleStart;                                        // 0x0358(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ScaleEnd;                                          // 0x035C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCapped;                                           // 0x0360(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLooped;                                           // 0x0361(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_362[0x2];                                      // 0x0362(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class USplineComponent>        SplineComponentWeak;                               // 0x0364(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     SplineSamples;                                     // 0x0370(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	void SetCapped(bool bInCapped);
	void SetLooped(bool bInLooped);
	void SetProgressEnd(float InEnd);
	void SetProgressOffset(float InOffset);
	void SetProgressStart(float InStart);
	void SetSampleDistance(float InDistance);
	void SetSampleMode(EAvaSplineSweepSampleMode InMode);
	void SetScaleEnd(float InScaleEnd);
	void SetScaleStart(float InScaleStart);
	void SetSplineActor(class AActor* InActor);
	void SetSteps(int32 InSteps);

	bool GetCapped() const;
	bool GetLooped() const;
	float GetProgressEnd() const;
	float GetProgressOffset() const;
	float GetProgressStart() const;
	float GetSampleDistance() const;
	EAvaSplineSweepSampleMode GetSampleMode() const;
	float GetScaleEnd() const;
	float GetScaleStart() const;
	class AActor* GetSplineActor() const;
	int32 GetSteps() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaSplineSweepModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaSplineSweepModifier")
	}
	static class UAvaSplineSweepModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaSplineSweepModifier>();
	}
};
DUMPER7_ASSERTS_UAvaSplineSweepModifier;

// Class AvalancheModifiers.AvaSubdivideModifier
// 0x0008 (0x0338 - 0x0330)
class UAvaSubdivideModifier final : public UAvaGeometryBaseModifier
{
public:
	int32                                         Cuts;                                              // 0x0330(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRecomputeNormals;                                 // 0x0334(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAvaSubdivisionType                           Type;                                              // 0x0335(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_336[0x2];                                      // 0x0336(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCuts(int32 InCuts);
	void SetRecomputeNormals(bool bInRecomputeNormals);
	void SetType(EAvaSubdivisionType InType);

	int32 GetCuts() const;
	bool GetRecomputeNormals() const;
	EAvaSubdivisionType GetType() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaSubdivideModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaSubdivideModifier")
	}
	static class UAvaSubdivideModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaSubdivideModifier>();
	}
};
DUMPER7_ASSERTS_UAvaSubdivideModifier;

// Class AvalancheModifiers.AvaTaperModifier
// 0x0038 (0x0368 - 0x0330)
class UAvaTaperModifier final : public UAvaGeometryBaseModifier
{
public:
	float                                         Amount;                                            // 0x0330(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
