#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvalancheShapes

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "Engine_classes.hpp"
#include "MovieSceneTracks_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AvalancheShapes_structs.hpp"
#include "Avalanche_structs.hpp"


SDK_NAMESPACE_START

// Class AvalancheShapes.AvaShapeActor
// 0x0028 (0x02D0 - 0x02A8)
class AAvaShapeActor final : public AActor
{
public:
	uint8                                         Pad_2A8[0x10];                                     // 0x02A8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bFinishedCreation;                                 // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvaShapeDynamicMeshBase*               DynamicMesh;                                       // 0x02C0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UDynamicMeshComponent*                  ShapeMeshComponent;                                // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaShapeActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaShapeActor")
	}
	static class AAvaShapeActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAvaShapeActor>();
	}
};
DUMPER7_ASSERTS_AAvaShapeActor;

// Class AvalancheShapes.AvaShapeDynamicMeshBase
// 0x02D8 (0x0390 - 0x00B8)
class UAvaShapeDynamicMeshBase : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAllowEditSize;                                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESizeType                                     SizeType;                                          // 0x00C9(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UniformScaledSize;                                 // 0x00CC(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUsePrimaryMaterialEverywhere;                     // 0x00D0(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FAvaShapeMeshData>         MeshDatas;                                         // 0x00D8(0x0050)(Edit, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_128[0x248];                                    // 0x0128(0x0248)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MeshRegenWorldLocation;                            // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	EMaterialType GetMaterialType(int32 InMeshIndex);
	void SetMaterial(int32 InMeshIndex, class UMaterialInterface* InNewMaterial);
	void SetMaterialType(int32 InMeshIndex, EMaterialType InType);
	void SetMaterialUVParams(int32 InMeshIndex, const struct FAvaShapeMaterialUVParameters& InParams);
	void SetOverridePrimaryUVParams(int32 InMeshIndex, bool bInOverride);
	void SetParametricMaterial(int32 InMeshIndex, const struct FAvaShapeParametricMaterial& InNewMaterialParams);
	void SetSize2D(const struct FVector2D& InSize2D);
	void SetSize3D(const struct FVector& InSize);
	void SetUniformScaledSize(float InSize);
	void SetUsePrimaryMaterialEverywhere(bool bInUse);

	bool GetAllowEditSize() const;
	class UMaterialInterface* GetMaterial(int32 InMeshIndex) const;
	const struct FAvaShapeMaterialUVParameters GetMaterialUVParams(int32 InMeshIndex) const;
	TArray<class FName> GetMeshSectionNames() const;
	bool GetOverridePrimaryUVParams(int32 InMeshIndex) const;
	const struct FAvaShapeParametricMaterial GetParametricMaterial(int32 InMeshIndex) const;
	struct FVector2D GetSize2D() const;
	struct FVector GetSize3D() const;
	float GetUniformScaledSize() const;
	bool GetUsePrimaryMaterialEverywhere() const;
	bool IsMeshSectionVisible(int32 InIndex) const;
	bool IsValidMeshIndex(int32 InMeshIndex) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaShapeDynamicMeshBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaShapeDynamicMeshBase")
	}
	static class UAvaShapeDynamicMeshBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaShapeDynamicMeshBase>();
	}
};
DUMPER7_ASSERTS_UAvaShapeDynamicMeshBase;

// Class AvalancheShapes.AvaShape2DDynMeshBase
// 0x0050 (0x03E0 - 0x0390)
class UAvaShape2DDynMeshBase : public UAvaShapeDynamicMeshBase
{
public:
	bool                                          bDoNotRecenterVertices;                            // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              PixelSize2D;                                       // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              Size2D;                                            // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              PreEditSize2D;                                     // 0x03B8(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                Size3D;                                            // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaShape2DDynMeshBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaShape2DDynMeshBase")
	}
	static class UAvaShape2DDynMeshBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaShape2DDynMeshBase>();
	}
};
DUMPER7_ASSERTS_UAvaShape2DDynMeshBase;

// Class AvalancheShapes.AvaShape2DArrowDynamicMesh
// 0x0018 (0x03F8 - 0x03E0)
class UAvaShape2DArrowDynamicMesh final : public UAvaShape2DDynMeshBase
{
public:
	float                                         RatioArrowLine;                                    // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RatioLineHeight;                                   // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RatioArrowY;                                       // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RatioLineY;                                        // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBothSideArrows;                                   // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaShape2DArrowDynamicMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaShape2DArrowDynamicMesh")
	}
	static class UAvaShape2DArrowDynamicMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaShape2DArrowDynamicMesh>();
	}
};
DUMPER7_ASSERTS_UAvaShape2DArrowDynamicMesh;

// Class AvalancheShapes.AvaShape3DDynMeshBase
// 0x0048 (0x03D8 - 0x0390)
class UAvaShape3DDynMeshBase : public UAvaShapeDynamicMeshBase
{
public:
	struct FVector                                PixelSize3D;                                       // 0x0390(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                Size3D;                                            // 0x03A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                PreEditSize3D;                                     // 0x03C0(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaShape3DDynMeshBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaShape3DDynMeshBase")
	}
	static class UAvaShape3DDynMeshBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaShape3DDynMeshBase>();
	}
};
DUMPER7_ASSERTS_UAvaShape3DDynMeshBase;

// Class AvalancheShapes.AvaShapeChevronDynamicMesh
// 0x0008 (0x03E8 - 0x03E0)
class UAvaShapeChevronDynamicMesh final : public UAvaShape2DDynMeshBase
{
public:
	float                                         RatioChevron;                                      // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaShapeChevronDynamicMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaShapeChevronDynamicMesh")
	}
	static class UAvaShapeChevronDynamicMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaShapeChevronDynamicMesh>();
	}
};
DUMPER7_ASSERTS_UAvaShapeChevronDynamicMesh;

// Class AvalancheShapes.AvaShapeConeDynamicMesh
// 0x0018 (0x03F0 - 0x03D8)
class UAvaShapeConeDynamicMesh final : public UAvaShape3DDynMeshBase
{
public:
	uint8                                         NumSides;                                          // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D9[0x3];                                      // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TopRadius;                                         // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AngleDegree;                                       // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         StartDegree;                                       // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Height;                                            // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         BaseRadius;                                        // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaShapeConeDynamicMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaShapeConeDynamicMesh")
	}
	static class UAvaShapeConeDynamicMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaShapeConeDynamicMesh>();
	}
};
DUMPER7_ASSERTS_UAvaShapeConeDynamicMesh;

// Class AvalancheShapes.AvaShapeCubeDynamicMesh
// 0x0010 (0x03E8 - 0x03D8)
class UAvaShapeCubeDynamicMesh final : public UAvaShape3DDynMeshBase
{
public:
	float                                         BevelSizeRatio;                                    // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         BevelNum;                                          // 0x03DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3DD[0x3];                                      // 0x03DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Segment;                                           // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaShapeCubeDynamicMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaShapeCubeDynamicMesh")
	}
	static class UAvaShapeCubeDynamicMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaShapeCubeDynamicMesh>();
	}
};
DUMPER7_ASSERTS_UAvaShapeCubeDynamicMesh;

// Class AvalancheShapes.AvaShapeEllipseDynamicMesh
// 0x0010 (0x03F0 - 0x03E0)
class UAvaShapeEllipseDynamicMesh final : public UAvaShape2DDynMeshBase
{
public:
	uint8                                         NumSides;                                          // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AngleDegree;                                       // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         StartDegree;                                       // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaShapeEllipseDynamicMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaShapeEllipseDynamicMesh")
	}
	static class UAvaShapeEllipseDynamicMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaShapeEllipseDynamicMesh>();
	}
};
DUMPER7_ASSERTS_UAvaShapeEllipseDynamicMesh;

// Class AvalancheShapes.AvaShapeIrregularPolygonDynamicMesh
// 0x0028 (0x0408 - 0x03E0)
class UAvaShapeIrregularPolygonDynamicMesh final : public UAvaShape2DDynMeshBase
{
public:
	float                                         GlobalBevelSize;                                   // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         GlobalBevelSubdivisions;                           // 0x03E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E5[0x3];                                      // 0x03E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAvaShapeRoundedCorner>         Points;                                            // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F8[0x10];                                     // 0x03F8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaShapeIrregularPolygonDynamicMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaShapeIrregularPolygonDynamicMesh")
	}
	static class UAvaShapeIrregularPolygonDynamicMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaShapeIrregularPolygonDynamicMesh>();
	}
};
DUMPER7_ASSERTS_UAvaShapeIrregularPolygonDynamicMesh;

// Class AvalancheShapes.AvaShapeRoundedPolygonDynamicMesh
// 0x0008 (0x03E8 - 0x03E0)
class UAvaShapeRoundedPolygonDynamicMesh : public UAvaShape2DDynMeshBase
{
public:
	float                                         BevelSize;                                         // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         BevelSubdivisions;                                 // 0x03E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E5[0x3];                                      // 0x03E5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaShapeRoundedPolygonDynamicMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaShapeRoundedPolygonDynamicMesh")
	}
	static class UAvaShapeRoundedPolygonDynamicMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaShapeRoundedPolygonDynamicMesh>();
	}
};
DUMPER7_ASSERTS_UAvaShapeRoundedPolygonDynamicMesh;

// Class AvalancheShapes.AvaShapeLineDynamicMesh
// 0x0018 (0x0400 - 0x03E8)
class UAvaShapeLineDynamicMesh final : public UAvaShapeRoundedPolygonDynamicMesh
{
public:
	float                                         LineWidth;                                         // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Vector;                                            // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaShapeLineDynamicMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaShapeLineDynamicMesh")
	}
	static class UAvaShapeLineDynamicMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaShapeLineDynamicMesh>();
	}
};
DUMPER7_ASSERTS_UAvaShapeLineDynamicMesh;

// Class AvalancheShapes.AvaShapeNGonDynamicMesh
// 0x0008 (0x03F0 - 0x03E8)
class UAvaShapeNGonDynamicMesh final : public UAvaShapeRoundedPolygonDynamicMesh
{
public:
	uint8                                         NumSides;                                          // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaShapeNGonDynamicMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaShapeNGonDynamicMesh")
	}
	static class UAvaShapeNGonDynamicMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaShapeNGonDynamicMesh>();
	}
};
DUMPER7_ASSERTS_UAvaShapeNGonDynamicMesh;

// Class AvalancheShapes.AvaShapeMeshFunctions
// 0x0000 (0x0028 - 0x0028)
class UAvaShapeMeshFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UAvaShapeRectangleDynamicMesh* SetRectangle(class AAvaShapeActor* ShapeActor, const struct FVector2D& Size, const struct FTransform& Transform);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaShapeMeshFunctions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaShapeMeshFunctions")
	}
	static class UAvaShapeMeshFunctions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaShapeMeshFunctions>();
	}
};
DUMPER7_ASSERTS_UAvaShapeMeshFunctions;

// Class AvalancheShapes.AvaShapeRectangleDynamicMesh
// 0x0098 (0x0478 - 0x03E0)
class UAvaShapeRectangleDynamicMesh final : public UAvaShape2DDynMeshBase
{
public:
	EAvaHorizontalAlignment                       HorizontalAlignment;                               // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAvaVerticalAlignment                         VerticalAlignment;                                 // 0x03E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E2[0x2];                                      // 0x03E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LeftSlant;                                         // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RightSlant;                                        // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GlobalBevelSize;                                   // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         GlobalBevelSubdivisions;                           // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaShapeRectangleCornerSettings       TopLeft;                                           // 0x03F8(0x0020)(Edit, BlueprintVisible, DisableEditOnTemplate, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FAvaShapeRectangleCornerSettings       TopRight;                                          // 0x0418(0x0020)(Edit, BlueprintVisible, DisableEditOnTemplate, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FAvaShapeRectangleCornerSettings       BottomLeft;                                        // 0x0438(0x0020)(Edit, BlueprintVisible, DisableEditOnTemplate, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FAvaShapeRectangleCornerSettings       BottomRight;                                       // 0x0458(0x0020)(Edit, BlueprintVisible, DisableEditOnTemplate, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaShapeRectangleDynamicMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaShapeRectangleDynamicMesh")
	}
	static class UAvaShapeRectangleDynamicMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaShapeRectangleDynamicMesh>();
	}
};
DUMPER7_ASSERTS_UAvaShapeRectangleDynamicMesh;

// Class AvalancheShapes.AvaShapeRingDynamicMesh
// 0x0010 (0x03F0 - 0x03E0)
class UAvaShapeRingDynamicMesh final : public UAvaShape2DDynMeshBase
{
public:
	uint8                                         NumSides;                                          // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InnerSize;                                         // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AngleDegree;                                       // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         StartDegree;                                       // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaShapeRingDynamicMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaShapeRingDynamicMesh")
	}
	static class UAvaShapeRingDynamicMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaShapeRingDynamicMesh>();
	}
};
DUMPER7_ASSERTS_UAvaShapeRingDynamicMesh;

// Class AvalancheShapes.AvaShapeSphereDynamicMesh
// 0x0020 (0x03F8 - 0x03D8)
class UAvaShapeSphereDynamicMesh final : public UAvaShape3DDynMeshBase
{
public:
	float                                         StartLongitude;                                    // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EndLongitude;                                      // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartLatitude;                                     // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LatitudeDegree;                                    // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         NumSides;                                          // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F1[0x3];                                      // 0x03F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Radius;                                            // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaShapeSphereDynamicMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaShapeSphereDynamicMesh")
	}
	static class UAvaShapeSphereDynamicMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaShapeSphereDynamicMesh>();
	}
};
DUMPER7_ASSERTS_UAvaShapeSphereDynamicMesh;

// Class AvalancheShapes.AvaShapeStarDynamicMesh
// 0x0008 (0x03F0 - 0x03E8)
class UAvaShapeStarDynamicMesh final : public UAvaShapeRoundedPolygonDynamicMesh
{
public:
	uint8                                         NumPoints;                                         // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InnerSize;                                         // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaShapeStarDynamicMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaShapeStarDynamicMesh")
	}
	static class UAvaShapeStarDynamicMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaShapeStarDynamicMesh>();
	}
};
DUMPER7_ASSERTS_UAvaShapeStarDynamicMesh;

// Class AvalancheShapes.AvaShapeTorusDynamicMesh
// 0x0010 (0x03E8 - 0x03D8)
class UAvaShapeTorusDynamicMesh final : public UAvaShape3DDynMeshBase
{
public:
	uint8                                         NumSlices;                                         // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         NumSides;                                          // 0x03D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3DA[0x2];                                      // 0x03DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InnerSize;                                         // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AngleDegree;                                       // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         StartDegree;                                       // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaShapeTorusDynamicMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaShapeTorusDynamicMesh")
	}
	static class UAvaShapeTorusDynamicMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaShapeTorusDynamicMesh>();
	}
};
DUMPER7_ASSERTS_UAvaShapeTorusDynamicMesh;

// Class AvalancheShapes.MovieSceneAvaShapeRectCornerSection
// 0x0330 (0x0438 - 0x0108)
class UMovieSceneAvaShapeRectCornerSection final : public UMovieSceneSection
{
public:
	struct FMovieSceneByteChannel                 Type;                                              // 0x0108(0x0110)(NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                BevelSize;                                         // 0x0218(0x0110)(NativeAccessSpecifierPublic)
	struct FMovieSceneByteChannel                 BevelSubdivisions;                                 // 0x0328(0x0110)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneAvaShapeRectCornerSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneAvaShapeRectCornerSection")
	}
	static class UMovieSceneAvaShapeRectCornerSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneAvaShapeRectCornerSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneAvaShapeRectCornerSection;

// Class AvalancheShapes.MovieSceneAvaShapeRectCornerTrack
// 0x0008 (0x0148 - 0x0140)
class UMovieSceneAvaShapeRectCornerTrack final : public UMovieScenePropertyTrack
{
public:
	uint8                                         Pad_140[0x8];                                      // 0x0140(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneAvaShapeRectCornerTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneAvaShapeRectCornerTrack")
	}
	static class UMovieSceneAvaShapeRectCornerTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneAvaShapeRectCornerTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneAvaShapeRectCornerTrack;

SDK_NAMESPACE_END
