#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Avalanche

#include "Basic.hpp"

#include "AvalancheRemoteControl_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AvalancheTag_structs.hpp"
#include "AvalancheTransition_structs.hpp"


SDK_NAMESPACE_START

// Enum Avalanche.EAvaAnchors
// NumValues: 0x000C
enum class EAvaAnchors : uint8
{
	None                                     = 0,
	TopLeft                                  = 9,
	Top                                      = 10,
	TopRight                                 = 12,
	Left                                     = 17,
	Center                                   = 18,
	Right                                    = 20,
	BottomLeft                               = 33,
	Bottom                                   = 34,
	BottomRight                              = 36,
	Custom                                   = 64,
	EAvaAnchors_MAX                          = 65,
};

// Enum Avalanche.EAvaVerticalAlignment
// NumValues: 0x0004
enum class EAvaVerticalAlignment : uint8
{
	Top                                      = 0,
	Center                                   = 1,
	Bottom                                   = 2,
	EAvaVerticalAlignment_MAX                = 3,
};

// Enum Avalanche.EAvaHorizontalAlignment
// NumValues: 0x0004
enum class EAvaHorizontalAlignment : uint8
{
	Left                                     = 0,
	Center                                   = 1,
	Right                                    = 2,
	EAvaHorizontalAlignment_MAX              = 3,
};

// Enum Avalanche.EAvaDepthAlignment
// NumValues: 0x0004
enum class EAvaDepthAlignment : uint8
{
	Front                                    = 0,
	Center                                   = 1,
	Back                                     = 2,
	EAvaDepthAlignment_MAX                   = 3,
};

// Enum Avalanche.EAvaColorStyle
// NumValues: 0x0004
enum class EAvaColorStyle : uint8
{
	None                                     = 0,
	Solid                                    = 1,
	LinearGradient                           = 2,
	EAvaColorStyle_MAX                       = 3,
};

// Enum Avalanche.EAvaViewportPostProcessType_Deprecated
// NumValues: 0x0007
enum class EAvaViewportPostProcessType_Deprecated : uint8
{
	None                                     = 0,
	Background                               = 1,
	RedChannel                               = 2,
	GreenChannel                             = 3,
	BlueChannel                              = 4,
	AlphaChannel                             = 5,
	EAvaViewportPostProcessType_MAX          = 6,
};

// ScriptStruct Avalanche.AvaColorChangeData
// 0x0028 (0x0028 - 0x0000)
struct FAvaColorChangeData final
{
public:
	EAvaColorStyle                                ColorStyle;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           PrimaryColor;                                      // 0x0004(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SecondaryColor;                                    // 0x0014(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUnlit;                                          // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaColorChangeData;

// ScriptStruct Avalanche.AvaGizmoComponentPrimitiveValues
// 0x0030 (0x0030 - 0x0000)
struct FAvaGizmoComponentPrimitiveValues final
{
public:
	bool                                          bCastShadow;                                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsVisible;                                        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsHiddenInGame;                                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisibleInReflectionCaptures;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisibleInRealTimeSkyCaptures;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisibleInRayTracing;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectDistanceFieldLighting;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectDynamicIndirectLighting;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectIndirectLightingWhileHidden;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawWireframe;                                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           WireframeColor;                                    // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRendersCustomDepth;                               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CustomStencilId;                                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRendersInMainPass;                                // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRendersDepth;                                     // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             Materials;                                         // 0x0020(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FAvaGizmoComponentPrimitiveValues;

// ScriptStruct Avalanche.AvaInstanceSettings
// 0x0002 (0x0002 - 0x0000)
struct FAvaInstanceSettings final
{
public:
	bool                                          bEnableLoadSubPlayables;                           // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDefaultPlayableTransitionWaitForSequences;        // 0x0001(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaInstanceSettings;

// ScriptStruct Avalanche.AvaSceneTask
// 0x0020 (0x0058 - 0x0038)
struct FAvaSceneTask : public FAvaTransitionTask
{
public:
	struct FAvaTagHandle                          TagAttribute;                                      // 0x0038(0x0018)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaSceneTask;

// ScriptStruct Avalanche.AvaSceneAddTagAttributeTask
// 0x0000 (0x0058 - 0x0058)
struct FAvaSceneAddTagAttributeTask final : public FAvaSceneTask
{
};
DUMPER7_ASSERTS_FAvaSceneAddTagAttributeTask;

// ScriptStruct Avalanche.AvaSceneContainsTagAttributeConditionInstanceData
// 0x0038 (0x0038 - 0x0000)
struct FAvaSceneContainsTagAttributeConditionInstanceData final
{
public:
	EAvaTransitionSceneType                       SceneType;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAvaTransitionLayerCompareType                LayerType;                                         // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaTagHandleContainer                 SpecificLayers;                                    // 0x0008(0x0018)(Edit, NativeAccessSpecifierPublic)
	struct FAvaTagHandle                          TagAttribute;                                      // 0x0020(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaSceneContainsTagAttributeConditionInstanceData;

// ScriptStruct Avalanche.AvaSceneContainsTagAttributeConditionBase
// 0x0040 (0x0078 - 0x0038)
struct FAvaSceneContainsTagAttributeConditionBase : public FAvaTransitionCondition
{
public:
	EAvaTransitionSceneType                       SceneType;                                         // 0x0038(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAvaTransitionLayerCompareType                LayerType;                                         // 0x0039(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaTagHandleContainer                 SpecificLayers;                                    // 0x0040(0x0018)(Deprecated, NativeAccessSpecifierPublic)
	struct FAvaTagHandle                          TagAttribute;                                      // 0x0058(0x0018)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaSceneContainsTagAttributeConditionBase;

// ScriptStruct Avalanche.AvaSceneContainsTagAttributeCondition
// 0x0000 (0x0078 - 0x0078)
struct FAvaSceneContainsTagAttributeCondition final : public FAvaSceneContainsTagAttributeConditionBase
{
};
DUMPER7_ASSERTS_FAvaSceneContainsTagAttributeCondition;

// ScriptStruct Avalanche.AvaNoSceneContainsTagAttributeCondition
// 0x0000 (0x0078 - 0x0078)
struct FAvaNoSceneContainsTagAttributeCondition final : public FAvaSceneContainsTagAttributeConditionBase
{
};
DUMPER7_ASSERTS_FAvaNoSceneContainsTagAttributeCondition;

// ScriptStruct Avalanche.AvaSceneRemoveTagAttributeTask
// 0x0000 (0x0058 - 0x0058)
struct FAvaSceneRemoveTagAttributeTask final : public FAvaSceneTask
{
};
DUMPER7_ASSERTS_FAvaSceneRemoveTagAttributeTask;

// ScriptStruct Avalanche.AvaSceneTaskInstanceData
// 0x0018 (0x0018 - 0x0000)
struct FAvaSceneTaskInstanceData final
{
public:
	struct FAvaTagHandle                          TagAttribute;                                      // 0x0000(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaSceneTaskInstanceData;

// ScriptStruct Avalanche.AvaTransitionRCControllerMatchConditionInstanceData
// 0x000C (0x000C - 0x0000)
struct FAvaTransitionRCControllerMatchConditionInstanceData final
{
public:
	struct FAvaRCControllerId                     ControllerId;                                      // 0x0000(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EAvaTransitionComparisonResult                ValueComparisonType;                               // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionRCControllerMatchConditionInstanceData;

// ScriptStruct Avalanche.AvaTransitionRCControllerMatchCondition
// 0x0010 (0x0048 - 0x0038)
struct FAvaTransitionRCControllerMatchCondition final : public FAvaTransitionCondition
{
public:
	struct FAvaRCControllerId                     ControllerId;                                      // 0x0038(0x0008)(Deprecated, NoDestructor, NativeAccessSpecifierPublic)
	EAvaTransitionComparisonResult                ValueComparisonType;                               // 0x0040(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionRCControllerMatchCondition;

// ScriptStruct Avalanche.AvaViewportPostProcessInfo_Deprecated
// 0x0038 (0x0038 - 0x0000)
struct FAvaViewportPostProcessInfo_Deprecated final
{
public:
	EAvaViewportPostProcessType_Deprecated        Type;                                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture>                Texture;                                           // 0x0008(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Opacity;                                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaViewportPostProcessInfo_Deprecated;

// ScriptStruct Avalanche.AvaViewportQualitySettingsFeature
// 0x0018 (0x0018 - 0x0000)
struct FAvaViewportQualitySettingsFeature final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaViewportQualitySettingsFeature;

// ScriptStruct Avalanche.AvaViewportQualitySettings
// 0x0010 (0x0010 - 0x0000)
struct FAvaViewportQualitySettings final
{
public:
	TArray<struct FAvaViewportQualitySettingsFeature> Features;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaViewportQualitySettings;

// ScriptStruct Avalanche.AvaViewportQualitySettingsPreset
// 0x0020 (0x0020 - 0x0000)
struct FAvaViewportQualitySettingsPreset final
{
public:
	class FText                                   PresetName;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FAvaViewportQualitySettings            QualitySettings;                                   // 0x0010(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaViewportQualitySettingsPreset;

SDK_NAMESPACE_END
