#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvalancheSceneTree

#include "Basic.hpp"


SDK_NAMESPACE_START

// Enum AvalancheSceneTree.EAvaSceneItemIdType
// NumValues: 0x0003
enum class EAvaSceneItemIdType : uint8
{
	ObjectPath                               = 0,
	Other                                    = 1,
	EAvaSceneItemIdType_MAX                  = 2,
};

// ScriptStruct AvalancheSceneTree.AvaSceneItem
// 0x0018 (0x0018 - 0x0000)
struct FAvaSceneItem final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EAvaSceneItemIdType                           IdType;                                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaSceneItem;

// ScriptStruct AvalancheSceneTree.AvaSceneTreeNode
// 0x0028 (0x0028 - 0x0000)
struct FAvaSceneTreeNode final
{
public:
	int32                                         LocalIndex;                                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         GlobalIndex;                                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ParentIndex;                                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ChildrenIndices;                                   // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_20[0x8];                                       // 0x0020(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaSceneTreeNode;

// ScriptStruct AvalancheSceneTree.AvaSceneTree
// 0x0088 (0x0088 - 0x0000)
struct FAvaSceneTree final
{
public:
	struct FAvaSceneTreeNode                      RootNode;                                          // 0x0000(0x0028)(NativeAccessSpecifierPrivate)
	TArray<struct FAvaSceneItem>                  SceneItems;                                        // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<struct FAvaSceneItem, struct FAvaSceneTreeNode> ItemTreeMap;                                // 0x0038(0x0050)(NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FAvaSceneTree;

SDK_NAMESPACE_END
