#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvalancheCamera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AvalancheTransition_structs.hpp"


SDK_NAMESPACE_START

// ScriptStruct AvalancheCamera.AvaCameraBlendInstanceData
// 0x0014 (0x0014 - 0x0000)
struct FAvaCameraBlendInstanceData final
{
public:
	bool                                          bOverrideTransitionParams;                         // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParams            TransitionParams;                                  // 0x0004(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaCameraBlendInstanceData;

// ScriptStruct AvalancheCamera.AvaCameraBlendTask
// 0x0008 (0x0040 - 0x0038)
struct FAvaCameraBlendTask final : public FAvaTransitionTask
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaCameraBlendTask;

// ScriptStruct AvalancheCamera.AvaViewTarget
// 0x0010 (0x0010 - 0x0000)
struct FAvaViewTarget final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAvaCameraPriorityModifier*             CameraPriorityModifier;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FAvaViewTarget;

SDK_NAMESPACE_END
