#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvalancheTransition

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "StateTreeModule_structs.hpp"
#include "StateTreeModule_classes.hpp"
#include "AvalancheTransition_structs.hpp"
#include "AvalancheTag_structs.hpp"
#include "CoreUObject_classes.hpp"


SDK_NAMESPACE_START

// Class AvalancheTransition.AvaTransitionBehaviorActor
// 0x0038 (0x02E0 - 0x02A8)
class AAvaTransitionBehaviorActor final : public AActor
{
public:
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvaTransitionTree*                     TransitionTree;                                    // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	struct FStateTreeReference                    StateTreeReference;                                // 0x02B8(0x0028)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaTransitionBehaviorActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaTransitionBehaviorActor")
	}
	static class AAvaTransitionBehaviorActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAvaTransitionBehaviorActor>();
	}
};
DUMPER7_ASSERTS_AAvaTransitionBehaviorActor;

// Class AvalancheTransition.AvaTransitionConditionBlueprint
// 0x0028 (0x0088 - 0x0060)
class UAvaTransitionConditionBlueprint final : public UStateTreeConditionBlueprintBase
{
public:
	uint8                                         Pad_60[0x28];                                      // 0x0060(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaTransitionConditionBlueprint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaTransitionConditionBlueprint")
	}
	static class UAvaTransitionConditionBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaTransitionConditionBlueprint>();
	}
};
DUMPER7_ASSERTS_UAvaTransitionConditionBlueprint;

// Class AvalancheTransition.AvaTransitionLibrary
// 0x0000 (0x0028 - 0x0028)
class UAvaTransitionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool AreScenesTransitioning(class UObject* InTransitionNode, const struct FAvaTagHandleContainer& InLayers, const TArray<TSoftObjectPtr<class UWorld>>& InScenesToIgnore);
	static const class UAvaTransitionTree* GetTransitionTree(class UObject* InTransitionNode);
	static EAvaTransitionType GetTransitionType(class UObject* InTransitionNode);
	static bool IsTransitionActiveInLayer(class UObject* InTransitionNode, EAvaTransitionComparisonResult InSceneComparisonType, EAvaTransitionLayerCompareType InLayerComparisonType, const struct FAvaTagHandleContainer& InSpecificLayers);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaTransitionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaTransitionLibrary")
	}
	static class UAvaTransitionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaTransitionLibrary>();
	}
};
DUMPER7_ASSERTS_UAvaTransitionLibrary;

// Class AvalancheTransition.AvaTransitionPreviewManager
// 0x0080 (0x0328 - 0x02A8)
class AAvaTransitionPreviewManager final : public AActor
{
public:
	TArray<struct FAvaTransitionPreviewLevelState> LevelStates;                                      // 0x02A8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	bool                                          bTransitionInProgress;                             // 0x02B8(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bReuseLevel;                                       // 0x02B9(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2BA[0x6];                                      // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UWorld>                  NextLevelAsset;                                    // 0x02C0(0x0028)(Edit, Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAvaTransitionPreviewLevelState        NextLevelState;                                    // 0x02E8(0x0030)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_318[0x10];                                     // 0x0318(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void TakeNext();
	void TakeOut();
	void TransitionStop();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaTransitionPreviewManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaTransitionPreviewManager")
	}
	static class AAvaTransitionPreviewManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAvaTransitionPreviewManager>();
	}
};
DUMPER7_ASSERTS_AAvaTransitionPreviewManager;

// Class AvalancheTransition.AvaTransitionRenderingSubsystem
// 0x00B0 (0x00E0 - 0x0030)
class UAvaTransitionRenderingSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0xB0];                                      // 0x0030(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaTransitionRenderingSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaTransitionRenderingSubsystem")
	}
	static class UAvaTransitionRenderingSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaTransitionRenderingSubsystem>();
	}
};
DUMPER7_ASSERTS_UAvaTransitionRenderingSubsystem;

// Class AvalancheTransition.AvaTransitionSubsystem
// 0x0060 (0x0090 - 0x0030)
class UAvaTransitionSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x60];                                      // 0x0030(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaTransitionSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaTransitionSubsystem")
	}
	static class UAvaTransitionSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaTransitionSubsystem>();
	}
};
DUMPER7_ASSERTS_UAvaTransitionSubsystem;

// Class AvalancheTransition.AvaTransitionTaskBlueprint
// 0x0028 (0x0088 - 0x0060)
class UAvaTransitionTaskBlueprint final : public UStateTreeTaskBlueprintBase
{
public:
	uint8                                         Pad_60[0x28];                                      // 0x0060(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaTransitionTaskBlueprint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaTransitionTaskBlueprint")
	}
	static class UAvaTransitionTaskBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaTransitionTaskBlueprint>();
	}
};
DUMPER7_ASSERTS_UAvaTransitionTaskBlueprint;

// Class AvalancheTransition.AvaTransitionTree
// 0x0020 (0x0260 - 0x0240)
class UAvaTransitionTree final : public UStateTree
{
public:
	struct FAvaTagHandle                          TransitionLayer;                                   // 0x0238(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnabled;                                          // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EAvaTransitionInstancingMode                  InstancingMode;                                    // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_252[0xE];                                      // 0x0252(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	EAvaTransitionInstancingMode GetInstancingMode() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaTransitionTree")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaTransitionTree")
	}
	static class UAvaTransitionTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaTransitionTree>();
	}
};
DUMPER7_ASSERTS_UAvaTransitionTree;

// Class AvalancheTransition.AvaTransitionTreeSchema
// 0x0000 (0x0028 - 0x0028)
class UAvaTransitionTreeSchema final : public UStateTreeSchema
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaTransitionTreeSchema")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaTransitionTreeSchema")
	}
	static class UAvaTransitionTreeSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaTransitionTreeSchema>();
	}
};
DUMPER7_ASSERTS_UAvaTransitionTreeSchema;

// Class AvalancheTransition.AvaTransitionBehavior
// 0x0000 (0x0000 - 0x0000)
class IAvaTransitionBehavior final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaTransitionBehavior")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaTransitionBehavior")
	}
	static class IAvaTransitionBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAvaTransitionBehavior>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAvaTransitionBehavior;

// Class AvalancheTransition.AvaTransitionNodeInterface
// 0x0000 (0x0000 - 0x0000)
class IAvaTransitionNodeInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaTransitionNodeInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaTransitionNodeInterface")
	}
	static class IAvaTransitionNodeInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAvaTransitionNodeInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAvaTransitionNodeInterface;

SDK_NAMESPACE_END
