#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvalancheCamera

#include "Basic.hpp"

#include "AvalancheCamera_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ActorModifierCore_classes.hpp"


SDK_NAMESPACE_START

// Class AvalancheCamera.AvaCameraPriorityModifier
// 0x0018 (0x00D8 - 0x00C0)
class UAvaCameraPriorityModifier final : public UActorModifierCoreBase
{
public:
	int32                                         Priority;                                          // 0x00C0(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FViewTargetTransitionParams            TransitionParams;                                  // 0x00C4(0x0010)(Edit, DisableEditOnTemplate, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaCameraPriorityModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaCameraPriorityModifier")
	}
	static class UAvaCameraPriorityModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaCameraPriorityModifier>();
	}
};
DUMPER7_ASSERTS_UAvaCameraPriorityModifier;

// Class AvalancheCamera.AvaCameraSubsystem
// 0x0018 (0x0048 - 0x0030)
class UAvaCameraSubsystem final : public UWorldSubsystem
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<struct FAvaViewTarget>                 ViewTargets;                                       // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaCameraSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaCameraSubsystem")
	}
	static class UAvaCameraSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaCameraSubsystem>();
	}
};
DUMPER7_ASSERTS_UAvaCameraSubsystem;

// Class AvalancheCamera.AvaTransitionCameraLibrary
// 0x0000 (0x0028 - 0x0028)
class UAvaTransitionCameraLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool ConditionallyUpdateViewTarget(class UObject* InTransitionNode);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaTransitionCameraLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaTransitionCameraLibrary")
	}
	static class UAvaTransitionCameraLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaTransitionCameraLibrary>();
	}
};
DUMPER7_ASSERTS_UAvaTransitionCameraLibrary;

SDK_NAMESPACE_END
