#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvalancheTag

#include "Basic.hpp"

#include "AvalancheTag_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function AvalancheTag.AvaTagLibrary.ResolveTagHandle
// 0x0028 (0x0028 - 0x0000)
struct AvaTagLibrary_ResolveTagHandle final
{
public:
	struct FAvaTagHandle                          InTagHandle;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAvaTag>                        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaTagLibrary_ResolveTagHandle;

// Function AvalancheTag.AvaTagLibrary.ResolveTagHandles
// 0x0028 (0x0028 - 0x0000)
struct AvaTagLibrary_ResolveTagHandles final
{
public:
	struct FAvaTagHandleContainer                 InTagHandleContainer;                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FAvaTag>                        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaTagLibrary_ResolveTagHandles;

// Function AvalancheTag.AvaTagLibrary.ResolveTagSoftHandle
// 0x0050 (0x0050 - 0x0000)
struct AvaTagLibrary_ResolveTagSoftHandle final
{
public:
	struct FAvaTagSoftHandle                      InTagSoftHandle;                                   // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAvaTagHandle                          ReturnValue;                                       // 0x0038(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaTagLibrary_ResolveTagSoftHandle;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
