#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvalancheText

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// Enum AvalancheText.EAvaFontSource
// NumValues: 0x0004
enum class EAvaFontSource : uint8
{
	System                                   = 0,
	Project                                  = 1,
	Invalid                                  = 2,
	EAvaFontSource_MAX                       = 3,
};

// Enum AvalancheText.EAvaTextColoringStyle
// NumValues: 0x0006
enum class EAvaTextColoringStyle : uint8
{
	Invalid                                  = 0,
	Solid                                    = 1,
	Gradient                                 = 2,
	FromTexture                              = 3,
	CustomMaterial                           = 4,
	EAvaTextColoringStyle_MAX                = 5,
};

// Enum AvalancheText.EAvaTextTranslucency
// NumValues: 0x0005
enum class EAvaTextTranslucency : uint8
{
	Invalid                                  = 0,
	None                                     = 1,
	Translucent                              = 2,
	GradientMask                             = 3,
	EAvaTextTranslucency_MAX                 = 4,
};

// Enum AvalancheText.EAvaMaterialMaskOrientation
// NumValues: 0x0004
enum class EAvaMaterialMaskOrientation : uint8
{
	LeftRight                                = 0,
	RightLeft                                = 1,
	Custom                                   = 2,
	EAvaMaterialMaskOrientation_MAX          = 3,
};

// Enum AvalancheText.EAvaGradientDirection
// NumValues: 0x0005
enum class EAvaGradientDirection : uint8
{
	None                                     = 0,
	Vertical                                 = 1,
	Horizontal                               = 2,
	Custom                                   = 3,
	EAvaGradientDirection_MAX                = 4,
};

// ScriptStruct AvalancheText.AvaFont
// 0x0038 (0x0038 - 0x0000)
struct FAvaFont final
{
public:
	class UFont*                                  CurrentFont;                                       // 0x0000(0x0008)(ZeroConstructor, Transient, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UAvaFontObject*                         MotionDesignFontObject;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FString                                 FontName;                                          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_20[0x18];                                      // 0x0020(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaFont;

// ScriptStruct AvalancheText.AvaLinearGradientSettings
// 0x0030 (0x0030 - 0x0000)
struct FAvaLinearGradientSettings final
{
public:
	EAvaGradientDirection                         Direction;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ColorA;                                            // 0x0004(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ColorB;                                            // 0x0014(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Smoothness;                                        // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Offset;                                            // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rotation;                                          // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaLinearGradientSettings;

SDK_NAMESPACE_END
