#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvalancheMask

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AvalancheShapes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GeometryMask_structs.hpp"
#include "Text3D_structs.hpp"


SDK_NAMESPACE_START

// Enum AvalancheMask.EAvaMask2DMode
// NumValues: 0x0003
enum class EAvaMask2DMode : uint8
{
	Read                                     = 0,
	Write                                    = 1,
	EAvaMask2DMode_MAX                       = 2,
};

// ScriptStruct AvalancheMask.AvaMask2DComponentMaterialPath
// 0x0050 (0x0050 - 0x0000)
struct FAvaMask2DComponentMaterialPath final
{
public:
	struct FSoftComponentReference                Component;                                         // 0x0000(0x0048)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SlotIdx;                                           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaMask2DComponentMaterialPath;

// ScriptStruct AvalancheMask.AvaMask2DActorData
// 0x0058 (0x0058 - 0x0000)
struct FAvaMask2DActorData final
{
public:
	TWeakObjectPtr<class UTexture>                CanvasTextureWeak;                                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FAvaMask2DComponentMaterialPath, class UMaterialInterface*> OriginalMaterials;       // 0x0008(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FAvaMask2DActorData;

// ScriptStruct AvalancheMask.AvaMaskActorMaterialCollectionHandleData
// 0x0050 (0x0050 - 0x0000)
struct FAvaMaskActorMaterialCollectionHandleData final
{
public:
	TMap<struct FAvaMask2DComponentMaterialPath, struct FInstancedStruct> ComponentMaterialData;     // 0x0000(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaMaskActorMaterialCollectionHandleData;

// ScriptStruct AvalancheMask.AvaMaskAvaShapeMaterialCollectionHandleData
// 0x0050 (0x0050 - 0x0000)
struct FAvaMaskAvaShapeMaterialCollectionHandleData final
{
public:
	TMap<int32, struct FInstancedStruct>          MaterialHandleData;                                // 0x0000(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaMaskAvaShapeMaterialCollectionHandleData;

// ScriptStruct AvalancheMask.AvaMask2DMaterialParameters
// 0x0048 (0x0048 - 0x0000)
struct FAvaMask2DMaterialParameters final
{
public:
	class FName                                   CanvasName;                                        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               Texture;                                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	EGeometryMaskColorChannel                     Channel;                                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ChannelAsVector;                                   // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvert;                                           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseOpacity;                                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2f                              Padding;                                           // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyFeathering;                                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OuterFeatherRadius;                                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InnerFeatherRadius;                                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBlendMode                                    BlendMode;                                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaMask2DMaterialParameters;

// ScriptStruct AvalancheMask.AvaMaskDesignedMaterialHandleData
// 0x0078 (0x0078 - 0x0000)
struct FAvaMaskDesignedMaterialHandleData final
{
public:
	struct FAvaMask2DMaterialParameters           OriginalMaskMaterialParameters;                    // 0x0000(0x0048)(NoDestructor, NativeAccessSpecifierPublic)
	EBlendMode                                    OriginalBlendMode;                                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialFunctionInterface> OriginalOutputProcessor;                        // 0x0050(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaMaskDesignedMaterialHandleData;

// ScriptStruct AvalancheMask.AvaMaskMaterialInstanceHandleData
// 0x0058 (0x0058 - 0x0000)
struct FAvaMaskMaterialInstanceHandleData final
{
public:
	TWeakObjectPtr<class UMaterialInterface>      OriginalMaterial;                                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAvaMask2DMaterialParameters           OriginalMaskMaterialParameters;                    // 0x0008(0x0048)(NoDestructor, NativeAccessSpecifierPublic)
	EBlendMode                                    OriginalBlendMode;                                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaMaskMaterialInstanceHandleData;

// ScriptStruct AvalancheMask.AvaMaskMaterialInstanceKey
// 0x0030 (0x0030 - 0x0000)
struct FAvaMaskMaterialInstanceKey final
{
public:
	TSoftObjectPtr<class UMaterialInterface>      ParentMaterial;                                    // 0x0000(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        PermutationKey;                                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaMaskMaterialInstanceKey;

// ScriptStruct AvalancheMask.AvaMaskMaterialPermutations
// 0x0078 (0x0078 - 0x0000)
struct FAvaMaskMaterialPermutations final
{
public:
	TSoftObjectPtr<class UMaterialInterface>      ParentMaterial;                                    // 0x0000(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<uint32, TWeakObjectPtr<class UMaterialInstanceDynamic>> Instances;                          // 0x0028(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaMaskMaterialPermutations;

// ScriptStruct AvalancheMask.AvaMaskParametricMaterialData
// 0x0050 (0x0050 - 0x0000)
struct FAvaMaskParametricMaterialData final
{
public:
	struct FAvaMask2DMaterialParameters           OriginalMaskMaterialParameters;                    // 0x0000(0x0048)(NoDestructor, NativeAccessSpecifierPublic)
	EBlendMode                                    OriginalBlendMode;                                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAvaShapeParametricMaterialStyle              OriginalMaterialStyle;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaMaskParametricMaterialData;

// ScriptStruct AvalancheMask.AvaMaskText3DActorMaterialCollectionHandleData
// 0x0058 (0x0058 - 0x0000)
struct FAvaMaskText3DActorMaterialCollectionHandleData final
{
public:
	EText3DMaterialBlendMode                      BlendMode;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FInstancedStruct>          GroupMaterialData;                                 // 0x0008(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaMaskText3DActorMaterialCollectionHandleData;

// ScriptStruct AvalancheMask.AvaMask2DSubjectParameters
// 0x0048 (0x0048 - 0x0000)
struct FAvaMask2DSubjectParameters final
{
public:
	struct FAvaMask2DMaterialParameters           MaterialParameters;                                // 0x0000(0x0048)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaMask2DSubjectParameters;

SDK_NAMESPACE_END
