#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvalancheTransition

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AvalancheTag_structs.hpp"


SDK_NAMESPACE_START

// Enum AvalancheTransition.EAvaTransitionType
// NumValues: 0x0004
enum class EAvaTransitionType : uint8
{
	None                                     = 0,
	In                                       = 1,
	Out                                      = 2,
	MAX                                      = 3,
};

// Enum AvalancheTransition.EAvaTransitionRunState
// NumValues: 0x0004
enum class EAvaTransitionRunState : uint8
{
	Unknown                                  = 0,
	Running                                  = 1,
	Finished                                 = 2,
	EAvaTransitionRunState_MAX               = 3,
};

// Enum AvalancheTransition.EAvaTransitionComparisonResult
// NumValues: 0x0004
enum class EAvaTransitionComparisonResult : uint8
{
	None                                     = 0,
	Different                                = 1,
	Same                                     = 2,
	EAvaTransitionComparisonResult_MAX       = 3,
};

// Enum AvalancheTransition.EAvaTransitionSceneType
// NumValues: 0x0003
enum class EAvaTransitionSceneType : uint8
{
	This                                     = 0,
	Other                                    = 1,
	EAvaTransitionSceneType_MAX              = 2,
};

// Enum AvalancheTransition.EAvaTransitionLayerCompareType
// NumValues: 0x0006
enum class EAvaTransitionLayerCompareType : uint8
{
	None                                     = 0,
	Same                                     = 1,
	Different                                = 2,
	MatchingTag                              = 3,
	Any                                      = 4,
	EAvaTransitionLayerCompareType_MAX       = 5,
};

// Enum AvalancheTransition.EAvaTransitionInstancingMode
// NumValues: 0x0003
enum class EAvaTransitionInstancingMode : uint8
{
	New                                      = 0,
	Reuse                                    = 1,
	EAvaTransitionInstancingMode_MAX         = 2,
};

// Enum AvalancheTransition.EAvaTransitionLevelHideMode
// NumValues: 0x0004
enum class EAvaTransitionLevelHideMode : uint8
{
	NoHide                                   = 0,
	HideUnlessReuse                          = 1,
	AlwaysHide                               = 2,
	EAvaTransitionLevelHideMode_MAX          = 3,
};

// ScriptStruct AvalancheTransition.AvaTransitionCondition
// 0x0010 (0x0038 - 0x0028)
struct FAvaTransitionCondition : public FStateTreeConditionBase
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionCondition;

// ScriptStruct AvalancheTransition.AvaTransitionContext
// 0x0030 (0x0030 - 0x0000)
struct FAvaTransitionContext final
{
public:
	struct FInstancedStruct                       TransitionScene;                                   // 0x0000(0x0010)(NativeAccessSpecifierPrivate)
	struct FAvaTagHandle                          TransitionLayer;                                   // 0x0010(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EAvaTransitionType                            TransitionType;                                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionContext;

// ScriptStruct AvalancheTransition.AvaTransitionDelayTaskInstanceData
// 0x0014 (0x0014 - 0x0000)
struct FAvaTransitionDelayTaskInstanceData final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAvaTransitionLevelHideMode                   HideMode;                                          // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0xF];                                        // 0x0005(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionDelayTaskInstanceData;

// ScriptStruct AvalancheTransition.AvaTransitionTask
// 0x0010 (0x0038 - 0x0028)
struct FAvaTransitionTask : public FStateTreeTaskBase
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionTask;

// ScriptStruct AvalancheTransition.AvaTransitionDelayTask
// 0x0010 (0x0048 - 0x0038)
struct FAvaTransitionDelayTask final : public FAvaTransitionTask
{
public:
	float                                         Duration;                                          // 0x0038(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0xC];                                       // 0x003C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionDelayTask;

// ScriptStruct AvalancheTransition.AvaTransitionDiscardSceneInstanceData
// 0x0001 (0x0001 - 0x0000)
struct FAvaTransitionDiscardSceneInstanceData final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionDiscardSceneInstanceData;

// ScriptStruct AvalancheTransition.AvaTransitionDiscardSceneTask
// 0x0000 (0x0038 - 0x0038)
struct FAvaTransitionDiscardSceneTask final : public FAvaTransitionTask
{
};
DUMPER7_ASSERTS_FAvaTransitionDiscardSceneTask;

// ScriptStruct AvalancheTransition.AvaTransitionExecutionExtension
// 0x0010 (0x0018 - 0x0008)
struct FAvaTransitionExecutionExtension final : public FStateTreeExecutionExtension
{
public:
	class FString                                 SceneDescription;                                  // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaTransitionExecutionExtension;

// ScriptStruct AvalancheTransition.AvaTransitionLayerConditionInstanceData
// 0x0020 (0x0020 - 0x0000)
struct FAvaTransitionLayerConditionInstanceData
{
public:
	EAvaTransitionLayerCompareType                LayerType;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaTagHandle                          SpecificLayer;                                     // 0x0008(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaTransitionLayerConditionInstanceData;

// ScriptStruct AvalancheTransition.AvaTransitionLayerCondition
// 0x0020 (0x0058 - 0x0038)
struct FAvaTransitionLayerCondition : public FAvaTransitionCondition
{
public:
	EAvaTransitionLayerCompareType                LayerType;                                         // 0x0038(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaTagHandle                          SpecificLayer;                                     // 0x0040(0x0018)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaTransitionLayerCondition;

// ScriptStruct AvalancheTransition.AvaTransitionLayerMatchConditionInstanceData
// 0x0000 (0x0020 - 0x0020)
struct FAvaTransitionLayerMatchConditionInstanceData final : public FAvaTransitionLayerConditionInstanceData
{
};
DUMPER7_ASSERTS_FAvaTransitionLayerMatchConditionInstanceData;

// ScriptStruct AvalancheTransition.AvaTransitionLayerMatchCondition
// 0x0000 (0x0058 - 0x0058)
struct FAvaTransitionLayerMatchCondition final : public FAvaTransitionLayerCondition
{
};
DUMPER7_ASSERTS_FAvaTransitionLayerMatchCondition;

// ScriptStruct AvalancheTransition.AvaTransitionLayerTaskInstanceData
// 0x0020 (0x0020 - 0x0000)
struct FAvaTransitionLayerTaskInstanceData
{
public:
	EAvaTransitionLayerCompareType                LayerType;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaTagHandle                          SpecificLayer;                                     // 0x0008(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaTransitionLayerTaskInstanceData;

// ScriptStruct AvalancheTransition.AvaTransitionLayerTask
// 0x0020 (0x0058 - 0x0038)
struct FAvaTransitionLayerTask : public FAvaTransitionTask
{
public:
	EAvaTransitionLayerCompareType                LayerType;                                         // 0x0038(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaTagHandle                          SpecificLayer;                                     // 0x0040(0x0018)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaTransitionLayerTask;

// ScriptStruct AvalancheTransition.AvaTransitionPreviewLevelState
// 0x0030 (0x0030 - 0x0000)
struct FAvaTransitionPreviewLevelState final
{
public:
	class ULevelStreaming*                        LevelStreaming;                                    // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	bool                                          bEnableOverrideTransitionLayer;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaTagHandle                          OverrideTransitionLayer;                           // 0x0010(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldUnload;                                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionPreviewLevelState;

// ScriptStruct AvalancheTransition.AvaTransitionScene
// 0x0070 (0x0070 - 0x0000)
struct alignas(0x08) FAvaTransitionScene
{
public:
	uint8                                         Pad_0[0x70];                                       // 0x0000(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionScene;

// ScriptStruct AvalancheTransition.AvaTransitionPreviewScene
// 0x0020 (0x0090 - 0x0070)
struct FAvaTransitionPreviewScene final : public FAvaTransitionScene
{
public:
	uint8                                         Pad_70[0x20];                                      // 0x0070(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionPreviewScene;

// ScriptStruct AvalancheTransition.AvaTransitionSceneMatchConditionInstanceData
// 0x0008 (0x0028 - 0x0020)
struct FAvaTransitionSceneMatchConditionInstanceData final : public FAvaTransitionLayerConditionInstanceData
{
public:
	EAvaTransitionComparisonResult                SceneComparisonType;                               // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionSceneMatchConditionInstanceData;

// ScriptStruct AvalancheTransition.AvaTransitionSceneMatchCondition
// 0x0008 (0x0060 - 0x0058)
struct FAvaTransitionSceneMatchCondition final : public FAvaTransitionLayerCondition
{
public:
	EAvaTransitionComparisonResult                SceneComparisonType;                               // 0x0058(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionSceneMatchCondition;

// ScriptStruct AvalancheTransition.AvaTransitionStateMatchConditionInstanceData
// 0x0008 (0x0028 - 0x0020)
struct FAvaTransitionStateMatchConditionInstanceData final : public FAvaTransitionLayerConditionInstanceData
{
public:
	EAvaTransitionRunState                        TransitionState;                                   // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionStateMatchConditionInstanceData;

// ScriptStruct AvalancheTransition.AvaTransitionStateMatchCondition
// 0x0008 (0x0060 - 0x0058)
struct FAvaTransitionStateMatchCondition final : public FAvaTransitionLayerCondition
{
public:
	EAvaTransitionRunState                        TransitionState;                                   // 0x0058(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionStateMatchCondition;

// ScriptStruct AvalancheTransition.AvaTransitionTypeMatchConditionInstanceData
// 0x0001 (0x0001 - 0x0000)
struct FAvaTransitionTypeMatchConditionInstanceData final
{
public:
	EAvaTransitionType                            TransitionType;                                    // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaTransitionTypeMatchConditionInstanceData;

// ScriptStruct AvalancheTransition.AvaTransitionTypeMatchCondition
// 0x0008 (0x0040 - 0x0038)
struct FAvaTransitionTypeMatchCondition final : public FAvaTransitionCondition
{
public:
	EAvaTransitionType                            TransitionType;                                    // 0x0038(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionTypeMatchCondition;

// ScriptStruct AvalancheTransition.AvaTransitionWaitForLayerTaskInstanceData
// 0x0010 (0x0030 - 0x0020)
struct FAvaTransitionWaitForLayerTaskInstanceData final : public FAvaTransitionLayerTaskInstanceData
{
public:
	EAvaTransitionLevelHideMode                   HideMode;                                          // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0xF];                                       // 0x0021(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionWaitForLayerTaskInstanceData;

// ScriptStruct AvalancheTransition.AvaTransitionWaitForLayerTask
// 0x0008 (0x0060 - 0x0058)
struct FAvaTransitionWaitForLayerTask final : public FAvaTransitionLayerTask
{
public:
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionWaitForLayerTask;

SDK_NAMESPACE_END
