#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvalancheMedia

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MediaIOCore_structs.hpp"
#include "AvalancheSequence_structs.hpp"
#include "Avalanche_structs.hpp"
#include "Slate_structs.hpp"
#include "AvalancheTransition_structs.hpp"
#include "AvalancheTag_structs.hpp"


SDK_NAMESPACE_START

// Enum AvalancheMedia.EAvaBroadcastAction
// NumValues: 0x0006
enum class EAvaBroadcastAction : uint32
{
	None                                     = 0,
	Start                                    = 1,
	Stop                                     = 2,
	UpdateConfig                             = 3,
	DeleteChannel                            = 4,
	EAvaBroadcastAction_MAX                  = 5,
};

// Enum AvalancheMedia.EAvaBroadcastChannelState
// NumValues: 0x0004
enum class EAvaBroadcastChannelState : uint8
{
	Offline                                  = 0,
	Idle                                     = 1,
	Live                                     = 2,
	Max                                      = 3,
};

// Enum AvalancheMedia.EAvaBroadcastChannelType
// NumValues: 0x0003
enum class EAvaBroadcastChannelType : uint8
{
	Program                                  = 0,
	Preview                                  = 1,
	EAvaBroadcastChannelType_MAX             = 2,
};

// Enum AvalancheMedia.EAvaBroadcastOutputState
// NumValues: 0x0007
enum class EAvaBroadcastOutputState : uint8
{
	Invalid                                  = 0,
	Offline                                  = 1,
	Idle                                     = 2,
	Preparing                                = 3,
	Live                                     = 4,
	Error                                    = 5,
	EAvaBroadcastOutputState_MAX             = 6,
};

// Enum AvalancheMedia.EAvaBroadcastIssueSeverity
// NumValues: 0x0004
enum class EAvaBroadcastIssueSeverity : uint8
{
	None                                     = 0,
	Warnings                                 = 1,
	Errors                                   = 2,
	Max                                      = 3,
};

// Enum AvalancheMedia.EAvaBroadcastOutputOverrunAction
// NumValues: 0x0003
enum class EAvaBroadcastOutputOverrunAction : uint8
{
	Flush                                    = 0,
	Skip                                     = 1,
	EAvaBroadcastOutputOverrunAction_MAX     = 2,
};

// Enum AvalancheMedia.EAvaPlayableStatus
// NumValues: 0x0007
enum class EAvaPlayableStatus : uint8
{
	Unknown                                  = 0,
	Error                                    = 1,
	Unloaded                                 = 2,
	Loading                                  = 3,
	Loaded                                   = 4,
	Visible                                  = 5,
	EAvaPlayableStatus_MAX                   = 6,
};

// Enum AvalancheMedia.EAvaPlayableSequenceEventType
// NumValues: 0x0005
enum class EAvaPlayableSequenceEventType : uint8
{
	None                                     = 0,
	Started                                  = 1,
	Paused                                   = 2,
	Finished                                 = 3,
	EAvaPlayableSequenceEventType_MAX        = 4,
};

// Enum AvalancheMedia.EAvaPlayableRCUpdateFlags
// NumValues: 0x0003
enum class EAvaPlayableRCUpdateFlags : uint8
{
	None                                     = 0,
	ExecuteControllerBehaviors               = 1,
	EAvaPlayableRCUpdateFlags_MAX            = 2,
};

// Enum AvalancheMedia.EAvaPlaybackAssetStatus
// NumValues: 0x0006
enum class EAvaPlaybackAssetStatus : uint32
{
	Unknown                                  = 0,
	Missing                                  = 1,
	MissingDependencies                      = 2,
	NeedsSync                                = 3,
	Available                                = 4,
	EAvaPlaybackAssetStatus_MAX              = 5,
};

// Enum AvalancheMedia.EAvaPlaybackStatus
// NumValues: 0x000C
enum class EAvaPlaybackStatus : uint32
{
	Unknown                                  = 0,
	Missing                                  = 1,
	Syncing                                  = 2,
	Available                                = 3,
	Loading                                  = 4,
	Loaded                                   = 5,
	Starting                                 = 6,
	Started                                  = 7,
	Stopping                                 = 8,
	Unloading                                = 9,
	Error                                    = 10,
	EAvaPlaybackStatus_MAX                   = 11,
};

// Enum AvalancheMedia.EAvaRundownPageListType
// NumValues: 0x0004
enum class EAvaRundownPageListType : uint8
{
	Template                                 = 0,
	Instance                                 = 1,
	View                                     = 2,
	EAvaRundownPageListType_MAX              = 3,
};

// Enum AvalancheMedia.EAvaMediaLogVerbosity
// NumValues: 0x0009
enum class EAvaMediaLogVerbosity : uint8
{
	NoLogging                                = 0,
	Fatal                                    = 1,
	Error                                    = 2,
	Warning                                  = 3,
	Display                                  = 4,
	Log                                      = 5,
	Verbose                                  = 6,
	VeryVerbose                              = 7,
	EAvaMediaLogVerbosity_MAX                = 8,
};

// Enum AvalancheMedia.EAvaMediaSyncResponseResult
// NumValues: 0x0004
enum class EAvaMediaSyncResponseResult : uint8
{
	Error                                    = 0,
	Success                                  = 1,
	Unknown                                  = 2,
	EAvaMediaSyncResponseResult_MAX          = 3,
};

// Enum AvalancheMedia.EAvaMediaSyncEngineType
// NumValues: 0x0007
enum class EAvaMediaSyncEngineType : uint8
{
	Server                                   = 0,
	Commandlet                               = 1,
	Editor                                   = 2,
	Game                                     = 3,
	Other                                    = 4,
	Unknown                                  = 5,
	EAvaMediaSyncEngineType_MAX              = 6,
};

// Enum AvalancheMedia.EAvaPlayableEndPlayOptions
// NumValues: 0x0004
enum class EAvaPlayableEndPlayOptions : uint8
{
	None                                     = 0,
	ConditionalEndPlayWorld                  = 1,
	ForceImmediate                           = 2,
	EAvaPlayableEndPlayOptions_MAX           = 3,
};

// Enum AvalancheMedia.EAvaPlayableRemoteControlResult
// NumValues: 0x0008
enum class EAvaPlayableRemoteControlResult : uint64
{
	Completed                                = 0,
	UpToDate                                 = 1,
	InvalidParameter                         = 18446744073709551615,
	ReadAccessDenied                         = 18446744073709551614,
	WriteAccessDenied                        = 18446744073709551613,
	ReadPropertyFailed                       = 18446744073709551612,
	WritePropertyFailed                      = 18446744073709551611,
	EAvaPlayableRemoteControlResult_MAX      = 2,
};

// Enum AvalancheMedia.EAvaPlayableRemoteControlChanges
// NumValues: 0x0005
enum class EAvaPlayableRemoteControlChanges : uint8
{
	None                                     = 0,
	EntityValues                             = 1,
	ControllerValues                         = 2,
	All                                      = 255,
	EAvaPlayableRemoteControlChanges_MAX     = 256,
};

// Enum AvalancheMedia.EAvaPlaybackAction
// NumValues: 0x0009
enum class EAvaPlaybackAction : uint32
{
	None                                     = 0,
	Load                                     = 1,
	Start                                    = 2,
	Stop                                     = 3,
	Unload                                   = 4,
	Status                                   = 5,
	SetUserData                              = 6,
	GetUserData                              = 7,
	EAvaPlaybackAction_MAX                   = 8,
};

// Enum AvalancheMedia.EAvaPlaybackAnimAction
// NumValues: 0x0007
enum class EAvaPlaybackAnimAction : uint32
{
	None                                     = 0,
	Play                                     = 1,
	Continue                                 = 2,
	Stop                                     = 3,
	PreviewFrame                             = 4,
	CameraCut                                = 5,
	EAvaPlaybackAnimAction_MAX               = 6,
};

// Enum AvalancheMedia.EAvaPlaybackStopOptions
// NumValues: 0x0005
enum class EAvaPlaybackStopOptions : uint8
{
	None                                     = 0,
	ForceImmediate                           = 2,
	Unload                                   = 4,
	Default                                  = 0,
	EAvaPlaybackStopOptions_MAX              = 5,
};

// Enum AvalancheMedia.EAvaPlaybackUnloadOptions
// NumValues: 0x0004
enum class EAvaPlaybackUnloadOptions : uint8
{
	None                                     = 0,
	ForceImmediate                           = 2,
	Default                                  = 0,
	EAvaPlaybackUnloadOptions_MAX            = 3,
};

// Enum AvalancheMedia.EAvaPlaybackPackageEventFlags
// NumValues: 0x0006
enum class EAvaPlaybackPackageEventFlags : uint8
{
	None                                     = 0,
	External                                 = 1,
	Saved                                    = 2,
	AssetDeleted                             = 4,
	All                                      = 255,
	EAvaPlaybackPackageEventFlags_MAX        = 256,
};

// Enum AvalancheMedia.EAvaPlaybackPackageEvent
// NumValues: 0x0005
enum class EAvaPlaybackPackageEvent : uint32
{
	None                                     = 0,
	PreSave                                  = 1,
	PostSave                                 = 2,
	AssetDeleted                             = 3,
	EAvaPlaybackPackageEvent_MAX             = 4,
};

// Enum AvalancheMedia.EAvaRundownPageStopOptions
// NumValues: 0x0004
enum class EAvaRundownPageStopOptions : uint8
{
	None                                     = 0,
	ForceNoTransition                        = 2,
	Default                                  = 0,
	EAvaRundownPageStopOptions_MAX           = 3,
};

// Enum AvalancheMedia.EAvaRundownPagePlayType
// NumValues: 0x0004
enum class EAvaRundownPagePlayType : uint8
{
	PlayFromStart                            = 0,
	PreviewFromStart                         = 1,
	PreviewFromFrame                         = 2,
	EAvaRundownPagePlayType_MAX              = 3,
};

// Enum AvalancheMedia.EAvaRundownPageStatus
// NumValues: 0x000C
enum class EAvaRundownPageStatus : uint8
{
	Unknown                                  = 0,
	Offline                                  = 1,
	Missing                                  = 2,
	NeedsSync                                = 3,
	Syncing                                  = 4,
	Available                                = 5,
	Loading                                  = 6,
	Loaded                                   = 7,
	Playing                                  = 8,
	Previewing                               = 9,
	Error                                    = 10,
	EAvaRundownPageStatus_MAX                = 11,
};

// Enum AvalancheMedia.EAvaRundownServerBuildTargetType
// NumValues: 0x0007
enum class EAvaRundownServerBuildTargetType : uint8
{
	Unknown                                  = 0,
	Editor                                   = 1,
	Game                                     = 2,
	Server                                   = 3,
	Client                                   = 4,
	Program                                  = 5,
	EAvaRundownServerBuildTargetType_MAX     = 6,
};

// Enum AvalancheMedia.EAvaRundownServerEngineMode
// NumValues: 0x0007
enum class EAvaRundownServerEngineMode : uint8
{
	Unknown                                  = 0,
	Editor                                   = 1,
	Game                                     = 2,
	Server                                   = 3,
	Commandlet                               = 4,
	Other                                    = 5,
	EAvaRundownServerEngineMode_MAX          = 6,
};

// Enum AvalancheMedia.EAvaRundownPageActions
// NumValues: 0x000B
enum class EAvaRundownPageActions : uint32
{
	None                                     = 0,
	Load                                     = 1,
	Unload                                   = 2,
	Play                                     = 3,
	PlayNext                                 = 4,
	Stop                                     = 5,
	ForceStop                                = 6,
	Continue                                 = 7,
	UpdateValues                             = 8,
	TakeToProgram                            = 9,
	EAvaRundownPageActions_MAX               = 10,
};

// Enum AvalancheMedia.EAvaRundownTransitionActions
// NumValues: 0x0003
enum class EAvaRundownTransitionActions : uint32
{
	None                                     = 0,
	ForceStop                                = 1,
	EAvaRundownTransitionActions_MAX         = 2,
};

// Enum AvalancheMedia.EAvaRundownTransitionLayerActions
// NumValues: 0x0004
enum class EAvaRundownTransitionLayerActions : uint32
{
	None                                     = 0,
	Stop                                     = 1,
	ForceStop                                = 2,
	EAvaRundownTransitionLayerActions_MAX    = 3,
};

// Enum AvalancheMedia.EAvaRundownPageTransitionEvents
// NumValues: 0x0004
enum class EAvaRundownPageTransitionEvents : uint32
{
	None                                     = 0,
	Started                                  = 1,
	Finished                                 = 2,
	EAvaRundownPageTransitionEvents_MAX      = 3,
};

// Enum AvalancheMedia.EAvaRundownAssetEvent
// NumValues: 0x0004
enum class EAvaRundownAssetEvent : uint8
{
	Unknown                                  = 0,
	Added                                    = 1,
	Removed                                  = 2,
	EAvaRundownAssetEvent_MAX                = 3,
};

// Enum AvalancheMedia.EAvaRundownChannelActions
// NumValues: 0x0004
enum class EAvaRundownChannelActions : uint32
{
	None                                     = 0,
	Start                                    = 1,
	Stop                                     = 2,
	EAvaRundownChannelActions_MAX            = 3,
};

// Enum AvalancheMedia.EAvaRundownChannelEditActions
// NumValues: 0x0004
enum class EAvaRundownChannelEditActions : uint32
{
	None                                     = 0,
	Add                                      = 1,
	Remove                                   = 2,
	EAvaRundownChannelEditActions_MAX        = 3,
};

// ScriptStruct AvalancheMedia.AvaBroadcastDeviceProviderData
// 0x01A8 (0x01A8 - 0x0000)
struct FAvaBroadcastDeviceProviderData final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMediaIOConnection>             Connections;                                       // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMediaIOConfiguration>          Configurations;                                    // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMediaIODevice>                 devices;                                           // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMediaIOMode>                   Modes;                                             // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMediaIOInputConfiguration>     InputConfigurations;                               // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMediaIOOutputConfiguration>    OutputConfigurations;                              // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMediaIOVideoTimecodeConfiguration> TimecodeConfigurations;                        // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FMediaIOConfiguration                  DefaultConfiguration;                              // 0x0078(0x003C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMediaIOMode                           DefaultMode;                                       // 0x00B4(0x0018)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMediaIOInputConfiguration             DefaultInputConfiguration;                         // 0x00CC(0x0044)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMediaIOOutputConfiguration            DefaultOutputConfiguration;                        // 0x0110(0x004C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMediaIOVideoTimecodeConfiguration     DefaultTimecodeConfiguration;                      // 0x015C(0x0040)(NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bShowInputTransportInSelector;                     // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowOutputTransportInSelector;                    // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowInputKeyInSelector;                           // 0x019E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowOutputKeyInSelector;                          // 0x019F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowReferenceInSelector;                          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaBroadcastDeviceProviderData;

// ScriptStruct AvalancheMedia.AvaBroadcastDeviceProviderDataList
// 0x0020 (0x0020 - 0x0000)
struct FAvaBroadcastDeviceProviderDataList final
{
public:
	class FString                                 ServerName;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAvaBroadcastDeviceProviderData> DeviceProviders;                                  // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaBroadcastDeviceProviderDataList;

// ScriptStruct AvalancheMedia.AvaBroadcastDeviceProviderRegistryData
// 0x00A0 (0x00A0 - 0x0000)
struct FAvaBroadcastDeviceProviderRegistryData final
{
public:
	TMap<class FName, class FName>                DeviceProviderNames;                               // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FName, class FText>                OutputClassDisplayNames;                           // 0x0050(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaBroadcastDeviceProviderRegistryData;

// ScriptStruct AvalancheMedia.AvaBroadcastMediaOutputInfo
// 0x0030 (0x0030 - 0x0000)
struct FAvaBroadcastMediaOutputInfo final
{
public:
	struct FGuid                                  Guid;                                              // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerName;                                        // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DeviceProviderName;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DeviceName;                                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaBroadcastMediaOutputInfo;

// ScriptStruct AvalancheMedia.AvaBroadcastCapture
// 0x0030 (0x0030 - 0x0000)
struct FAvaBroadcastCapture final
{
public:
	class UMediaCapture*                          MediaCapture;                                      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UMediaOutput*                           MediaOutput;                                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_10[0x20];                                      // 0x0010(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaBroadcastCapture;

// ScriptStruct AvalancheMedia.AvaBroadcastOutputChannel
// 0x0160 (0x0160 - 0x0000)
struct FAvaBroadcastOutputChannel final
{
public:
	int32                                         ChannelIndex;                                      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMediaOutput*>                   MediaOutputs;                                      // 0x0008(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<struct FAvaBroadcastMediaOutputInfo>   MediaOutputInfos;                                  // 0x0018(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FAvaViewportQualitySettings            QualitySettings;                                   // 0x0028(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	TMap<class UMediaOutput*, struct FAvaBroadcastCapture> MediaCaptures;                            // 0x0038(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	class UUserWidget*                            OverridePlaceholderUserWidget;                     // 0x0088(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UTextureRenderTarget2D*                 PlaceholderRenderTarget;                           // 0x0090(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UTextureRenderTarget2D*                 PlaceholderRenderTargetTmp;                        // 0x0098(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_A0[0xC0];                                      // 0x00A0(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaBroadcastOutputChannel;

// ScriptStruct AvalancheMedia.AvaBroadcastProfile
// 0x0030 (0x0030 - 0x0000)
struct FAvaBroadcastProfile final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ProfileName;                                       // 0x0008(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAvaBroadcastOutputChannel>     Channels;                                          // 0x0010(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaBroadcastProfile;

// ScriptStruct AvalancheMedia.AvaRundownPageListReference
// 0x0014 (0x0014 - 0x0000)
struct FAvaRundownPageListReference final
{
public:
	EAvaRundownPageListType                       Type;                                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  SubListId;                                         // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaRundownPageListReference;

// ScriptStruct AvalancheMedia.AvaPlaybackServerLoggingEntry
// 0x000C (0x000C - 0x0000)
struct FAvaPlaybackServerLoggingEntry final
{
public:
	class FName                                   Category;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAvaMediaLogVerbosity                         VerbosityLevel;                                    // 0x0008(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaPlaybackServerLoggingEntry;

// ScriptStruct AvalancheMedia.AvaMediaLocalPlaybackServerSettings
// 0x0040 (0x0040 - 0x0000)
struct FAvaMediaLocalPlaybackServerSettings final
{
public:
	class FString                                 ServerName;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              Resolution;                                        // 0x0010(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableLogConsole;                                 // 0x0018(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ExtraCommandLineArguments;                         // 0x0020(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAvaPlaybackServerLoggingEntry> Logging;                                           // 0x0030(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaMediaLocalPlaybackServerSettings;

// ScriptStruct AvalancheMedia.AvaMediaSyncConnectionInfo
// 0x0058 (0x0058 - 0x0000)
struct alignas(0x08) FAvaMediaSyncConnectionInfo final
{
public:
	uint8                                         Pad_0[0x58];                                       // 0x0000(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaMediaSyncConnectionInfo;

// ScriptStruct AvalancheMedia.AvaMediaSyncResponse
// 0x0080 (0x0080 - 0x0000)
struct alignas(0x08) FAvaMediaSyncResponse
{
public:
	uint8                                         Pad_0[0x80];                                       // 0x0000(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaMediaSyncResponse;

// ScriptStruct AvalancheMedia.AvaMediaSyncCompareResponse
// 0x0008 (0x0088 - 0x0080)
struct FAvaMediaSyncCompareResponse final : public FAvaMediaSyncResponse
{
public:
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaMediaSyncCompareResponse;

// ScriptStruct AvalancheMedia.AvaPlayableRemoteControlControlledEntityInfo
// 0x0010 (0x0010 - 0x0000)
struct FAvaPlayableRemoteControlControlledEntityInfo final
{
public:
	TArray<struct FGuid>                          ControlledBy;                                      // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaPlayableRemoteControlControlledEntityInfo;

// ScriptStruct AvalancheMedia.AvaPlayableRemoteControlPresetInfo
// 0x00B8 (0x00B8 - 0x0000)
struct FAvaPlayableRemoteControlPresetInfo final
{
public:
	struct FGuid                                  PresetId;                                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGuid, struct FAvaPlayableRemoteControlControlledEntityInfo> EntitiesControlledByController; // 0x0010(0x0050)(NativeAccessSpecifierPublic)
	TSet<struct FGuid>                            OverlappingControllers;                            // 0x0060(0x0050)(NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaPlayableRemoteControlPresetInfo;

// ScriptStruct AvalancheMedia.AvaPlayableRemoteControlValue
// 0x0018 (0x0018 - 0x0000)
struct FAvaPlayableRemoteControlValue final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDefault;                                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaPlayableRemoteControlValue;

// ScriptStruct AvalancheMedia.AvaPlayableRemoteControlValues
// 0x00A0 (0x00A0 - 0x0000)
struct FAvaPlayableRemoteControlValues final
{
public:
	TMap<struct FGuid, struct FAvaPlayableRemoteControlValue> EntityValues;                          // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	TMap<struct FGuid, struct FAvaPlayableRemoteControlValue> ControllerValues;                      // 0x0050(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaPlayableRemoteControlValues;

// ScriptStruct AvalancheMedia.AvaPlayableRemoteControlValueAsBytes_Legacy
// 0x0018 (0x0018 - 0x0000)
struct FAvaPlayableRemoteControlValueAsBytes_Legacy final
{
public:
	TArray<uint8>                                 Bytes;                                             // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIsDefault;                                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaPlayableRemoteControlValueAsBytes_Legacy;

// ScriptStruct AvalancheMedia.AvaSynchronizedEventsFeatureSelection
// 0x0010 (0x0010 - 0x0000)
struct FAvaSynchronizedEventsFeatureSelection final
{
public:
	class FString                                 Implementation;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaSynchronizedEventsFeatureSelection;

// ScriptStruct AvalancheMedia.AvaPlayableSettings
// 0x0028 (0x0028 - 0x0000)
struct FAvaPlayableSettings final
{
public:
	struct FAvaSynchronizedEventsFeatureSelection SynchronizedEventsFeature;                         // 0x0000(0x0010)(Edit, Config, NativeAccessSpecifierPublic)
	bool                                          bHidePawnActors;                                   // 0x0010(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         IgnoredControllerPostfix;                          // 0x0018(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaPlayableSettings;

// ScriptStruct AvalancheMedia.AvaPlayableTransitionScene
// 0x0028 (0x0098 - 0x0070)
struct FAvaPlayableTransitionScene final : public FAvaTransitionScene
{
public:
	uint8                                         Pad_70[0x28];                                      // 0x0070(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaPlayableTransitionScene;

// ScriptStruct AvalancheMedia.AvaPlaybackAnimPlaySettings
// 0x0020 (0x0020 - 0x0000)
struct FAvaPlaybackAnimPlaySettings final
{
public:
	EAvaPlaybackAnimAction                        Action;                                            // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AnimationName;                                     // 0x0004(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartAtTime;                                       // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoopCount;                                         // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAvaSequencePlayMode                          PlayMode;                                          // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlaybackSpeed;                                     // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRestoreState;                                     // 0x001C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaPlaybackAnimPlaySettings;

// ScriptStruct AvalancheMedia.AvaPlaybackAnimations
// 0x0050 (0x0050 - 0x0000)
struct FAvaPlaybackAnimations final
{
public:
	TSet<struct FAvaPlaybackAnimPlaySettings>     AvailableAnimations;                               // 0x0000(0x0050)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaPlaybackAnimations;

// ScriptStruct AvalancheMedia.AvaPlaybackPlayableGroup
// 0x0050 (0x0050 - 0x0000)
struct FAvaPlaybackPlayableGroup final
{
public:
	TMap<struct FSoftObjectPath, class UAvaPlayable*> Playables;                                     // 0x0000(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FAvaPlaybackPlayableGroup;

// ScriptStruct AvalancheMedia.AvaPlaybackHttpRouteInfo
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) FAvaPlaybackHttpRouteInfo final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaPlaybackHttpRouteInfo;

// ScriptStruct AvalancheMedia.AvaPlaybackHttpRouteDesc
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FAvaPlaybackHttpRouteDesc final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaPlaybackHttpRouteDesc;

// ScriptStruct AvalancheMedia.AvaPlaybackClientMessageBase
// 0x0010 (0x0010 - 0x0000)
struct FAvaPlaybackClientMessageBase
{
public:
	class FString                                 ClientName;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaPlaybackClientMessageBase;

// ScriptStruct AvalancheMedia.AvaPlaybackServerMessageBase
// 0x0010 (0x0010 - 0x0000)
struct FAvaPlaybackServerMessageBase
{
public:
	class FString                                 ServerName;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaPlaybackServerMessageBase;

// ScriptStruct AvalancheMedia.AvaPlaybackPing
// 0x0008 (0x0018 - 0x0010)
struct FAvaPlaybackPing final : public FAvaPlaybackClientMessageBase
{
public:
	bool                                          bAutoPing;                                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PingIntervalSeconds;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaPlaybackPing;

// ScriptStruct AvalancheMedia.AvaPlaybackPong
// 0x0020 (0x0030 - 0x0010)
struct FAvaPlaybackPong final : public FAvaPlaybackServerMessageBase
{
public:
	bool                                          bAutoPong;                                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequestClientInfo;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ProjectContentPath;                                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ProcessId;                                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaPlaybackPong;

// ScriptStruct AvalancheMedia.AvaPlaybackLog
// 0x0028 (0x0038 - 0x0010)
struct FAvaPlaybackLog final : public FAvaPlaybackServerMessageBase
{
public:
	class FString                                 Text;                                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Verbosity;                                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Category;                                          // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Time;                                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaPlaybackLog;

// ScriptStruct AvalancheMedia.AvaPlaybackUpdateClientInfo
// 0x0028 (0x0038 - 0x0010)
struct FAvaPlaybackUpdateClientInfo final : public FAvaPlaybackClientMessageBase
{
public:
	class FString                                 ComputerName;                                      // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProjectContentPath;                                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ProcessId;                                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaPlaybackUpdateClientInfo;

// ScriptStruct AvalancheMedia.AvaPlaybackUpdateClientUserData
// 0x0050 (0x0060 - 0x0010)
struct FAvaPlaybackUpdateClientUserData final : public FAvaPlaybackClientMessageBase
{
public:
	TMap<class FString, class FString>            UserDataEntries;                                   // 0x0010(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaPlaybackUpdateClientUserData;

// ScriptStruct AvalancheMedia.AvaPlaybackUpdateServerUserData
// 0x0050 (0x0060 - 0x0010)
struct FAvaPlaybackUpdateServerUserData final : public FAvaPlaybackServerMessageBase
{
public:
	TMap<class FString, class FString>            UserDataEntries;                                   // 0x0010(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaPlaybackUpdateServerUserData;

// ScriptStruct AvalancheMedia.AvaPlaybackStatCommand
// 0x0028 (0x0038 - 0x0010)
struct FAvaPlaybackStatCommand final : public FAvaPlaybackClientMessageBase
{
public:
	class FString                                 Command;                                           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClientStateReliable;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ClientEnabledRuntimeStats;                         // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaPlaybackStatCommand;

// ScriptStruct AvalancheMedia.AvaPlaybackStatStatus
// 0x0018 (0x0028 - 0x0010)
struct FAvaPlaybackStatStatus final : public FAvaPlaybackServerMessageBase
{
public:
	bool                                          bClientStateReliable;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCommandSucceeded;                                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         EnabledRuntimeStats;                               // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaPlaybackStatStatus;

// ScriptStruct AvalancheMedia.AvaPlaybackDeviceProviderDataRequest
// 0x0000 (0x0010 - 0x0010)
struct FAvaPlaybackDeviceProviderDataRequest final : public FAvaPlaybackClientMessageBase
{
};
DUMPER7_ASSERTS_FAvaPlaybackDeviceProviderDataRequest;

// ScriptStruct AvalancheMedia.AvaPlaybackInstanceSettingsUpdate
// 0x0008 (0x0018 - 0x0010)
struct FAvaPlaybackInstanceSettingsUpdate final : public FAvaPlaybackClientMessageBase
{
public:
	struct FAvaInstanceSettings                   InstanceSettings;                                  // 0x0010(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaPlaybackInstanceSettingsUpdate;

// ScriptStruct AvalancheMedia.AvaPlaybackPlayableSettingsUpdate
// 0x0028 (0x0038 - 0x0010)
struct FAvaPlaybackPlayableSettingsUpdate final : public FAvaPlaybackClientMessageBase
{
public:
	struct FAvaPlayableSettings                   PlayableSettings;                                  // 0x0010(0x0028)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaPlaybackPlayableSettingsUpdate;

// ScriptStruct AvalancheMedia.AvaPlaybackPackageEvent
// 0x0010 (0x0020 - 0x0010)
struct FAvaPlaybackPackageEvent final : public FAvaPlaybackClientMessageBase
{
public:
	class FName                                   PackageName;                                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAvaPlaybackPackageEvent                      Event;                                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaPlaybackPackageEvent;

// ScriptStruct AvalancheMedia.AvaPlaybackAssetStatusRequest
// 0x0028 (0x0038 - 0x0010)
struct FAvaPlaybackAssetStatusRequest final : public FAvaPlaybackClientMessageBase
{
public:
	struct FSoftObjectPath                        AssetPath;                                         // 0x0010(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceRefresh;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaPlaybackAssetStatusRequest;

// ScriptStruct AvalancheMedia.AvaPlaybackAssetStatus
// 0x0028 (0x0038 - 0x0010)
struct FAvaPlaybackAssetStatus final : public FAvaPlaybackServerMessageBase
{
public:
	struct FSoftObjectPath                        AssetPath;                                         // 0x0010(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAvaPlaybackAssetStatus                       Status;                                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaPlaybackAssetStatus;

// ScriptStruct AvalancheMedia.AvaPlaybackCommand
// 0x0058 (0x0058 - 0x0000)
struct FAvaPlaybackCommand final
{
public:
	struct FGuid                                  InstanceId;                                        // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        AssetPath;                                         // 0x0010(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ChannelName;                                       // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAvaPlaybackAction                            Action;                                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Arguments;                                         // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaPlaybackCommand;

// ScriptStruct AvalancheMedia.AvaPlaybackRequest
// 0x0010 (0x0020 - 0x0010)
struct FAvaPlaybackRequest final : public FAvaPlaybackClientMessageBase
{
public:
	TArray<struct FAvaPlaybackCommand>            Commands;                                          // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaPlaybackRequest;

// ScriptStruct AvalancheMedia.AvaPlaybackStatus
// 0x0058 (0x0068 - 0x0010)
struct FAvaPlaybackStatus final : public FAvaPlaybackServerMessageBase
{
public:
	struct FGuid                                  InstanceId;                                        // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        AssetPath;                                         // 0x0020(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ChannelName;                                       // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAvaPlaybackStatus                            Status;                                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValidUserData;                                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UserData;                                          // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaPlaybackStatus;

// ScriptStruct AvalancheMedia.AvaPlaybackStatuses
// 0x0038 (0x0048 - 0x0010)
struct FAvaPlaybackStatuses final : public FAvaPlaybackServerMessageBase
{
public:
	class FString                                 ChannelName;                                       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          InstanceIds;                                       // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                AssetPaths;                                        // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	EAvaPlaybackStatus                            Status;                                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaPlaybackStatuses;

// ScriptStruct AvalancheMedia.AvaPlaybackAnimActionInfo
// 0x0018 (0x0018 - 0x0000)
struct FAvaPlaybackAnimActionInfo final
{
public:
	class FString                                 AnimationName;                                     // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAvaPlaybackAnimAction                        AnimationAction;                                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaPlaybackAnimActionInfo;

// ScriptStruct AvalancheMedia.AvaPlaybackAnimPlaybackRequest
// 0x0060 (0x0070 - 0x0010)
struct FAvaPlaybackAnimPlaybackRequest final : public FAvaPlaybackClientMessageBase
{
public:
	struct FGuid                                  InstanceId;                                        // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        AssetPath;                                         // 0x0020(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ChannelName;                                       // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAvaPlaybackAnimPlaySettings>   AnimPlaySettings;                                  // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAvaPlaybackAnimActionInfo>     AnimActionInfos;                                   // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaPlaybackAnimPlaybackRequest;

// ScriptStruct AvalancheMedia.AvaPlaybackSequenceEvent
// 0x0058 (0x0068 - 0x0010)
struct FAvaPlaybackSequenceEvent final : public FAvaPlaybackServerMessageBase
{
public:
	struct FGuid                                  InstanceId;                                        // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        AssetPath;                                         // 0x0020(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ChannelName;                                       // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SequenceLabel;                                     // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAvaPlayableSequenceEventType                 EventType;                                         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FrameNumber;                                       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaPlaybackSequenceEvent;

// ScriptStruct AvalancheMedia.AvaPlaybackRemoteControlUpdateRequest
// 0x00E8 (0x00F8 - 0x0010)
struct FAvaPlaybackRemoteControlUpdateRequest final : public FAvaPlaybackClientMessageBase
{
public:
	struct FGuid                                  InstanceId;                                        // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        AssetPath;                                         // 0x0020(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ChannelName;                                       // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAvaPlayableRemoteControlValues        RemoteControlValues;                               // 0x0050(0x00A0)(NativeAccessSpecifierPublic)
	EAvaPlayableRCUpdateFlags                     UpdateFlags;                                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaPlaybackRemoteControlUpdateRequest;

// ScriptStruct AvalancheMedia.AvaPlaybackTransitionStartRequest
// 0x0068 (0x0078 - 0x0010)
struct FAvaPlaybackTransitionStartRequest final : public FAvaPlaybackClientMessageBase
{
public:
	class FString                                 ChannelName;                                       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  TransitionId;                                      // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          EnterInstanceIds;                                  // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          PlayingInstanceIds;                                // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          ExitInstanceIds;                                   // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAvaPlayableRemoteControlValues> EnterValues;                                      // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bUnloadDiscardedInstances;                         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         TransitionFlags;                                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
