#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvalancheMedia

#include "Basic.hpp"

#include "AvalancheTag_structs.hpp"
#include "AvalancheMedia_structs.hpp"
#include "MediaIOCore_structs.hpp"
#include "MediaIOCore_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "Avalanche_structs.hpp"
#include "Slate_structs.hpp"
#include "DeveloperSettings_classes.hpp"


SDK_NAMESPACE_START

// Class AvalancheMedia.AvaBroadcast
// 0x0150 (0x0178 - 0x0028)
class UAvaBroadcast final : public UObject
{
public:
	uint8                                         Pad_28[0x34];                                      // 0x0028(0x0034)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CurrentProfile;                                    // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ChannelNames;                                      // 0x0068(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, struct FAvaBroadcastProfile> Profiles;                                         // 0x0078(0x0050)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, EAvaBroadcastChannelType>   ChannelTypes;                                      // 0x00C8(0x0050)(Protected, NativeAccessSpecifierProtected)
	TMap<class FName, class FName>                PinnedChannels;                                    // 0x0118(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_168[0x10];                                     // 0x0168(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAvaBroadcast* GetBroadcast();

	void StartBroadcast();
	void StopBroadcast();

	bool IsBroadcastingAllChannels() const;
	bool IsBroadcastingAnyChannel() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaBroadcast")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaBroadcast")
	}
	static class UAvaBroadcast* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaBroadcast>();
	}
};
DUMPER7_ASSERTS_UAvaBroadcast;

// Class AvalancheMedia.AvaBroadcastComponent
// 0x0008 (0x00C0 - 0x00B8)
class UAvaBroadcastComponent final : public UActorComponent
{
public:
	bool                                          bStopBroadcastOnTearDown;                          // 0x00B8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool StartBroadcasting(class FString* OutErrorMessage);
	bool StopBroadcasting();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaBroadcastComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaBroadcastComponent")
	}
	static class UAvaBroadcastComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaBroadcastComponent>();
	}
};
DUMPER7_ASSERTS_UAvaBroadcastComponent;

// Class AvalancheMedia.AvaBroadcastDisplayMediaCapture
// 0x0038 (0x02E0 - 0x02A8)
class UAvaBroadcastDisplayMediaCapture final : public UMediaCapture
{
public:
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x02A8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_2B0[0x30];                                     // 0x02B0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaBroadcastDisplayMediaCapture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaBroadcastDisplayMediaCapture")
	}
	static class UAvaBroadcastDisplayMediaCapture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaBroadcastDisplayMediaCapture>();
	}
};
DUMPER7_ASSERTS_UAvaBroadcastDisplayMediaCapture;

// Class AvalancheMedia.AvaBroadcastDisplayMediaOutput
// 0x0050 (0x0080 - 0x0030)
class UAvaBroadcastDisplayMediaOutput final : public UMediaOutput
{
public:
	struct FMediaIOOutputConfiguration            OutputConfiguration;                               // 0x0030(0x004C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaBroadcastDisplayMediaOutput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaBroadcastDisplayMediaOutput")
	}
	static class UAvaBroadcastDisplayMediaOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaBroadcastDisplayMediaOutput>();
	}
};
DUMPER7_ASSERTS_UAvaBroadcastDisplayMediaOutput;

// Class AvalancheMedia.AvaBroadcastLibrary
// 0x0000 (0x0028 - 0x0028)
class UAvaBroadcastLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class FName GetChannelName(const class UObject* InWorldContextObject);
	static EAvaBroadcastChannelState GetChannelStatus(const class FName InChannelName);
	static EAvaBroadcastChannelType GetChannelType(const class FName InChannelName);
	static struct FVector2D GetChannelViewportSize(const class UObject* InWorldContextObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaBroadcastLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaBroadcastLibrary")
	}
	static class UAvaBroadcastLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaBroadcastLibrary>();
	}
};
DUMPER7_ASSERTS_UAvaBroadcastLibrary;

// Class AvalancheMedia.AvaBroadcastRenderTargetMediaCapture
// 0x0030 (0x02D8 - 0x02A8)
class UAvaBroadcastRenderTargetMediaCapture final : public UMediaCapture
{
public:
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x02A8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_2B0[0x28];                                     // 0x02B0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaBroadcastRenderTargetMediaCapture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaBroadcastRenderTargetMediaCapture")
	}
	static class UAvaBroadcastRenderTargetMediaCapture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaBroadcastRenderTargetMediaCapture>();
	}
};
DUMPER7_ASSERTS_UAvaBroadcastRenderTargetMediaCapture;

// Class AvalancheMedia.AvaBroadcastRenderTargetMediaOutput
// 0x0040 (0x0070 - 0x0030)
class UAvaBroadcastRenderTargetMediaOutput final : public UMediaOutput
{
public:
	bool                                          bInvertKeyOutput;                                  // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTextureRenderTarget2D>  RenderTarget;                                      // 0x0038(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SourceName;                                        // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaBroadcastRenderTargetMediaOutput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaBroadcastRenderTargetMediaOutput")
	}
	static class UAvaBroadcastRenderTargetMediaOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaBroadcastRenderTargetMediaOutput>();
	}
};
DUMPER7_ASSERTS_UAvaBroadcastRenderTargetMediaOutput;

// Class AvalancheMedia.AvaPlayableGroup
// 0x01A8 (0x01D0 - 0x0028)
class UAvaPlayableGroup : public UObject
{
public:
	class UTextureRenderTarget2D*                 ManagedRenderTarget;                               // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UGameInstance*                          GameInstance;                                      // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_38[0x198];                                     // 0x0038(0x0198)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlayableGroup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlayableGroup")
	}
	static class UAvaPlayableGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlayableGroup>();
	}
};
DUMPER7_ASSERTS_UAvaPlayableGroup;

// Class AvalancheMedia.AvaGameInstancePlayableGroup
// 0x0008 (0x01D8 - 0x01D0)
class UAvaGameInstancePlayableGroup final : public UAvaPlayableGroup
{
public:
	class UPackage*                               GameInstancePackage;                               // 0x01D0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaGameInstancePlayableGroup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaGameInstancePlayableGroup")
	}
	static class UAvaGameInstancePlayableGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaGameInstancePlayableGroup>();
	}
};
DUMPER7_ASSERTS_UAvaGameInstancePlayableGroup;

// Class AvalancheMedia.AvaGameViewportMediaCapture
// 0x0000 (0x02A8 - 0x02A8)
class UAvaGameViewportMediaCapture final : public UMediaCapture
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaGameViewportMediaCapture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaGameViewportMediaCapture")
	}
	static class UAvaGameViewportMediaCapture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaGameViewportMediaCapture>();
	}
};
DUMPER7_ASSERTS_UAvaGameViewportMediaCapture;

// Class AvalancheMedia.AvaGameViewportMediaOutput
// 0x0010 (0x0040 - 0x0030)
class UAvaGameViewportMediaOutput final : public UMediaOutput
{
public:
	class FString                                 SourceName;                                        // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaGameViewportMediaOutput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaGameViewportMediaOutput")
	}
	static class UAvaGameViewportMediaOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaGameViewportMediaOutput>();
	}
};
DUMPER7_ASSERTS_UAvaGameViewportMediaOutput;

// Class AvalancheMedia.AvaGameViewportPlayableGroup
// 0x0010 (0x01E0 - 0x01D0)
class UAvaGameViewportPlayableGroup final : public UAvaPlayableGroup
{
public:
	uint8                                         Pad_1D0[0x10];                                     // 0x01D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaGameViewportPlayableGroup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaGameViewportPlayableGroup")
	}
	static class UAvaGameViewportPlayableGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaGameViewportPlayableGroup>();
	}
};
DUMPER7_ASSERTS_UAvaGameViewportPlayableGroup;

// Class AvalancheMedia.AvaMediaSettings
// 0x0118 (0x0150 - 0x0038)
class UAvaMediaSettings final : public UDeveloperSettings
{
public:
	struct FLinearColor                           ChannelClearColor;                                 // 0x0038(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPixelFormat                                  ChannelDefaultPixelFormat;                         // 0x0048(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              ChannelDefaultResolution;                          // 0x004C(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAvaBroadcastOutputOverrunAction              ChannelOutputOverrunAction;                        // 0x0054(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawPlaceholderWidget;                            // 0x0055(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   PlaceholderWidgetClass;                            // 0x0058(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              PreviewDefaultResolution;                          // 0x0080(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PreviewChannelName;                                // 0x0088(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableComboTemplateSpecialLogic;                  // 0x0098(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableSingleTemplateSpecialLogic;                 // 0x0099(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoStartPlaybackClient;                          // 0x009A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVerbosePlaybackClientLogging;                     // 0x009B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PingInterval;                                      // 0x009C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PingTimeoutInterval;                               // 0x00A0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClientPendingStatusRequestTimeout;                 // 0x00A4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoStartPlaybackServer;                          // 0x00A8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PlaybackServerName;                                // 0x00B0(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAvaMediaLogVerbosity                         PlaybackServerLogReplicationVerbosity;             // 0x00C0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ServerPendingStatusRequestTimeout;                 // 0x00C4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ServerPendingPlaybackCommandTimeout;               // 0x00C8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaMediaLocalPlaybackServerSettings   LocalPlaybackServerSettings;                       // 0x00D0(0x0040)(Edit, Config, NativeAccessSpecifierPublic)
	bool                                          bKeepPagesLoaded;                                  // 0x0110(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAvaInstanceSettings                   AvaInstanceSettings;                               // 0x0111(0x0002)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaPlayableSettings                   PlayableSettings;                                  // 0x0118(0x0028)(Edit, Config, NativeAccessSpecifierPublic)
	int32                                         ManagedInstanceCacheMaximumSize;                   // 0x0140(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoStartWebServer;                               // 0x0144(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        HttpServerPort;                                    // 0x0148(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaMediaSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaMediaSettings")
	}
	static class UAvaMediaSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaMediaSettings>();
	}
};
DUMPER7_ASSERTS_UAvaMediaSettings;

// Class AvalancheMedia.AvaPlayable
// 0x0058 (0x0080 - 0x0028)
class UAvaPlayable : public UObject
{
public:
	class UAvaPlayableGroup*                      PlayableGroup;                                     // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlayable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlayable")
	}
	static class UAvaPlayable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlayable>();
	}
};
DUMPER7_ASSERTS_UAvaPlayable;

// Class AvalancheMedia.AvaPlayableAssetUserData
// 0x0008 (0x0030 - 0x0028)
class UAvaPlayableAssetUserData final : public UAssetUserData
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlayableAssetUserData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlayableAssetUserData")
	}
	static class UAvaPlayableAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlayableAssetUserData>();
	}
};
DUMPER7_ASSERTS_UAvaPlayableAssetUserData;

// Class AvalancheMedia.AvaPlayableGroupAssetUserData
// 0x0010 (0x0038 - 0x0028)
class UAvaPlayableGroupAssetUserData final : public UAssetUserData
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlayableGroupAssetUserData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlayableGroupAssetUserData")
	}
	static class UAvaPlayableGroupAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlayableGroupAssetUserData>();
	}
};
DUMPER7_ASSERTS_UAvaPlayableGroupAssetUserData;

// Class AvalancheMedia.AvaPlayableGroupChannelManager
// 0x0018 (0x0040 - 0x0028)
class UAvaPlayableGroupChannelManager final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlayableGroupChannelManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlayableGroupChannelManager")
	}
	static class UAvaPlayableGroupChannelManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlayableGroupChannelManager>();
	}
};
DUMPER7_ASSERTS_UAvaPlayableGroupChannelManager;

// Class AvalancheMedia.AvaPlayableGroupManager
// 0x0120 (0x0148 - 0x0028)
class UAvaPlayableGroupManager final : public UObject
{
public:
	TMap<class FName, class UAvaPlayableGroupChannelManager*> ChannelManagers;                       // 0x0028(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_78[0xD0];                                      // 0x0078(0x00D0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlayableGroupManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlayableGroupManager")
	}
	static class UAvaPlayableGroupManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlayableGroupManager>();
	}
};
DUMPER7_ASSERTS_UAvaPlayableGroupManager;

// Class AvalancheMedia.AvaPlayableGroupSubsystem
// 0x0008 (0x0038 - 0x0030)
class UAvaPlayableGroupSubsystem final : public UGameInstanceSubsystem
{
public:
	class UAvaPlayableGroupManager*               PlayableGroupManager;                              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlayableGroupSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlayableGroupSubsystem")
	}
	static class UAvaPlayableGroupSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlayableGroupSubsystem>();
	}
};
DUMPER7_ASSERTS_UAvaPlayableGroupSubsystem;

// Class AvalancheMedia.AvaPlayableLevelStreaming
// 0x0110 (0x0190 - 0x0080)
class alignas(0x10) UAvaPlayableLevelStreaming final : public UAvaPlayable
{
public:
	TSoftObjectPtr<class UWorld>                  SourceLevel;                                       // 0x0080(0x0028)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULevelStreamingDynamic*                 LevelStreaming;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class AAvaScene*                              Scene;                                             // 0x00B0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAvaPlayableLevelStreaming*>     SubPlayables;                                      // 0x00C0(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_D0[0xC0];                                      // 0x00D0(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlayableLevelStreaming")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlayableLevelStreaming")
	}
	static class UAvaPlayableLevelStreaming* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlayableLevelStreaming>();
	}
};
DUMPER7_ASSERTS_UAvaPlayableLevelStreaming;

// Class AvalancheMedia.AvaPlayableLibrary
// 0x0000 (0x0028 - 0x0028)
class UAvaPlayableLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool IsPlayableHidden(const class UObject* InWorldContextObject);
	static void PlayableSyncEventLatent(const class UObject* InWorldContextObject, const struct FLatentActionInfo& InLatentInfo, const class FString& InEventSignature, bool* bInSuccess);
	static bool SetPlayableHidden(const class UObject* InWorldContextObject, bool bInShouldBeHidden);
	static bool UpdatePlayableRemoteControlValues(const class UObject* InWorldContextObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlayableLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlayableLibrary")
	}
	static class UAvaPlayableLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlayableLibrary>();
	}
};
DUMPER7_ASSERTS_UAvaPlayableLibrary;

// Class AvalancheMedia.AvaPlayableTransition
// 0x0108 (0x0130 - 0x0028)
class UAvaPlayableTransition : public UObject
{
public:
	uint8                                         Pad_28[0x108];                                     // 0x0028(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlayableTransition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlayableTransition")
	}
	static class UAvaPlayableTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlayableTransition>();
	}
};
DUMPER7_ASSERTS_UAvaPlayableTransition;

// Class AvalancheMedia.AvaPlayableLocalTransition
// 0x0028 (0x0158 - 0x0130)
class UAvaPlayableLocalTransition final : public UAvaPlayableTransition
{
public:
	uint8                                         Pad_130[0x28];                                     // 0x0130(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlayableLocalTransition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlayableLocalTransition")
	}
	static class UAvaPlayableLocalTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlayableLocalTransition>();
	}
};
DUMPER7_ASSERTS_UAvaPlayableLocalTransition;

// Class AvalancheMedia.AvaPlayableRemoteProxy
// 0x0040 (0x00C0 - 0x0080)
class UAvaPlayableRemoteProxy final : public UAvaPlayable
{
public:
	uint8                                         Pad_80[0x40];                                      // 0x0080(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlayableRemoteProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlayableRemoteProxy")
	}
	static class UAvaPlayableRemoteProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlayableRemoteProxy>();
	}
};
DUMPER7_ASSERTS_UAvaPlayableRemoteProxy;

// Class AvalancheMedia.AvaPlayableRemoteTransition
// 0x0058 (0x0188 - 0x0130)
class UAvaPlayableRemoteTransition final : public UAvaPlayableTransition
{
public:
	uint8                                         Pad_130[0x58];                                     // 0x0130(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlayableRemoteTransition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlayableRemoteTransition")
	}
	static class UAvaPlayableRemoteTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlayableRemoteTransition>();
	}
};
DUMPER7_ASSERTS_UAvaPlayableRemoteTransition;

// Class AvalancheMedia.AvaPlaybackGraph
// 0x0188 (0x01B0 - 0x0028)
class UAvaPlaybackGraph final : public UObject
{
public:
	uint8                                         Pad_28[0xE0];                                      // 0x0028(0x00E0)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvaPlaybackNodeRoot*                   RootNode;                                          // 0x0108(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<class UAvaPlaybackNodePlayer*>         PlayerNodes;                                       // 0x0110(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	class UAvaPlayableGroupManager*               PlayableGroupManager;                              // 0x0120(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	TMap<class FName, struct FAvaPlaybackPlayableGroup> ChannelPlayableGroups;                       // 0x0128(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_178[0x38];                                     // 0x0178(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void LoadInstances();
	void Play();
	void Stop(EAvaPlaybackStopOptions InStopOptions);
	void UnloadInstances(EAvaPlaybackUnloadOptions InUnloadOptions);

	bool IsPlaying() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlaybackGraph")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlaybackGraph")
	}
	static class UAvaPlaybackGraph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlaybackGraph>();
	}
};
DUMPER7_ASSERTS_UAvaPlaybackGraph;

// Class AvalancheMedia.AvaPlaybackNode
// 0x0070 (0x0098 - 0x0028)
class UAvaPlaybackNode : public UObject
{
public:
	TArray<class UAvaPlaybackNode*>               ChildNodes;                                        // 0x0028(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_38[0x60];                                      // 0x0038(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlaybackNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlaybackNode")
	}
	static class UAvaPlaybackNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlaybackNode>();
	}
};
DUMPER7_ASSERTS_UAvaPlaybackNode;

// Class AvalancheMedia.AvaPlaybackNodeEvent
// 0x0000 (0x0098 - 0x0098)
class UAvaPlaybackNodeEvent : public UAvaPlaybackNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlaybackNodeEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlaybackNodeEvent")
	}
	static class UAvaPlaybackNodeEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlaybackNodeEvent>();
	}
};
DUMPER7_ASSERTS_UAvaPlaybackNodeEvent;

// Class AvalancheMedia.AvaPlaybackNodeAction
// 0x0000 (0x0098 - 0x0098)
class UAvaPlaybackNodeAction : public UAvaPlaybackNodeEvent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlaybackNodeAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlaybackNodeAction")
	}
	static class UAvaPlaybackNodeAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlaybackNodeAction>();
	}
};
DUMPER7_ASSERTS_UAvaPlaybackNodeAction;

// Class AvalancheMedia.AvaPlaybackNodeCombiner
// 0x0010 (0x00A8 - 0x0098)
class UAvaPlaybackNodeCombiner final : public UAvaPlaybackNode
{
public:
	TArray<bool>                                  EnabledIndices;                                    // 0x0098(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlaybackNodeCombiner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlaybackNodeCombiner")
	}
	static class UAvaPlaybackNodeCombiner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlaybackNodeCombiner>();
	}
};
DUMPER7_ASSERTS_UAvaPlaybackNodeCombiner;

// Class AvalancheMedia.AvaPlaybackNodeFlow
// 0x0000 (0x0098 - 0x0098)
class UAvaPlaybackNodeFlow : public UAvaPlaybackNodeEvent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlaybackNodeFlow")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlaybackNodeFlow")
	}
	static class UAvaPlaybackNodeFlow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlaybackNodeFlow>();
	}
};
DUMPER7_ASSERTS_UAvaPlaybackNodeFlow;

// Class AvalancheMedia.AvaPlaybackNodePlayer
// 0x0040 (0x00D8 - 0x0098)
class UAvaPlaybackNodePlayer : public UAvaPlaybackNode
{
public:
	class FString                                 LoadOptions;                                       // 0x0098(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A8[0x30];                                      // 0x00A8(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlaybackNodePlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlaybackNodePlayer")
	}
	static class UAvaPlaybackNodePlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlaybackNodePlayer>();
	}
};
DUMPER7_ASSERTS_UAvaPlaybackNodePlayer;

// Class AvalancheMedia.AvaPlaybackNodeLevelPlayer
// 0x0028 (0x0100 - 0x00D8)
class UAvaPlaybackNodeLevelPlayer final : public UAvaPlaybackNodePlayer
{
public:
	TSoftObjectPtr<class UWorld>                  LevelAsset;                                        // 0x00D8(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlaybackNodeLevelPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlaybackNodeLevelPlayer")
	}
	static class UAvaPlaybackNodeLevelPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlaybackNodeLevelPlayer>();
	}
};
DUMPER7_ASSERTS_UAvaPlaybackNodeLevelPlayer;

// Class AvalancheMedia.AvaPlaybackNodeRoot
// 0x0020 (0x00B8 - 0x0098)
class UAvaPlaybackNodeRoot final : public UAvaPlaybackNode
{
public:
	uint8                                         Pad_98[0x10];                                      // 0x0098(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTextureRenderTarget2D*>         RenderTargets;                                     // 0x00A8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlaybackNodeRoot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlaybackNodeRoot")
	}
	static class UAvaPlaybackNodeRoot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlaybackNodeRoot>();
	}
};
DUMPER7_ASSERTS_UAvaPlaybackNodeRoot;

// Class AvalancheMedia.AvaPlaybackNodeSwitcher
// 0x0008 (0x00A0 - 0x0098)
class UAvaPlaybackNodeSwitcher final : public UAvaPlaybackNode
{
public:
	bool                                          bEnabled;                                          // 0x0098(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectedIndex;                                     // 0x009C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlaybackNodeSwitcher")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlaybackNodeSwitcher")
	}
	static class UAvaPlaybackNodeSwitcher* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlaybackNodeSwitcher>();
	}
};
DUMPER7_ASSERTS_UAvaPlaybackNodeSwitcher;

// Class AvalancheMedia.AvaPlaybackNodeTrigger
// 0x0008 (0x00A0 - 0x0098)
class UAvaPlaybackNodeTrigger : public UAvaPlaybackNodeEvent
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlaybackNodeTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlaybackNodeTrigger")
	}
	static class UAvaPlaybackNodeTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlaybackNodeTrigger>();
	}
};
DUMPER7_ASSERTS_UAvaPlaybackNodeTrigger;

// Class AvalancheMedia.AvaPlaybackNode_BeginPlay
// 0x0000 (0x00A0 - 0x00A0)
class UAvaPlaybackNode_BeginPlay final : public UAvaPlaybackNodeTrigger
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlaybackNode_BeginPlay")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlaybackNode_BeginPlay")
	}
	static class UAvaPlaybackNode_BeginPlay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlaybackNode_BeginPlay>();
	}
};
DUMPER7_ASSERTS_UAvaPlaybackNode_BeginPlay;

// Class AvalancheMedia.AvaPlaybackNode_Hub
// 0x0000 (0x0098 - 0x0098)
class UAvaPlaybackNode_Hub final : public UAvaPlaybackNodeFlow
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlaybackNode_Hub")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlaybackNode_Hub")
	}
	static class UAvaPlaybackNode_Hub* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlaybackNode_Hub>();
	}
};
DUMPER7_ASSERTS_UAvaPlaybackNode_Hub;

// Class AvalancheMedia.AvaPlaybackNode_KeyInput
// 0x0030 (0x00D0 - 0x00A0)
class UAvaPlaybackNode_KeyInput final : public UAvaPlaybackNodeTrigger
{
public:
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputChord                            InputChord;                                        // 0x00B0(0x0020)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlaybackNode_KeyInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlaybackNode_KeyInput")
	}
	static class UAvaPlaybackNode_KeyInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlaybackNode_KeyInput>();
	}
};
DUMPER7_ASSERTS_UAvaPlaybackNode_KeyInput;

// Class AvalancheMedia.AvaPlaybackNode_PlayAnim
// 0x00A0 (0x0138 - 0x0098)
class UAvaPlaybackNode_PlayAnim final : public UAvaPlaybackNodeAction
{
public:
	TMap<struct FSoftObjectPath, struct FAvaPlaybackAnimations> AnimationMap;                        // 0x0098(0x0050)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x50];                                      // 0x00E8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlaybackNode_PlayAnim")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlaybackNode_PlayAnim")
	}
	static class UAvaPlaybackNode_PlayAnim* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlaybackNode_PlayAnim>();
	}
};
DUMPER7_ASSERTS_UAvaPlaybackNode_PlayAnim;

// Class AvalancheMedia.AvaPlaybackNode_PreloadPlayer
// 0x0000 (0x0098 - 0x0098)
class UAvaPlaybackNode_PreloadPlayer final : public UAvaPlaybackNodeAction
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlaybackNode_PreloadPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlaybackNode_PreloadPlayer")
	}
	static class UAvaPlaybackNode_PreloadPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlaybackNode_PreloadPlayer>();
	}
};
DUMPER7_ASSERTS_UAvaPlaybackNode_PreloadPlayer;

// Class AvalancheMedia.AvaPlaybackTransition
// 0x0018 (0x0040 - 0x0028)
class UAvaPlaybackTransition : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlaybackTransition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlaybackTransition")
	}
	static class UAvaPlaybackTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlaybackTransition>();
	}
};
DUMPER7_ASSERTS_UAvaPlaybackTransition;

// Class AvalancheMedia.AvaPlaybackServerTransition
// 0x00C0 (0x0100 - 0x0040)
class UAvaPlaybackServerTransition final : public UAvaPlaybackTransition
{
public:
	uint8                                         Pad_40[0xB0];                                      // 0x0040(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvaPlayableTransition*                 PlayableTransition;                                // 0x00F0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPlaybackServerTransition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPlaybackServerTransition")
	}
	static class UAvaPlaybackServerTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaPlaybackServerTransition>();
	}
};
DUMPER7_ASSERTS_UAvaPlaybackServerTransition;

// Class AvalancheMedia.AvaRemoteProxyPlayableGroup
// 0x0008 (0x01D8 - 0x01D0)
class UAvaRemoteProxyPlayableGroup final : public UAvaPlayableGroup
{
public:
	uint8                                         Pad_1D0[0x8];                                      // 0x01D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaRemoteProxyPlayableGroup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaRemoteProxyPlayableGroup")
	}
	static class UAvaRemoteProxyPlayableGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaRemoteProxyPlayableGroup>();
	}
};
DUMPER7_ASSERTS_UAvaRemoteProxyPlayableGroup;

// Class AvalancheMedia.AvaRundown
// 0x0240 (0x0268 - 0x0028)
class UAvaRundown final : public UObject
{
public:
	TArray<struct FAvaRundownPage>                Pages;                                             // 0x0028(0x0010)(ZeroConstructor, Deprecated, Protected, NativeAccessSpecifierProtected)
	struct FAvaRundownPageCollection              TemplatePages;                                     // 0x0038(0x0060)(Protected, NativeAccessSpecifierProtected)
	struct FAvaRundownPageCollection              InstancedPages;                                    // 0x0098(0x0060)(Protected, NativeAccessSpecifierProtected)
	TArray<struct FAvaRundownSubList>             SubLists;                                          // 0x00F8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FAvaRundownPageListReference           ActivePageList;                                    // 0x0108(0x0014)(Transient, DuplicateTransient, NoDestructor, Protected, TextExportTransient, NativeAccessSpecifierProtected)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAvaRundownPagePlayer*>          PagePlayers;                                       // 0x0120(0x0010)(ZeroConstructor, Transient, DuplicateTransient, Protected, TextExportTransient, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<class UAvaRundownPageTransition*>      PageTransitions;                                   // 0x0130(0x0010)(ZeroConstructor, Transient, DuplicateTransient, Protected, TextExportTransient, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_140[0x128];                                    // 0x0140(0x0128)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaRundown")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaRundown")
	}
	static class UAvaRundown* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaRundown>();
	}
};
DUMPER7_ASSERTS_UAvaRundown;

// Class AvalancheMedia.AvaRundownComponent
// 0x0008 (0x00C0 - 0x00B8)
class UAvaRundownComponent final : public UActorComponent
{
public:
	class UAvaRundown*                            Rundown;                                           // 0x00B8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	bool PlayPage(int32 InPageId);
	bool StopPage(int32 InPageId);

	int32 GetNumberOfPages() const;
	int32 GetPageIdForIndex(int32 InPageIndex) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaRundownComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaRundownComponent")
	}
	static class UAvaRundownComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaRundownComponent>();
	}
};
DUMPER7_ASSERTS_UAvaRundownComponent;

// Class AvalancheMedia.AvaRundownMacroCollection
// 0x0010 (0x0038 - 0x0028)
class UAvaRundownMacroCollection final : public UObject
{
public:
	TArray<struct FAvaRundownMacroKeyBinding>     KeyBindings;                                       // 0x0028(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaRundownMacroCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaRundownMacroCollection")
	}
	static class UAvaRundownMacroCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaRundownMacroCollection>();
	}
};
DUMPER7_ASSERTS_UAvaRundownMacroCollection;

// Class AvalancheMedia.AvaRundownPlaybackInstancePlayer
// 0x0058 (0x0080 - 0x0028)
class UAvaRundownPlaybackInstancePlayer final : public UObject
{
public:
	struct FAvaTagHandle                          TransitionLayer;                                   // 0x0028(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SourceAssetPath;                                   // 0x0040(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAvaPlaybackGraph*                      Playback;                                          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_68[0x18];                                      // 0x0068(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaRundownPlaybackInstancePlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaRundownPlaybackInstancePlayer")
	}
	static class UAvaRundownPlaybackInstancePlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaRundownPlaybackInstancePlayer>();
	}
};
DUMPER7_ASSERTS_UAvaRundownPlaybackInstancePlayer;

// Class AvalancheMedia.AvaRundownPagePlayer
// 0x0038 (0x0060 - 0x0028)
class UAvaRundownPagePlayer final : public UObject
{
public:
	int32                                         PageID;                                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPreview;                                        // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ChannelFName;                                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ChannelName;                                       // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAvaRundownPlaybackInstancePlayer*> InstancePlayers;                                // 0x0048(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaRundownPagePlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaRundownPagePlayer")
	}
	static class UAvaRundownPagePlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaRundownPagePlayer>();
	}
};
DUMPER7_ASSERTS_UAvaRundownPagePlayer;

// Class AvalancheMedia.AvaRundownPageTransition
// 0x01A8 (0x01E8 - 0x0040)
class UAvaRundownPageTransition final : public UAvaPlaybackTransition
{
public:
	TSet<struct FGuid>                            InstancesBypassingTransition;                      // 0x0040(0x0050)(Transient, NativeAccessSpecifierPublic)
	TSet<struct FGuid>                            ReusedInstances;                                   // 0x0090(0x0050)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0[0x100];                                     // 0x00E0(0x0100)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvaPlayableTransition*                 PlayableTransition;                                // 0x01E0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaRundownPageTransition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaRundownPageTransition")
	}
	static class UAvaRundownPageTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaRundownPageTransition>();
	}
};
DUMPER7_ASSERTS_UAvaRundownPageTransition;

// Class AvalancheMedia.AvaBroadcastOutputChannelViewInterface
// 0x0000 (0x0000 - 0x0000)
class IAvaBroadcastOutputChannelViewInterface final
{
public:
	void SetChannelName(const class FText& InChannelName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaBroadcastOutputChannelViewInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaBroadcastOutputChannelViewInterface")
	}
