#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvalancheSequence

#include "Basic.hpp"

#include "AvalancheSequence_structs.hpp"
#include "AvalancheTag_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function AvalancheSequence.AvaSequence.SetLabel
// 0x0008 (0x0008 - 0x0000)
struct AvaSequence_SetLabel final
{
public:
	class FName                                   InLabel;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequence_SetLabel;

// Function AvalancheSequence.AvaSequence.SetMark
// 0x0060 (0x0060 - 0x0000)
struct AvaSequence_SetMark final
{
public:
	class FString                                 InMarkLabel;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAvaMark                               InMark;                                            // 0x0010(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AvaSequence_SetMark;

// Function AvalancheSequence.AvaSequence.GetEndTime
// 0x0008 (0x0008 - 0x0000)
struct AvaSequence_GetEndTime final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequence_GetEndTime;

// Function AvalancheSequence.AvaSequence.GetLabel
// 0x0008 (0x0008 - 0x0000)
struct AvaSequence_GetLabel final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequence_GetLabel;

// Function AvalancheSequence.AvaSequence.GetMark
// 0x0060 (0x0060 - 0x0000)
struct AvaSequence_GetMark final
{
public:
	class FString                                 InMarkLabel;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAvaMark                               OutMark;                                           // 0x0010(0x0048)(Parm, OutParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AvaSequence_GetMark;

// Function AvalancheSequence.AvaSequence.GetMarks
// 0x0050 (0x0050 - 0x0000)
struct AvaSequence_GetMarks final
{
public:
	TSet<struct FAvaMark>                         ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequence_GetMarks;

// Function AvalancheSequence.AvaSequence.GetSequenceTag
// 0x0018 (0x0018 - 0x0000)
struct AvaSequence_GetSequenceTag final
{
public:
	struct FAvaTagHandle                          ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequence_GetSequenceTag;

// Function AvalancheSequence.AvaSequence.GetStartTime
// 0x0008 (0x0008 - 0x0000)
struct AvaSequence_GetStartTime final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequence_GetStartTime;

// Function AvalancheSequence.AvaSequenceDirector.PlaySequencesByLabel
// 0x0078 (0x0078 - 0x0000)
struct AvaSequenceDirector_PlaySequencesByLabel final
{
public:
	class FName                                   InSequenceLabel;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAvaSequencePlayParams                 InPlaySettings;                                    // 0x0008(0x0070)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequenceDirector_PlaySequencesByLabel;

// Function AvalancheSequence.AvaSequenceDirector.GetPlaybackObject
// 0x0010 (0x0010 - 0x0000)
struct AvaSequenceDirector_GetPlaybackObject final
{
public:
	TScriptInterface<class IAvaSequencePlaybackObject> ReturnValue;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequenceDirector_GetPlaybackObject;

// Function AvalancheSequence.AvaSequenceLibrary.GetPlaybackObject
// 0x0018 (0x0018 - 0x0000)
struct AvaSequenceLibrary_GetPlaybackObject final
{
public:
	const class UObject*                          InWorldContextObject;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class IAvaSequencePlaybackObject> ReturnValue;                                  // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequenceLibrary_GetPlaybackObject;

// Function AvalancheSequence.AvaSequenceLibrary.MakeSingleFramePlaySettings
// 0x00A8 (0x00A8 - 0x0000)
struct AvaSequenceLibrary_MakeSingleFramePlaySettings final
{
public:
	struct FAvaSequenceTime                       InTargetTime;                                      // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EAvaSequencePlayMode                          InPlayMode;                                        // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaSequencePlayParams                 ReturnValue;                                       // 0x0038(0x0070)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequenceLibrary_MakeSingleFramePlaySettings;

// Function AvalancheSequence.AvaSequencePlaybackObject.ContinueSequencesByLabel
// 0x0018 (0x0018 - 0x0000)
struct AvaSequencePlaybackObject_ContinueSequencesByLabel final
{
public:
	class FName                                   InSequenceLabel;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAvaSequencePlayer*>             ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequencePlaybackObject_ContinueSequencesByLabel;

// Function AvalancheSequence.AvaSequencePlaybackObject.ContinueSequencesByLabels
// 0x0020 (0x0020 - 0x0000)
struct AvaSequencePlaybackObject_ContinueSequencesByLabels final
{
public:
	TArray<class FName>                           InSequenceLabels;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UAvaSequencePlayer*>             ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequencePlaybackObject_ContinueSequencesByLabels;

// Function AvalancheSequence.AvaSequencePlaybackObject.ContinueSequencesByTag
// 0x0030 (0x0030 - 0x0000)
struct AvaSequencePlaybackObject_ContinueSequencesByTag final
{
public:
	struct FAvaTagHandle                          InTagHandle;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInExactMatch;                                     // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAvaSequencePlayer*>             ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequencePlaybackObject_ContinueSequencesByTag;

// Function AvalancheSequence.AvaSequencePlaybackObject.PlayScheduledSequences
// 0x0010 (0x0010 - 0x0000)
struct AvaSequencePlaybackObject_PlayScheduledSequences final
{
public:
	TArray<class UAvaSequencePlayer*>             ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequencePlaybackObject_PlayScheduledSequences;

// Function AvalancheSequence.AvaSequencePlaybackObject.PlaySequenceBySoftReference
// 0x00A0 (0x00A0 - 0x0000)
struct AvaSequencePlaybackObject_PlaySequenceBySoftReference final
{
public:
	TSoftObjectPtr<class UAvaSequence>            InSequence;                                        // 0x0000(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAvaSequencePlayParams                 InPlaySettings;                                    // 0x0028(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UAvaSequencePlayer*                     ReturnValue;                                       // 0x0098(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequencePlaybackObject_PlaySequenceBySoftReference;

// Function AvalancheSequence.AvaSequencePlaybackObject.PlaySequencesByLabel
// 0x0088 (0x0088 - 0x0000)
struct AvaSequencePlaybackObject_PlaySequencesByLabel final
{
public:
	class FName                                   InSequenceLabel;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAvaSequencePlayParams                 InPlaySettings;                                    // 0x0008(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UAvaSequencePlayer*>             ReturnValue;                                       // 0x0078(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequencePlaybackObject_PlaySequencesByLabel;

// Function AvalancheSequence.AvaSequencePlaybackObject.PlaySequencesByLabels
// 0x0090 (0x0090 - 0x0000)
struct AvaSequencePlaybackObject_PlaySequencesByLabels final
{
public:
	TArray<class FName>                           InSequenceLabels;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAvaSequencePlayParams                 InPlaySettings;                                    // 0x0010(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UAvaSequencePlayer*>             ReturnValue;                                       // 0x0080(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequencePlaybackObject_PlaySequencesByLabels;

// Function AvalancheSequence.AvaSequencePlaybackObject.PlaySequencesBySoftReference
// 0x0090 (0x0090 - 0x0000)
struct AvaSequencePlaybackObject_PlaySequencesBySoftReference final
{
public:
	TArray<TSoftObjectPtr<class UAvaSequence>>    InSequences;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FAvaSequencePlayParams                 InPlaySettings;                                    // 0x0010(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UAvaSequencePlayer*>             ReturnValue;                                       // 0x0080(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequencePlaybackObject_PlaySequencesBySoftReference;

// Function AvalancheSequence.AvaSequencePlaybackObject.PlaySequencesByTag
// 0x00A0 (0x00A0 - 0x0000)
struct AvaSequencePlaybackObject_PlaySequencesByTag final
{
public:
	struct FAvaTagHandle                          InTagHandle;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInExactMatch;                                     // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaSequencePlayParams                 InPlaySettings;                                    // 0x0020(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UAvaSequencePlayer*>             ReturnValue;                                       // 0x0090(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequencePlaybackObject_PlaySequencesByTag;

// Function AvalancheSequence.AvaSequencePlaybackObject.GetAllSequencePlayers
// 0x0010 (0x0010 - 0x0000)
struct AvaSequencePlaybackObject_GetAllSequencePlayers final
{
public:
	TArray<class UAvaSequencePlayer*>             ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequencePlaybackObject_GetAllSequencePlayers;

// Function AvalancheSequence.AvaSequencePlaybackObject.HasActiveSequencePlayers
// 0x0001 (0x0001 - 0x0000)
struct AvaSequencePlaybackObject_HasActiveSequencePlayers final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaSequencePlaybackObject_HasActiveSequencePlayers;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
