#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvalancheMask

#include "Basic.hpp"

#include "AvalancheMask_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "ActorModifier_classes.hpp"
#include "GeometryMask_structs.hpp"
#include "DeveloperSettings_classes.hpp"


SDK_NAMESPACE_START

// Class AvalancheMask.AvaMask2DBaseModifier
// 0x0190 (0x0350 - 0x01C0)
class UAvaMask2DBaseModifier : public UActorModifierArrangeBaseModifier
{
public:
	bool                                          bUseParentChannel;                                 // 0x01C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ParentChannel;                                     // 0x01C4(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   Channel;                                           // 0x01CC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInverted;                                         // 0x01D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseBlur;                                          // 0x01D5(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D6[0x2];                                      // 0x01D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlurStrength;                                      // 0x01D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseFeathering;                                    // 0x01DC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OuterFeatherRadius;                                // 0x01E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         InnerFeatherRadius;                                // 0x01E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UAvaObjectHandleSubsystem> ObjectHandleSubsystem;                           // 0x01E8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UAvaMaskMaterialInstanceSubsystem> MaterialInstanceSubsystem;               // 0x01F0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   AutoChannelName;                                   // 0x01F8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<TWeakObjectPtr<class AActor>, struct FAvaMask2DActorData> ActorData;                        // 0x0200(0x0050)(DuplicateTransient, Protected, NativeAccessSpecifierProtected)
	class FName                                   LastResolvedCanvasName;                            // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UGeometryMaskCanvas>     CanvasWeak;                                        // 0x0258(0x0008)(Edit, ZeroConstructor, Transient, DuplicateTransient, NoClear, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<TWeakObjectPtr<class UObject>, struct FInstancedStruct> MaterialCollectionHandleData;       // 0x0260(0x0050)(DuplicateTransient, Protected, NativeAccessSpecifierProtected)
	TMap<TWeakObjectPtr<class UMaterialInterface>, struct FInstancedStruct> MaterialHandleData;      // 0x02B0(0x0050)(DuplicateTransient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_300[0x50];                                     // 0x0300(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaMask2DBaseModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaMask2DBaseModifier")
	}
	static class UAvaMask2DBaseModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaMask2DBaseModifier>();
	}
};
DUMPER7_ASSERTS_UAvaMask2DBaseModifier;

// Class AvalancheMask.AvaMask2DReadModifier
// 0x0008 (0x0358 - 0x0350)
class UAvaMask2DReadModifier final : public UAvaMask2DBaseModifier
{
public:
	float                                         BaseOpacity;                                       // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaMask2DReadModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaMask2DReadModifier")
	}
	static class UAvaMask2DReadModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaMask2DReadModifier>();
	}
};
DUMPER7_ASSERTS_UAvaMask2DReadModifier;

// Class AvalancheMask.AvaMask2DWriteModifier
// 0x0008 (0x0358 - 0x0350)
class UAvaMask2DWriteModifier final : public UAvaMask2DBaseModifier
{
public:
	EGeometryMaskCompositeOperation               WriteOperation;                                    // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaMask2DWriteModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaMask2DWriteModifier")
	}
	static class UAvaMask2DWriteModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaMask2DWriteModifier>();
	}
};
DUMPER7_ASSERTS_UAvaMask2DWriteModifier;

// Class AvalancheMask.AvaMaskMaterialFactoryBase
// 0x0000 (0x0028 - 0x0028)
class UAvaMaskMaterialFactoryBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaMaskMaterialFactoryBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaMaskMaterialFactoryBase")
	}
	static class UAvaMaskMaterialFactoryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaMaskMaterialFactoryBase>();
	}
};
DUMPER7_ASSERTS_UAvaMaskMaterialFactoryBase;

// Class AvalancheMask.AvaMaskMaterialFactory
// 0x0000 (0x0028 - 0x0028)
class UAvaMaskMaterialFactory final : public UAvaMaskMaterialFactoryBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaMaskMaterialFactory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaMaskMaterialFactory")
	}
	static class UAvaMaskMaterialFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaMaskMaterialFactory>();
	}
};
DUMPER7_ASSERTS_UAvaMaskMaterialFactory;

// Class AvalancheMask.AvaMaskMaterialInstanceConstantFactory
// 0x0000 (0x0028 - 0x0028)
class UAvaMaskMaterialInstanceConstantFactory final : public UAvaMaskMaterialFactoryBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaMaskMaterialInstanceConstantFactory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaMaskMaterialInstanceConstantFactory")
	}
	static class UAvaMaskMaterialInstanceConstantFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaMaskMaterialInstanceConstantFactory>();
	}
};
DUMPER7_ASSERTS_UAvaMaskMaterialInstanceConstantFactory;

// Class AvalancheMask.AvaMaskMaterialInstanceDynamicFactory
// 0x0000 (0x0028 - 0x0028)
class UAvaMaskMaterialInstanceDynamicFactory final : public UAvaMaskMaterialFactoryBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaMaskMaterialInstanceDynamicFactory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaMaskMaterialInstanceDynamicFactory")
	}
	static class UAvaMaskMaterialInstanceDynamicFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaMaskMaterialInstanceDynamicFactory>();
	}
};
DUMPER7_ASSERTS_UAvaMaskMaterialInstanceDynamicFactory;

// Class AvalancheMask.AvaMaskDesignedMaterialFactory
// 0x0000 (0x0028 - 0x0028)
class UAvaMaskDesignedMaterialFactory final : public UAvaMaskMaterialFactoryBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaMaskDesignedMaterialFactory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaMaskDesignedMaterialFactory")
	}
	static class UAvaMaskDesignedMaterialFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaMaskDesignedMaterialFactory>();
	}
};
DUMPER7_ASSERTS_UAvaMaskDesignedMaterialFactory;

// Class AvalancheMask.AvaMaskMaterialInstanceProvider
// 0x00A8 (0x00D0 - 0x0028)
class UAvaMaskMaterialInstanceProvider final : public UObject
{
public:
	TWeakObjectPtr<class UAvaMaskMaterialInstanceProvider> ParentProvider;                           // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class UMaterialInterface>, class UAvaMaskMaterialFactoryBase*> MaterialInstanceFactories; // 0x0030(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TMap<TSoftObjectPtr<class UMaterialInterface>, struct FAvaMaskMaterialPermutations> MaterialInstanceCache; // 0x0080(0x0050)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaMaskMaterialInstanceProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaMaskMaterialInstanceProvider")
	}
	static class UAvaMaskMaterialInstanceProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaMaskMaterialInstanceProvider>();
	}
};
DUMPER7_ASSERTS_UAvaMaskMaterialInstanceProvider;

// Class AvalancheMask.AvaMaskMaterialInstanceWorldSubsystem
// 0x0010 (0x0040 - 0x0030)
class UAvaMaskMaterialInstanceWorldSubsystem final : public UWorldSubsystem
{
public:
	class UAvaMaskMaterialInstanceProvider*       MaterialInstanceProvider;                          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UAvaMaskMaterialInstanceSubsystem*      MaterialInstanceEngineSubsystem;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaMaskMaterialInstanceWorldSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaMaskMaterialInstanceWorldSubsystem")
	}
	static class UAvaMaskMaterialInstanceWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaMaskMaterialInstanceWorldSubsystem>();
	}
};
DUMPER7_ASSERTS_UAvaMaskMaterialInstanceWorldSubsystem;

// Class AvalancheMask.AvaMaskMaterialInstanceSubsystem
// 0x0008 (0x0038 - 0x0030)
class UAvaMaskMaterialInstanceSubsystem final : public UEngineSubsystem
{
public:
	class UAvaMaskMaterialInstanceProvider*       MaterialInstanceProvider;                          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaMaskMaterialInstanceSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaMaskMaterialInstanceSubsystem")
	}
	static class UAvaMaskMaterialInstanceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaMaskMaterialInstanceSubsystem>();
	}
};
DUMPER7_ASSERTS_UAvaMaskMaterialInstanceSubsystem;

// Class AvalancheMask.AvaMaskSettings
// 0x0000 (0x0038 - 0x0038)
class UAvaMaskSettings final : public UDeveloperSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaMaskSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaMaskSettings")
	}
	static class UAvaMaskSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaMaskSettings>();
	}
};
DUMPER7_ASSERTS_UAvaMaskSettings;

// Class AvalancheMask.AvaMaskSubsystem
// 0x0000 (0x0030 - 0x0030)
class UAvaMaskSubsystem final : public UEngineSubsystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaMaskSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaMaskSubsystem")
	}
	static class UAvaMaskSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaMaskSubsystem>();
	}
};
DUMPER7_ASSERTS_UAvaMaskSubsystem;

// Class AvalancheMask.AvaObjectHandleSubsystem
// 0x0010 (0x0040 - 0x0030)
class UAvaObjectHandleSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaObjectHandleSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaObjectHandleSubsystem")
	}
	static class UAvaObjectHandleSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaObjectHandleSubsystem>();
	}
};
DUMPER7_ASSERTS_UAvaObjectHandleSubsystem;

SDK_NAMESPACE_END
