#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvalancheSequence

#include "Basic.hpp"

#include "LevelSequence_classes.hpp"
#include "AvalancheTag_structs.hpp"
#include "AvalancheSequence_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


SDK_NAMESPACE_START

// Class AvalancheSequence.AvaSequence
// 0x00B0 (0x0150 - 0x00A0)
class UAvaSequence final : public ULevelSequence
{
public:
	class FName                                   Label;                                             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UAvaSequence>            ParentAnimation;                                   // 0x00A8(0x0008)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, TextExportTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class UAvaSequence>>    ChildAnimations;                                   // 0x00B0(0x0010)(ZeroConstructor, DuplicateTransient, Protected, TextExportTransient, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FAvaTagHandle                          Tag;                                               // 0x00C0(0x0018)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 PreviewMarkLabel;                                  // 0x00D8(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSet<struct FAvaMark>                         Marks;                                             // 0x00E8(0x0050)(Edit, EditFixedSize, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_138[0x18];                                     // 0x0138(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetLabel(class FName InLabel);
	bool SetMark(const class FString& InMarkLabel, const struct FAvaMark& InMark);

	double GetEndTime() const;
	class FName GetLabel() const;
	bool GetMark(const class FString& InMarkLabel, struct FAvaMark* OutMark) const;
	const TSet<struct FAvaMark> GetMarks() const;
	struct FAvaTagHandle GetSequenceTag() const;
	double GetStartTime() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaSequence")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaSequence")
	}
	static class UAvaSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaSequence>();
	}
};
DUMPER7_ASSERTS_UAvaSequence;

// Class AvalancheSequence.AvaSequenceActor
// 0x0000 (0x0350 - 0x0350)
class AAvaSequenceActor final : public ALevelSequenceActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaSequenceActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaSequenceActor")
	}
	static class AAvaSequenceActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAvaSequenceActor>();
	}
};
DUMPER7_ASSERTS_AAvaSequenceActor;

// Class AvalancheSequence.AvaSequenceDirector
// 0x0018 (0x0060 - 0x0048)
class UAvaSequenceDirector final : public ULevelSequenceDirector
{
public:
	uint8                                         Pad_48[0x18];                                      // 0x0048(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void PlayScheduledSequences();
	void PlaySequencesByLabel(class FName InSequenceLabel, const struct FAvaSequencePlayParams& InPlaySettings);

	TScriptInterface<class IAvaSequencePlaybackObject> GetPlaybackObject() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaSequenceDirector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaSequenceDirector")
	}
	static class UAvaSequenceDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaSequenceDirector>();
	}
};
DUMPER7_ASSERTS_UAvaSequenceDirector;

// Class AvalancheSequence.AvaSequenceDirectorBlueprint
// 0x0010 (0x00B8 - 0x00A8)
class UAvaSequenceDirectorBlueprint final : public UBlueprint
{
public:
	TArray<struct FAvaSequenceInfo>               SequenceInfos;                                     // 0x00A8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaSequenceDirectorBlueprint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaSequenceDirectorBlueprint")
	}
	static class UAvaSequenceDirectorBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaSequenceDirectorBlueprint>();
	}
};
DUMPER7_ASSERTS_UAvaSequenceDirectorBlueprint;

// Class AvalancheSequence.AvaSequenceDirectorGeneratedClass
// 0x0010 (0x0370 - 0x0360)
class UAvaSequenceDirectorGeneratedClass final : public UBlueprintGeneratedClass
{
public:
	TArray<struct FAvaSequenceInfo>               SequenceInfos;                                     // 0x0360(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaSequenceDirectorGeneratedClass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaSequenceDirectorGeneratedClass")
	}
	static class UAvaSequenceDirectorGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaSequenceDirectorGeneratedClass>();
	}
};
DUMPER7_ASSERTS_UAvaSequenceDirectorGeneratedClass;

// Class AvalancheSequence.AvaSequenceLibrary
// 0x0000 (0x0028 - 0x0028)
class UAvaSequenceLibrary final : public UBlueprintFunctionLibrary
{
public:
	static TScriptInterface<class IAvaSequencePlaybackObject> GetPlaybackObject(const class UObject* InWorldContextObject);
	static struct FAvaSequencePlayParams MakeSingleFramePlaySettings(const struct FAvaSequenceTime& InTargetTime, EAvaSequencePlayMode InPlayMode);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaSequenceLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaSequenceLibrary")
	}
	static class UAvaSequenceLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaSequenceLibrary>();
	}
};
DUMPER7_ASSERTS_UAvaSequenceLibrary;

// Class AvalancheSequence.AvaSequencePlaybackActor
// 0x0168 (0x0410 - 0x02A8)
class AAvaSequencePlaybackActor final : public AActor
{
public:
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ScheduledSequenceNames;                            // 0x02B0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FAvaSequencePlayParams                 ScheduledPlaySettings;                             // 0x02C0(0x0070)(Edit, NativeAccessSpecifierPrivate)
	TSet<class UAvaSequencePlayer*>               ActiveSequencePlayers;                             // 0x0330(0x0050)(Transient, DuplicateTransient, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TSet<class UAvaSequencePlayer*>               StoppedSequencePlayers;                            // 0x0380(0x0050)(Transient, DuplicateTransient, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TScriptInterface<class IAvaSequenceProvider>  SequenceProvider;                                  // 0x03D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E0[0x30];                                     // 0x03E0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_PlayScheduledSequences();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaSequencePlaybackActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaSequencePlaybackActor")
	}
	static class AAvaSequencePlaybackActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAvaSequencePlaybackActor>();
	}
};
DUMPER7_ASSERTS_AAvaSequencePlaybackActor;

// Class AvalancheSequence.AvaSequencePlaybackObject
// 0x0000 (0x0000 - 0x0000)
class IAvaSequencePlaybackObject final
{
public:
	TArray<class UAvaSequencePlayer*> ContinueSequencesByLabel(class FName InSequenceLabel);
	TArray<class UAvaSequencePlayer*> ContinueSequencesByLabels(const TArray<class FName>& InSequenceLabels);
	TArray<class UAvaSequencePlayer*> ContinueSequencesByTag(const struct FAvaTagHandle& InTagHandle, bool bInExactMatch);
	TArray<class UAvaSequencePlayer*> PlayScheduledSequences();
	class UAvaSequencePlayer* PlaySequenceBySoftReference(TSoftObjectPtr<class UAvaSequence> InSequence, const struct FAvaSequencePlayParams& InPlaySettings);
	TArray<class UAvaSequencePlayer*> PlaySequencesByLabel(class FName InSequenceLabel, const struct FAvaSequencePlayParams& InPlaySettings);
	TArray<class UAvaSequencePlayer*> PlaySequencesByLabels(const TArray<class FName>& InSequenceLabels, const struct FAvaSequencePlayParams& InPlaySettings);
	TArray<class UAvaSequencePlayer*> PlaySequencesBySoftReference(const TArray<TSoftObjectPtr<class UAvaSequence>>& InSequences, const struct FAvaSequencePlayParams& InPlaySettings);
	TArray<class UAvaSequencePlayer*> PlaySequencesByTag(const struct FAvaTagHandle& InTagHandle, bool bInExactMatch, const struct FAvaSequencePlayParams& InPlaySettings);

	TArray<class UAvaSequencePlayer*> GetAllSequencePlayers() const;
	bool HasActiveSequencePlayers() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaSequencePlaybackObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaSequencePlaybackObject")
	}
	static class IAvaSequencePlaybackObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAvaSequencePlaybackObject>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAvaSequencePlaybackObject;

// Class AvalancheSequence.AvaSequencePlayer
// 0x0028 (0x05B0 - 0x0588)
class UAvaSequencePlayer final : public ULevelSequencePlayer
{
public:
	uint8                                         Pad_588[0x28];                                     // 0x0588(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void NotifySequencePaused();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaSequencePlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaSequencePlayer")
	}
	static class UAvaSequencePlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaSequencePlayer>();
	}
};
DUMPER7_ASSERTS_UAvaSequencePlayer;

// Class AvalancheSequence.AvaSequenceSubsystem
// 0x0060 (0x0090 - 0x0030)
class UAvaSequenceSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x60];                                      // 0x0030(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaSequenceSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaSequenceSubsystem")
	}
	static class UAvaSequenceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaSequenceSubsystem>();
	}
};
DUMPER7_ASSERTS_UAvaSequenceSubsystem;

// Class AvalancheSequence.AvaSequenceProvider
// 0x0000 (0x0000 - 0x0000)
class IAvaSequenceProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaSequenceProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaSequenceProvider")
	}
	static class IAvaSequenceProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAvaSequenceProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAvaSequenceProvider;

SDK_NAMESPACE_END
