#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvalancheTransition

#include "Basic.hpp"

#include "AvalancheTransition_structs.hpp"
#include "AvalancheTag_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function AvalancheTransition.AvaTransitionLibrary.AreScenesTransitioning
// 0x0038 (0x0038 - 0x0000)
struct AvaTransitionLibrary_AreScenesTransitioning final
{
public:
	class UObject*                                InTransitionNode;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAvaTagHandleContainer                 InLayers;                                          // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UWorld>>          InScenesToIgnore;                                  // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AvaTransitionLibrary_AreScenesTransitioning;

// Function AvalancheTransition.AvaTransitionLibrary.GetTransitionTree
// 0x0010 (0x0010 - 0x0000)
struct AvaTransitionLibrary_GetTransitionTree final
{
public:
	class UObject*                                InTransitionNode;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UAvaTransitionTree*               ReturnValue;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaTransitionLibrary_GetTransitionTree;

// Function AvalancheTransition.AvaTransitionLibrary.GetTransitionType
// 0x0010 (0x0010 - 0x0000)
struct AvaTransitionLibrary_GetTransitionType final
{
public:
	class UObject*                                InTransitionNode;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAvaTransitionType                            ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AvaTransitionLibrary_GetTransitionType;

// Function AvalancheTransition.AvaTransitionLibrary.IsTransitionActiveInLayer
// 0x0030 (0x0030 - 0x0000)
struct AvaTransitionLibrary_IsTransitionActiveInLayer final
{
public:
	class UObject*                                InTransitionNode;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAvaTransitionComparisonResult                InSceneComparisonType;                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAvaTransitionLayerCompareType                InLayerComparisonType;                             // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaTagHandleContainer                 InSpecificLayers;                                  // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AvaTransitionLibrary_IsTransitionActiveInLayer;

// Function AvalancheTransition.AvaTransitionTree.GetInstancingMode
// 0x0001 (0x0001 - 0x0000)
struct AvaTransitionTree_GetInstancingMode final
{
public:
	EAvaTransitionInstancingMode                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AvaTransitionTree_GetInstancingMode;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
