#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvalancheSequence

#include "Basic.hpp"

#include "AvalancheTag_structs.hpp"
#include "AvalancheTransition_structs.hpp"


SDK_NAMESPACE_START

// Enum AvalancheSequence.EAvaMarkRole
// NumValues: 0x0006
enum class EAvaMarkRole : uint8
{
	None                                     = 0,
	Stop                                     = 1,
	Pause                                    = 2,
	Jump                                     = 3,
	Reverse                                  = 4,
	EAvaMarkRole_MAX                         = 5,
};

// Enum AvalancheSequence.EAvaMarkDirection
// NumValues: 0x0004
enum class EAvaMarkDirection : uint8
{
	Both                                     = 0,
	Forwards                                 = 1,
	Backwards                                = 2,
	EAvaMarkDirection_MAX                    = 3,
};

// Enum AvalancheSequence.EAvaMarkSearchDirection
// NumValues: 0x0006
enum class EAvaMarkSearchDirection : uint8
{
	All                                      = 0,
	SameDirection                            = 1,
	OppositeDirection                        = 2,
	AbsoluteForwards                         = 3,
	AbsoluteBackwards                        = 4,
	EAvaMarkSearchDirection_MAX              = 5,
};

// Enum AvalancheSequence.EAvaSequencePlayMode
// NumValues: 0x0003
enum class EAvaSequencePlayMode : uint8
{
	Forward                                  = 0,
	Reverse                                  = 1,
	EAvaSequencePlayMode_MAX                 = 2,
};

// Enum AvalancheSequence.EAvaSequenceTimeType
// NumValues: 0x0005
enum class EAvaSequenceTimeType : uint8
{
	None                                     = 0,
	Frame                                    = 1,
	Seconds                                  = 2,
	Mark                                     = 3,
	EAvaSequenceTimeType_MAX                 = 4,
};

// Enum AvalancheSequence.EAvaTransitionSequenceWaitType
// NumValues: 0x0004
enum class EAvaTransitionSequenceWaitType : uint8
{
	None                                     = 0,
	NoWait                                   = 1,
	WaitUntilStop                            = 2,
	EAvaTransitionSequenceWaitType_MAX       = 3,
};

// Enum AvalancheSequence.EAvaTransitionSequenceQueryType
// NumValues: 0x0004
enum class EAvaTransitionSequenceQueryType : uint8
{
	None                                     = 0,
	Name                                     = 1,
	Tag                                      = 2,
	EAvaTransitionSequenceQueryType_MAX      = 3,
};

// ScriptStruct AvalancheSequence.AvaMark
// 0x0048 (0x0048 - 0x0000)
struct FAvaMark final
{
public:
	class FString                                 Label;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EAvaMarkDirection                             Direction;                                         // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAvaMarkRole                                  Role;                                              // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLocalMark;                                      // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLimitPlayCountEnabled;                            // 0x0013(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LimitPlayCount;                                    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PauseTime;                                         // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 JumpLabel;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAvaMarkSearchDirection                       SearchDirection;                                   // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Frames;                                            // 0x0038(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaMark;

// ScriptStruct AvalancheSequence.AvaSequenceInfo
// 0x0030 (0x0030 - 0x0000)
struct FAvaSequenceInfo final
{
public:
	class FName                                   SequenceName;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAvaSequence>            Sequence;                                          // 0x0008(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaSequenceInfo;

// ScriptStruct AvalancheSequence.AvaSequenceName
// 0x0008 (0x0008 - 0x0000)
struct FAvaSequenceName final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaSequenceName;

// ScriptStruct AvalancheSequence.AvaSequenceTime
// 0x0030 (0x0030 - 0x0000)
struct FAvaSequenceTime final
{
public:
	EAvaSequenceTimeType                          TimeType;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Frame;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        SubFrame;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Seconds;                                           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MarkLabel;                                         // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasTimeConstraint;                                // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaSequenceTime;

// ScriptStruct AvalancheSequence.AvaSequencePlayAdvancedSettings
// 0x000C (0x000C - 0x0000)
struct FAvaSequencePlayAdvancedSettings final
{
public:
	int32                                         LoopCount;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlaybackSpeed;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRestoreState;                                     // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaSequencePlayAdvancedSettings;

// ScriptStruct AvalancheSequence.AvaSequencePlayParams
// 0x0070 (0x0070 - 0x0000)
struct FAvaSequencePlayParams final
{
public:
	struct FAvaSequenceTime                       Start;                                             // 0x0000(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FAvaSequenceTime                       End;                                               // 0x0030(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EAvaSequencePlayMode                          PlayMode;                                          // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaSequencePlayAdvancedSettings       AdvancedSettings;                                  // 0x0064(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaSequencePlayParams;

// ScriptStruct AvalancheSequence.AvaTransitionSequenceTaskBase
// 0x0030 (0x0068 - 0x0038)
struct FAvaTransitionSequenceTaskBase : public FAvaTransitionTask
{
public:
	EAvaTransitionSequenceQueryType               QueryType;                                         // 0x0038(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SequenceName;                                      // 0x003C(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaTagHandle                          SequenceTag;                                       // 0x0048(0x0018)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionSequenceTaskBase;

// ScriptStruct AvalancheSequence.AvaTransitionSequenceTask
// 0x0008 (0x0070 - 0x0068)
struct FAvaTransitionSequenceTask : public FAvaTransitionSequenceTaskBase
{
public:
	EAvaTransitionSequenceWaitType                WaitType;                                          // 0x0068(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionSequenceTask;

// ScriptStruct AvalancheSequence.AvaTransitionContinueSequenceTask
// 0x0000 (0x0070 - 0x0070)
struct FAvaTransitionContinueSequenceTask final : public FAvaTransitionSequenceTask
{
};
DUMPER7_ASSERTS_FAvaTransitionContinueSequenceTask;

// ScriptStruct AvalancheSequence.AvaTransitionSequenceInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FAvaTransitionSequenceInstanceData
{
public:
	TArray<TWeakObjectPtr<class UAvaSequence>>    ActiveSequences;                                   // 0x0000(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaTransitionSequenceInstanceData;

// ScriptStruct AvalancheSequence.AvaTransitionSequenceTaskBaseInstanceData
// 0x0030 (0x0040 - 0x0010)
struct FAvaTransitionSequenceTaskBaseInstanceData : public FAvaTransitionSequenceInstanceData
{
public:
	EAvaTransitionSequenceQueryType               QueryType;                                         // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaSequenceName                       SequenceName;                                      // 0x0014(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaTagHandle                          SequenceTag;                                       // 0x0020(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPerformExactMatch;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionSequenceTaskBaseInstanceData;

// ScriptStruct AvalancheSequence.AvaTransitionInitSequenceTaskInstanceData
// 0x0038 (0x0078 - 0x0040)
struct FAvaTransitionInitSequenceTaskInstanceData final : public FAvaTransitionSequenceTaskBaseInstanceData
{
public:
	struct FAvaSequenceTime                       InitializeTime;                                    // 0x0040(0x0030)(Edit, NativeAccessSpecifierPublic)
	EAvaSequencePlayMode                          PlayMode;                                          // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionInitSequenceTaskInstanceData;

// ScriptStruct AvalancheSequence.AvaTransitionInitializeSequence
// 0x0038 (0x00A0 - 0x0068)
struct FAvaTransitionInitializeSequence final : public FAvaTransitionSequenceTaskBase
{
public:
	struct FAvaSequenceTime                       InitializeTime;                                    // 0x0068(0x0030)(Deprecated, NativeAccessSpecifierPublic)
	EAvaSequencePlayMode                          PlayMode;                                          // 0x0098(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionInitializeSequence;

// ScriptStruct AvalancheSequence.AvaTransitionSequenceTaskInstanceData
// 0x0008 (0x0048 - 0x0040)
struct FAvaTransitionSequenceTaskInstanceData : public FAvaTransitionSequenceTaskBaseInstanceData
{
public:
	EAvaTransitionSequenceWaitType                WaitType;                                          // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionSequenceTaskInstanceData;

// ScriptStruct AvalancheSequence.AvaTransitionPlaySequenceTaskInstanceData
// 0x0070 (0x00B8 - 0x0048)
struct FAvaTransitionPlaySequenceTaskInstanceData final : public FAvaTransitionSequenceTaskInstanceData
{
public:
	struct FAvaSequencePlayParams                 PlaySettings;                                      // 0x0048(0x0070)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaTransitionPlaySequenceTaskInstanceData;

// ScriptStruct AvalancheSequence.AvaTransitionPlaySequenceTask
// 0x0070 (0x00E0 - 0x0070)
struct FAvaTransitionPlaySequenceTask final : public FAvaTransitionSequenceTask
{
public:
	struct FAvaSequencePlayParams                 PlaySettings;                                      // 0x0070(0x0070)(Deprecated, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaTransitionPlaySequenceTask;

// ScriptStruct AvalancheSequence.AvaTransitionWaitForAllSequencesTask
// 0x0008 (0x0040 - 0x0038)
struct FAvaTransitionWaitForAllSequencesTask final : public FAvaTransitionTask
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaTransitionWaitForAllSequencesTask;

// ScriptStruct AvalancheSequence.AvaTransitionWaitForSequenceTask
// 0x0000 (0x0070 - 0x0070)
struct FAvaTransitionWaitForSequenceTask final : public FAvaTransitionSequenceTask
{
};
DUMPER7_ASSERTS_FAvaTransitionWaitForSequenceTask;

SDK_NAMESPACE_END
