#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvalancheShapes

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Avalanche_structs.hpp"
#include "MovieScene_structs.hpp"


SDK_NAMESPACE_START

// Enum AvalancheShapes.EAvaShapeParametricMaterialTranslucency
// NumValues: 0x0004
enum class EAvaShapeParametricMaterialTranslucency : uint8
{
	Auto                                     = 0,
	Disabled                                 = 1,
	Enabled                                  = 2,
	EAvaShapeParametricMaterialTranslucency_MAX = 3,
};

// Enum AvalancheShapes.EAvaShapeUVMode
// NumValues: 0x0003
enum class EAvaShapeUVMode : uint8
{
	Stretch                                  = 0,
	Uniform                                  = 1,
	EAvaShapeUVMode_MAX                      = 2,
};

// Enum AvalancheShapes.EAvaShapeCornerType
// NumValues: 0x0004
enum class EAvaShapeCornerType : uint8
{
	Point                                    = 0,
	CurveIn                                  = 1,
	CurveOut                                 = 2,
	EAvaShapeCornerType_MAX                  = 3,
};

// Enum AvalancheShapes.EAvaShapeParametricMaterialStyle
// NumValues: 0x0004
enum class EAvaShapeParametricMaterialStyle : uint8
{
	Solid                                    = 0,
	LinearGradient                           = 1,
	Texture                                  = 2,
	EAvaShapeParametricMaterialStyle_MAX     = 3,
};

// Enum AvalancheShapes.EMaterialType
// NumValues: 0x0005
enum class EMaterialType : uint8
{
	Asset                                    = 0,
	Parametric                               = 1,
	MaterialDesigner                         = 2,
	Default                                  = 0,
	EMaterialType_MAX                        = 3,
};

// Enum AvalancheShapes.ESizeType
// NumValues: 0x0003
enum class ESizeType : uint8
{
	UnrealUnit                               = 0,
	Pixel                                    = 1,
	ESizeType_MAX                            = 2,
};

// ScriptStruct AvalancheShapes.AvaShapeRoundedCornerSettings
// 0x0008 (0x0008 - 0x0000)
struct FAvaShapeRoundedCornerSettings final
{
public:
	float                                         BevelSize;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         BevelSubdivisions;                                 // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaShapeRoundedCornerSettings;

// ScriptStruct AvalancheShapes.AvaShapeRoundedCorner
// 0x0088 (0x0088 - 0x0000)
struct FAvaShapeRoundedCorner final
{
public:
	struct FVector2D                              Location;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAvaShapeRoundedCornerSettings         Settings;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, DisableEditOnTemplate, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x70];                                      // 0x0018(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaShapeRoundedCorner;

// ScriptStruct AvalancheShapes.AvaShapeMesh
// 0x00B8 (0x00B8 - 0x0000)
struct alignas(0x08) FAvaShapeMesh final
{
public:
	uint8                                         Pad_0[0xB0];                                       // 0x0000(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MeshIndex;                                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaShapeMesh;

// ScriptStruct AvalancheShapes.AvaShapeParametricMaterial
// 0x0068 (0x0068 - 0x0000)
struct FAvaShapeParametricMaterial final
{
public:
	EAvaShapeParametricMaterialStyle              Style;                                             // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Texture;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	struct FLinearColor                           ColorA;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           ColorB;                                            // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GradientOffset;                                    // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GradientRotation;                                  // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseUnlitMaterial;                                 // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseTwoSidedMaterial;                              // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAvaShapeParametricMaterialTranslucency       Translucency;                                      // 0x003A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             DefaultMaterials;                                  // 0x0040(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<class UMaterialInstanceDynamic*>       InstanceMaterials;                                 // 0x0050(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaShapeParametricMaterial;

// ScriptStruct AvalancheShapes.AvaShapeMaterialUVParameters
// 0x0040 (0x0040 - 0x0000)
struct FAvaShapeMaterialUVParameters final
{
public:
	EAvaShapeUVMode                               Mode;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAvaAnchors                                   AnchorPreset;                                      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Anchor;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              Scale;                                             // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              Offset;                                            // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Rotation;                                          // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFlipHorizontal;                                   // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFlipVertical;                                     // 0x003D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaShapeMaterialUVParameters;

// ScriptStruct AvalancheShapes.AvaShapeMeshData
// 0x0190 (0x0190 - 0x0000)
struct FAvaShapeMeshData final
{
public:
	bool                                          bMeshVisible;                                      // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUsesPrimaryMaterialParams;                        // 0x0001(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMaterialType                                 MaterialType;                                      // 0x0002(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	struct FAvaShapeParametricMaterial            ParametricMaterial;                                // 0x0010(0x0068)(Edit, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	bool                                          bOverridePrimaryUVParams;                          // 0x0078(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaShapeMaterialUVParameters          MaterialUVParams;                                  // 0x0080(0x0040)(Edit, DisableEditOnTemplate, NoDestructor, Protected, NativeAccessSpecifierProtected)
	int32                                         MeshIndex;                                         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   MeshName;                                          // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaShapeMesh                          Mesh;                                              // 0x00D0(0x00B8)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAvaShapeMeshData;

// ScriptStruct AvalancheShapes.AvaShapeRectangleCornerSettings
// 0x0020 (0x0020 - 0x0000)
struct FAvaShapeRectangleCornerSettings final
{
public:
	EAvaShapeCornerType                           Type;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BevelSize;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         BevelSubdivisions;                                 // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CornerPositionCache;                               // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAvaShapeRectangleCornerSettings;

// ScriptStruct AvalancheShapes.MovieSceneAvaShapeRectCornerSectionTemplate
// 0x0338 (0x0370 - 0x0038)
struct FMovieSceneAvaShapeRectCornerSectionTemplate final : public FMovieScenePropertySectionTemplate
{
public:
	struct FMovieSceneFloatChannel                BevelSize;                                         // 0x0038(0x0110)(NativeAccessSpecifierPrivate)
	struct FMovieSceneByteChannel                 BevelSubdivisions;                                 // 0x0148(0x0110)(NativeAccessSpecifierPrivate)
	struct FMovieSceneByteChannel                 Type;                                              // 0x0258(0x0110)(NativeAccessSpecifierPrivate)
	EMovieSceneBlendType                          BlendType;                                         // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneAvaShapeRectCornerSectionTemplate;

SDK_NAMESPACE_END
