#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Avalanche

#include "Basic.hpp"

#include "CinematicCamera_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Avalanche_structs.hpp"
#include "AvalancheTransition_structs.hpp"
#include "AvalancheSceneTree_structs.hpp"


SDK_NAMESPACE_START

// Class Avalanche.AvaCineCameraActor
// 0x0000 (0x0AB0 - 0x0AB0)
class AAvaCineCameraActor final : public ACineCameraActor
{
public:
	float                                         DefaultCameraDistance;                             // 0x0AA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AAC[0x4];                                      // 0x0AAC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaCineCameraActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaCineCameraActor")
	}
	static class AAvaCineCameraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAvaCineCameraActor>();
	}
};
DUMPER7_ASSERTS_AAvaCineCameraActor;

// Class Avalanche.AvaGameInstance
// 0x0058 (0x0218 - 0x01C0)
class UAvaGameInstance final : public UGameInstance
{
public:
	class UWorld*                                 PlayWorld;                                         // 0x01C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class ULocalPlayer*                           LocalPlayer;                                       // 0x01C8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UAvaGameViewportClient*                 ViewportClient;                                    // 0x01D0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_1D8[0x40];                                     // 0x01D8(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaGameInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaGameInstance")
	}
	static class UAvaGameInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaGameInstance>();
	}
};
DUMPER7_ASSERTS_UAvaGameInstance;

// Class Avalanche.AvaGameViewportClient
// 0x0018 (0x03D8 - 0x03C0)
class UAvaGameViewportClient final : public UGameViewportClient
{
public:
	uint8                                         Pad_3C0[0x18];                                     // 0x03C0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaGameViewportClient")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaGameViewportClient")
	}
	static class UAvaGameViewportClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaGameViewportClient>();
	}
};
DUMPER7_ASSERTS_UAvaGameViewportClient;

// Class Avalanche.AvaGizmoComponent
// 0x0090 (0x0148 - 0x00B8)
class UAvaGizmoComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsGizmoEnabled;                                   // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAreGizmoValuesApplied;                            // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bApplyToChildActors;                               // 0x00C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	bool                                          bCastShadow;                                       // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsVisibleInEditor;                                // 0x00D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsHiddenInGame;                                   // 0x00D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRenderInMainPass;                                 // 0x00D3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRenderDepth;                                      // 0x00D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDrawWireframe;                                    // 0x00D5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           WireframeColor;                                    // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSetStencil;                                       // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         StencilId;                                         // 0x00E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FSoftComponentReference, struct FAvaGizmoComponentPrimitiveValues> ComponentValues;  // 0x00F0(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_140[0x8];                                      // 0x0140(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaGizmoComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaGizmoComponent")
	}
	static class UAvaGizmoComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaGizmoComponent>();
	}
};
DUMPER7_ASSERTS_UAvaGizmoComponent;

// Class Avalanche.AvaNullActor
// 0x0008 (0x02B0 - 0x02A8)
class AAvaNullActor final : public AActor
{
public:
	class UAvaNullComponent*                      NullComponent;                                     // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaNullActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaNullActor")
	}
	static class AAvaNullActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAvaNullActor>();
	}
};
DUMPER7_ASSERTS_AAvaNullActor;

// Class Avalanche.AvaNullComponent
// 0x0000 (0x0240 - 0x0240)
class UAvaNullComponent final : public USceneComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaNullComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaNullComponent")
	}
	static class UAvaNullComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaNullComponent>();
	}
};
DUMPER7_ASSERTS_UAvaNullComponent;

// Class Avalanche.AvaPostProcessVolume
// 0x0000 (0x0A60 - 0x0A60)
class AAvaPostProcessVolume final : public APostProcessVolume
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaPostProcessVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaPostProcessVolume")
	}
	static class AAvaPostProcessVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAvaPostProcessVolume>();
	}
};
DUMPER7_ASSERTS_AAvaPostProcessVolume;

// Class Avalanche.AvaScene
// 0x0108 (0x03B0 - 0x02A8)
class AAvaScene final : public AActor
{
public:
	uint8                                         Pad_2A8[0x18];                                     // 0x02A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaSceneTree                          SceneTree;                                         // 0x02C0(0x0088)(Protected, NativeAccessSpecifierProtected)
	class UAvaSceneSettings*                      SceneSettings;                                     // 0x0348(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UAvaSceneState*                         SceneState;                                        // 0x0350(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class URemoteControlPreset*                   RemoteControlPreset;                               // 0x0358(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<class UAvaSequence*>                   Animations;                                        // 0x0360(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	TScriptInterface<class IAvaSequencePlaybackObject> PlaybackObject;                               // 0x0370(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class UAvaSequence>>    RootAnimations;                                    // 0x0380(0x0010)(ZeroConstructor, Transient, DuplicateTransient, Protected, TextExportTransient, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_390[0x18];                                     // 0x0390(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DefaultSequenceIndex;                              // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaScene")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaScene")
	}
	static class AAvaScene* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAvaScene>();
	}
};
DUMPER7_ASSERTS_AAvaScene;

// Class Avalanche.AvaSceneSettings
// 0x0030 (0x0058 - 0x0028)
class UAvaSceneSettings final : public UObject
{
public:
	TArray<class UAvaAttribute*>                  SceneAttributes;                                   // 0x0028(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	struct FSoftObjectPath                        SceneRig;                                          // 0x0038(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaSceneSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaSceneSettings")
	}
	static class UAvaSceneSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaSceneSettings>();
	}
};
DUMPER7_ASSERTS_UAvaSceneSettings;

// Class Avalanche.AvaSceneState
// 0x0010 (0x0038 - 0x0028)
class UAvaSceneState final : public UObject
{
public:
	TArray<class UAvaAttribute*>                  SceneAttributes;                                   // 0x0028(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaSceneState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaSceneState")
	}
	static class UAvaSceneState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaSceneState>();
	}
};
DUMPER7_ASSERTS_UAvaSceneState;

// Class Avalanche.AvaSceneSubsystem
// 0x0050 (0x0080 - 0x0030)
class UAvaSceneSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaSceneSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaSceneSubsystem")
	}
	static class UAvaSceneSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaSceneSubsystem>();
	}
};
DUMPER7_ASSERTS_UAvaSceneSubsystem;

// Class Avalanche.AvaSplineActor
// 0x0008 (0x02B0 - 0x02A8)
class AAvaSplineActor final : public AActor
{
public:
	class USplineComponent*                       SplineComponent;                                   // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaSplineActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaSplineActor")
	}
	static class AAvaSplineActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAvaSplineActor>();
	}
};
DUMPER7_ASSERTS_AAvaSplineActor;

// Class Avalanche.AvaTestDynamicMeshActor
// 0x0008 (0x02B0 - 0x02A8)
class AAvaTestDynamicMeshActor final : public AActor
{
public:
	class UDynamicMeshComponent*                  ShapeDynamicMeshComponent;                         // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaTestDynamicMeshActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaTestDynamicMeshActor")
	}
	static class AAvaTestDynamicMeshActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAvaTestDynamicMeshActor>();
	}
};
DUMPER7_ASSERTS_AAvaTestDynamicMeshActor;

// Class Avalanche.AvaTestStaticMeshActor
// 0x0018 (0x02C0 - 0x02A8)
class AAvaTestStaticMeshActor final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_2B0[0x10];                                     // 0x02B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaTestStaticMeshActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaTestStaticMeshActor")
	}
	static class AAvaTestStaticMeshActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAvaTestStaticMeshActor>();
	}
};
DUMPER7_ASSERTS_AAvaTestStaticMeshActor;

// Class Avalanche.AvaTransitionAttributeLibrary
// 0x0000 (0x0028 - 0x0028)
class UAvaTransitionAttributeLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool AddNameAttribute(class UObject* InTransitionNode, class FName InName);
	static bool AddTagAttribute(class UObject* InTransitionNode, const struct FAvaTagHandle& InTagHandle);
	static bool ContainsNameAttribute(class UObject* InTransitionNode, class FName InName);
	static bool ContainsTagAttribute(class UObject* InTransitionNode, const struct FAvaTagHandle& InTagHandle);
	static bool RemoveNameAttribute(class UObject* InTransitionNode, class FName InName);
	static bool RemoveTagAttribute(class UObject* InTransitionNode, const struct FAvaTagHandle& InTagHandle);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaTransitionAttributeLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaTransitionAttributeLibrary")
	}
	static class UAvaTransitionAttributeLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaTransitionAttributeLibrary>();
	}
};
DUMPER7_ASSERTS_UAvaTransitionAttributeLibrary;

// Class Avalanche.AvaTransitionRCLibrary
// 0x0000 (0x0028 - 0x0028)
class UAvaTransitionRCLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool CompareRCControllerValues(class UObject* InTransitionNode, const struct FAvaRCControllerId& InControllerId, EAvaTransitionComparisonResult InValueComparisonType);
	static TArray<class URCVirtualPropertyBase*> GetChangedRCControllers(class UObject* InTransitionNode);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaTransitionRCLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaTransitionRCLibrary")
	}
	static class UAvaTransitionRCLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaTransitionRCLibrary>();
	}
};
DUMPER7_ASSERTS_UAvaTransitionRCLibrary;

// Class Avalanche.AvaGizmoObjectInterface
// 0x0000 (0x0000 - 0x0000)
class IAvaGizmoObjectInterface final
{
public:
	void ToggleGizmo(const class UAvaGizmoComponent* InGizmoComponent, const bool bShowAsGizmo);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaGizmoObjectInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaGizmoObjectInterface")
	}
	static class IAvaGizmoObjectInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAvaGizmoObjectInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAvaGizmoObjectInterface;

// Class Avalanche.AvaSceneInterface
// 0x0000 (0x0000 - 0x0000)
class IAvaSceneInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaSceneInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaSceneInterface")
	}
	static class IAvaSceneInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAvaSceneInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAvaSceneInterface;

// Class Avalanche.AvaSnapPointGenerator
// 0x0000 (0x0000 - 0x0000)
class IAvaSnapPointGenerator final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaSnapPointGenerator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaSnapPointGenerator")
	}
	static class IAvaSnapPointGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAvaSnapPointGenerator>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAvaSnapPointGenerator;

SDK_NAMESPACE_END
