#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvalancheText

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Text3D_classes.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// Class AvalancheText.AvaFontObject
// 0x0068 (0x0090 - 0x0028)
class UAvaFontObject final : public UObject
{
public:
	class UFont*                                  Font;                                              // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FontName;                                          // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaFontObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaFontObject")
	}
	static class UAvaFontObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaFontObject>();
	}
};
DUMPER7_ASSERTS_UAvaFontObject;

// Class AvalancheText.AvaText3DComponent
// 0x0000 (0x0350 - 0x0350)
class UAvaText3DComponent final : public UText3DComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaText3DComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaText3DComponent")
	}
	static class UAvaText3DComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvaText3DComponent>();
	}
};
DUMPER7_ASSERTS_UAvaText3DComponent;

// Class AvalancheText.AvaTextActor
// 0x0010 (0x02B8 - 0x02A8)
class AAvaTextActor final : public AActor
{
public:
	class UText3DComponent*                       Text3DComponent;                                   // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UText3DCharacterTransform*              Text3DCharacterTransform;                          // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AvaTextActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AvaTextActor")
	}
	static class AAvaTextActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAvaTextActor>();
	}
};
DUMPER7_ASSERTS_AAvaTextActor;

SDK_NAMESPACE_END
