#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimatedMeshOnSpline

#include "Basic.hpp"

#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AnimatedMeshOnSpline.BP_AnimatedMeshOnSpline_C
// 0x0038 (0x02E0 - 0x02A8)
class ABP_AnimatedMeshOnSpline_C final : public AActor
{
public:
	class UStaticMeshComponent*                   box4;                                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   box3;                                              // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Box2;                                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Box1;                                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AnimatedMesh;                                      // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    MeshOptions;                                       // 0x02D0(0x0010)(Edit, BlueprintVisible)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AnimatedMeshOnSpline_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AnimatedMeshOnSpline_C")
	}
	static class ABP_AnimatedMeshOnSpline_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AnimatedMeshOnSpline_C>();
	}
};
DUMPER7_ASSERTS_ABP_AnimatedMeshOnSpline_C;

SDK_NAMESPACE_END
