#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Blink

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_BaseTank_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_Blink.BP_Blink_C
// 0x0060 (0x0C88 - 0x0C28)
class ABP_Blink_C final : public ABP_BaseTank_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Blink_C;                         // 0x0C28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          WingCollider;                                      // 0x0C30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BlinkAbilitySecondaryCollider;                     // 0x0C38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BlinkAbilityPrimaryCollider;                       // 0x0C40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FXS_EngineHover;                                   // 0x0C48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ModuleTurretComponent_C*           ModuleTurretComponent;                             // 0x0C50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ModuleFireComponent_C*             ModuleFireComponent;                               // 0x0C58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FXS_Contrail_Right;                                // 0x0C60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FXS_Contrail_Left;                                 // 0x0C68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ModuleEngineComponent_C*           ModuleEngineComponent;                             // 0x0C70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ModuleAbilityComponent_C*          ModuleAbilityComponent;                            // 0x0C78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RawSteering;                                       // 0x0C80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Blink_WingCollider_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ExecuteUbergraph_BP_Blink(int32 EntryPoint);
	void GetTankArmorMesh(class USkeletalMeshComponent** ArmorMesh_0);
	void GetTankPhysicsMesh(class USkeletalMeshComponent** PhysicsMesh_0);
	void GetTankTurretComp(class UBPC_TurretBaseComponent_C** TurretComp);
	void GetTankVisualMesh(class USkeletalMeshComponent** VisualMesh_0);
	void GetTurretComponent(class UBPC_TurretBaseComponent_C** OutTurretComponent);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Blink_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Blink_C")
	}
	static class ABP_Blink_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Blink_C>();
	}
};
DUMPER7_ASSERTS_ABP_Blink_C;

SDK_NAMESPACE_END
