#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CameraSwapMessage

#include "Basic.hpp"

#include "E_GameCameraRig_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct BP_CameraSwapMessage.BP_CameraSwapMessage
// 0x0010 (0x0010 - 0x0000)
struct FBP_CameraSwapMessage final
{
public:
	bool                                          bIsSniper_14_6FFEFCE047644FC1029C53AE38CDDB0C;     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GameCameraRig                               CameraRig_13_C05213F843DFF5BE7451C9B3304D86B4;     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ZoomLevel_9_AA147AA94E98531AA1A1FA9CF09E13A9;      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  LocalPawn_6_3394A6BE4BAF78F6D666A6A7CDBF6376;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FBP_CameraSwapMessage;

SDK_NAMESPACE_END
