#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EndGameStats

#include "Basic.hpp"

#include "E_MatchEndCondition_structs.hpp"
#include "BP_PlayerMatchStats_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct BP_EndGameStats.BP_EndGameStats
// 0x0050 (0x0050 - 0x0000)
struct FBP_EndGameStats final
{
public:
	int32                                         WinningTeamIndex_24_09A065404DAD4AF809ED16A8019BAA67; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalPlayerTeamId_30_893C792B4DF18FCC56C6CF8D885CE20B; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 MapName_33_9FF6967C43620BC9810345B83C22B032;       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         MatchLength_4_5A5FF06C436E5E279EAC0AA58EF744D9;    // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MatchEndCondition                           MatchEndCondition_8_0E717E454E53843400A22C8BA00F831E; // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 KillsPerTeam_34_6A69BDE74B16C118274817A1D94606BA;  // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<struct FBP_PlayerMatchStats>           PlayerStats_22_08ABB76D408EA60E07267DAE56CDA23A;   // 0x0030(0x0010)(Edit, BlueprintVisible)
	struct FGuid                                  MatchGuid_37_7602D84D42EC9F19E1EBC8BFB6FAC309;     // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FBP_EndGameStats;

SDK_NAMESPACE_END
