#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Environment

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_environment_presets_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "WInd_Struct_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_Environment.BP_Environment_C
// 0x09C8 (0x0C70 - 0x02A8)
class ABP_Environment_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      FXS_Global_Wind;                                   // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	E_environment_presets                         PubEnvironmentPresets;                             // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPubDirectionalLight;                              // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPubSkyLight;                                      // 0x02C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPubPostProcess;                                   // 0x02C3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPubSkyAtmosphere;                                 // 0x02C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPubVolumetricCloud;                               // 0x02C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPubExponentialHeightFog;                          // 0x02C6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HDR_Histogram_Enabled;                             // 0x02C7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HDR_Histogram_Flag;                                // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DirLight_Intensity__lux_;                          // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkyLight_Intensity__Cd_;                           // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         s_;                                                // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ISO;                                               // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Aperture__F_stop_;                                 // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULightComponent*                        DirLight_Component;                                // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLight_Component;                                // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FPostProcessSettings                   PPSettings;                                        // 0x02F0(0x0760)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USkyAtmosphereComponent*                Sky_Atmosphere_Component;                          // 0x0A50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UVolumetricCloudComponent*              Volumetric_Cloud_Component;                        // 0x0A58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          EnvironmentSaved;                                  // 0x0A60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A61[0x7];                                      // 0x0A61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   SkySphere_Component;                               // 0x0A68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class APostProcessVolume*                     PPV;                                               // 0x0A70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       SkySphere;                                         // 0x0A78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ADirectionalLight*                      DirectionalLight;                                  // 0x0A80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AExponentialHeightFog*                  ExponentialHeightFog;                              // 0x0A88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APostProcessVolume*                     PostProcessVolume;                                 // 0x0A90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ASkyAtmosphere*                         SkyAtmosphere;                                     // 0x0A98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ASkyLight*                              SkyLight;                                          // 0x0AA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AVolumetricCloud*                       Volumetric_Cloud;                                  // 0x0AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       SM_SkySphere;                                      // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   DirLight_Tag;                                      // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DirLight_Status;                                   // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SkyLight_Tag;                                      // 0x0AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SkyLight_Status;                                   // 0x0AD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PPV_Tag;                                           // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PPV_Status;                                        // 0x0AE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   VolCloud_Tag;                                      // 0x0AE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   VolCloud_Status;                                   // 0x0AF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   HeightFog_Tag;                                     // 0x0AF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   HeightFog_Status;                                  // 0x0B00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SkyAtmos_Tag;                                      // 0x0B08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SkyAtmos_Status;                                   // 0x0B10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SkySphere_Tag;                                     // 0x0B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SkySphere_Status;                                  // 0x0B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableWind;                                        // 0x0B28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B29[0x7];                                      // 0x0B29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Direction;                                         // 0x0B30(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWInd_Struct                           Wind;                                              // 0x0B40(0x0048)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseWindIntensityPresets;                           // 0x0B88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B89[0x3];                                      // 0x0B89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Preset_Intensity;                                  // 0x0B8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Wind_Direction;                                    // 0x0B90(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Wind_Direction;                             // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Wind_Force;                                 // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Wind_Reactivity;                            // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Wind_Gust;                                  // 0x0BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Wind_Push;                                  // 0x0BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Wind_Turbulence_Force;                      // 0x0BC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Environment_Presets_C*              EnvironmentPresetA;                                // 0x0BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   PresetA_Name;                                      // 0x0BD8(0x0010)(Edit, BlueprintVisible)
	class FText                                   PresetA_Description;                               // 0x0BE8(0x0010)(Edit, BlueprintVisible)
	bool                                          PresetA_DirLight;                                  // 0x0BF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF9[0x7];                                      // 0x0BF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Environment_Presets_C*              EnvironmentPresetB;                                // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   PresetB_Name;                                      // 0x0C08(0x0010)(Edit, BlueprintVisible)
	class FText                                   PresetB_Description;                               // 0x0C18(0x0010)(Edit, BlueprintVisible)
	bool                                          PresetB_DirLight;                                  // 0x0C28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C29[0x7];                                      // 0x0C29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Maps;                                              // 0x0C30(0x0010)(Edit, BlueprintVisible)
	class FName                                   MPC_Map_WS_UV;                                     // 0x0C40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Current_Map;                                       // 0x0C48(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class URuntimeVirtualTexture*                 RVT_Height;                                        // 0x0C58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARuntimeVirtualTextureVolume*           RVT_Tracks;                                        // 0x0C60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void Apply_Wind_Preset(const struct FVector2D& InDirection, double InIntensity);
	struct FVector2D ConvertWindDirection();
	void DoesArrayContainActor(const TArray<class AActor*>& InTargetArray, bool* ActorFound);
	void ExecuteUbergraph_BP_Environment(int32 EntryPoint);
	void Get_Environment_Actors();
	void LoadEnvPreset(class UBP_Environment_Presets_C* InPreset);
	void LoadPresetA();
	void LoadPresetB();
	void OnMessageReceived_0E9125BC4526B9449C673F8F176DCEB3(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void Preset___Default_Lighting();
	void Preset___Neutral_Lighting();
	void Preset___Wind_Valley_R1();
	void Preset___Wind_Valley_R2();
	void Preset___WindValley_10AM();
	void Preset___WindValley_3PM();
	void ReceiveBeginPlay();
	void Reset_Neutral_Exposure();
	void SaveConfigToPresetA();
	void SaveEnvPreset(class UBP_Environment_Presets_C* InEnvPreset, const class FText& InPresetName, const class FText& InPresetDescription);
	void Set_Custom_Exposure();
	void Set_Custom_Lighting();
	void Setup_Atmosphere(class ASkyAtmosphere* InAtmosphere, float InGroundRadius, const struct FColor& InGroundAlbedo, const struct FLinearColor& InRayleightScattering, const struct FLinearColor& InSkyLumianceFactor, float InAerialPerspectiveViewDistanceScale, float InHeightFogContribution);
	void Setup_DirLight(const struct FRotator& InRotation, const struct FLinearColor& InLightColor, class ADirectionalLight* InDirLight, float InVolumetricScatteringIntensity, float InTemperature, float InIntensity, float InIndirectLightingIntensity, bool bInUseTemperature, bool bInEnableLightShaftBloom, bool bInEnableLightShaftOcclusion, float InOcclusionMaskDarkness, float InOcclusionDepthRange, float InSourceAngle, EComponentMobility InMobility);
	void Setup_Fog(class AExponentialHeightFog* InFog, const struct FVector& InNew_Transform_Location, float InFogDensity, float InStartDistance, float InDirectionalInscatteringExponent, float InSecondFogDensity, float InSecondFogHeightFalloff, float InSecondFogHeightOffset, bool bInVolumetricFog);
	void Setup_SkyLight(const struct FLinearColor& InLightColor, class ASkyLight* InSkyLight, float InIntensity, float InIndirectIntensity, const struct FLinearColor& InLowerHemisphereColor);
	void Setup_VolumetricCloud(class AVolumetricCloud* InCloud, float InLayerBottomAltitude, float InLayerHeight, float InTracingMaxDistance, float InTracingStartDistanceFromCamera, float InTracingStartMaxDistance, bool bInUsePerSampleAtmosphericLightTransmittance, float InSkyLightCloudBottomOcclusion, float InShadowTracingDistance);
	void SetWindDirection(const struct FVector2D& InDirection);
	void Spawn_Color_Calibrator();
	void TagEnvironmentActors();
	void test_exposure_1();
	void test_exposure_2();
	void Toggle_Atmosphere();
	void Toggle_Blob_Shadows();
	void Toggle_Clouds();
	void Toggle_Histogram();
	void Toggle_Skylight();
	void Toggle_Sunlight();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Environment_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Environment_C")
	}
	static class ABP_Environment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Environment_C>();
	}
};
DUMPER7_ASSERTS_ABP_Environment_C;

SDK_NAMESPACE_END
