#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GunLimitUpdateMessage

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct BP_GunLimitUpdateMessage.BP_GunLimitUpdateMessage
// 0x0080 (0x0080 - 0x0000)
struct FBP_GunLimitUpdateMessage final
{
public:
	struct FTransform                             MuzzleTransform_41_421659BD45184E3D5766978443FD4064; // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentGunPitch_39_6FFEFCE047644FC1029C53AE38CDDB0C; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HullTiltPitchAdjustment_44_A8557029495CFBE79645A580DCAFB01B; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GunElevationLimit_27_57A531F44D25AC2973CA9EAC05FC3FBB; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GunDepressionLimit_28_31850A074304B819257A37AD67CBBB95; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FBP_GunLimitUpdateMessage;

SDK_NAMESPACE_END
