#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HealZone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_BaseCapturable_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_HealZone.BP_HealZone_C
// 0x0030 (0x0408 - 0x03D8)
class ABP_HealZone_C final : public ABP_BaseCapturable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_HealZone_C;                      // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        PubHealFlatAmount;                                 // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PubHealPercentageAmount;                           // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPubShowPointLight;                                // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateCooldownVisuals();
	void ActivateReadyVisuals();
	void ExecuteUbergraph_BP_HealZone(int32 EntryPoint);
	struct FSlateColor GetTeamColor();
	void OnCapture();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_HealZone_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_HealZone_C")
	}
	static class ABP_HealZone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HealZone_C>();
	}
};
DUMPER7_ASSERTS_ABP_HealZone_C;

SDK_NAMESPACE_END
