#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HitMarkerData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct BP_HitMarkerData.BP_HitMarkerData
// 0x00B0 (0x00B0 - 0x0000)
struct FBP_HitMarkerData final
{
public:
	class USceneComponent*                        HitComponent_2_4517A12346A6A9DFB95D9F8F33CAEBBA;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             HitRelativeTransform_31_93F8439D402B68A2270A83B3882C802C; // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDidPenetrate_10_6ECE16D644FD209D42FF228BEF8F0374; // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsModuleHit_16_F241EE2E460D5D74914E4081E61C5708;  // 0x0071(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DamageAmount_13_A530B19C4EB8A3AF98E9ED8536748FAD;  // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   HitBoneName_19_BA3ACA9346ED6A0FB62F6E8059E17C53;   // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_HitMarker_C>         SpawnedHitMarkerActor_26_15A65AE049EC6E52F0B533A97B696126; // 0x0088(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FBP_HitMarkerData;

SDK_NAMESPACE_END
