#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HitMarker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_HitMarker.BP_HitMarker_C
// 0x0048 (0x02F0 - 0x02A8)
class ABP_HitMarker_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      ImpactMarker;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ShowTimer;                                         // 0x02C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        InitialHitVisibilityTime;                          // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PenMaterial;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BlockMaterial;                                     // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   MaterialParamName;                                 // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ModuleMaterial;                                    // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Cleanup();
	void ExecuteUbergraph_BP_HitMarker(int32 EntryPoint);
	void HideVisualMarker();
	void Initialize(const struct FVector& InImpactNormal, bool bInDidPenetrate, double InDamageAmount, bool bInIsModuleHit, int32 InHitIndex);
	void SetIndex(int32 InHitMarkerIndex);
	void SetVisibility(bool bInVisibility);
	void SetVisibilityFromInput(bool bInVisibility);
	void ShowForTime(double InShowTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_HitMarker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_HitMarker_C")
	}
	static class ABP_HitMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HitMarker_C>();
	}
};
DUMPER7_ASSERTS_ABP_HitMarker_C;

SDK_NAMESPACE_END
