#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MicroPackData

#include "Basic.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct BP_MicroPackData.BP_MicroPackData
// 0x00C0 (0x00C0 - 0x0000)
struct FBP_MicroPackData final
{
public:
	class FText                                   DisplayName_4_8EE0D1A04D85DE8D7639BF8FD2343B93;    // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         CurrencyAmount_6_9E91F1D14C225DB93ADE7487997DEB6F; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   FormattedCurrencyAmount_8_E48715654A171F597F704CA2C8995E9A; // 0x0018(0x0010)(Edit, BlueprintVisible)
	class FText                                   RealMoneyPrice_10_FB059E834FDA9935F0E9F3A3EF95DEFA; // 0x0028(0x0010)(Edit, BlueprintVisible)
	int32                                         BonusPercentage_12_E19C46394B25EC151175AB919367E76E; // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              PackIcon_28_961341C548A5162758932383E99125CE;      // 0x0040(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          bIsFeatured_16_D29EB2B64C70EE6CE5828880ACB233F1;   // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              FeaturedImage_29_E684B5524DE32892EA3A9B85DFC461EE; // 0x0070(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FText                                   FeaturedDescription_20_D8A6443A4B5076A3E6A0D3BAB35BCF32; // 0x0098(0x0010)(Edit, BlueprintVisible)
	class FText                                   TermsText_22_797023434057CB01011FB4A2C1E88E6A;     // 0x00A8(0x0010)(Edit, BlueprintVisible)
	int32                                         SortOrder_24_72BBDB5C45ABC29E9A7468A50755C470;     // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FBP_MicroPackData;

SDK_NAMESPACE_END
