#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MenuCameraManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_MenuCameraRig_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_MenuCameraManager.BP_MenuCameraManager_C
// 0x0020 (0x2850 - 0x2830)
class ABP_MenuCameraManager_C final : public ATyrCommonPlayerCameraManager
{
public:
	uint8                                         Pad_2828[0x8];                                     // 0x2828(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2830(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	E_MenuCameraRig                               ActiveCameraRig;                                   // 0x2838(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2839[0x7];                                     // 0x2839(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 AttachActor;                                       // 0x2840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MenuCameraManager(int32 EntryPoint);
	void K2_OnInitialized(class APlayerController* PC);
	void SetActiveCameraRig(E_MenuCameraRig InNewRig);
	void SetArmLength(double InLength);
	void SetAttachmentActor(class AActor* InActor);
	void SetCosmeticViewLocationAndRotation(const struct FVector& InLocation, const struct FRotator& InRotation);
	void SetFieldOfView(double InFieldOfView);
	void SetLocation(const struct FVector& InLocation);
	void SetRotation(const struct FRotator& InRotation);

	void GetActiveCameraRig(E_MenuCameraRig* ActiveCameraRig_0) const;
	void GetArmorViewerArmLength(float* TargetArmLength) const;
	struct FBlueprintCameraEvaluationDataRef GetSharedCameraData() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MenuCameraManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MenuCameraManager_C")
	}
	static class ABP_MenuCameraManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MenuCameraManager_C>();
	}
};
DUMPER7_ASSERTS_ABP_MenuCameraManager_C;

SDK_NAMESPACE_END
