#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerMatchStats

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct BP_PlayerMatchStats.BP_PlayerMatchStats
// 0x0078 (0x0078 - 0x0000)
struct FBP_PlayerMatchStats final
{
public:
	class FString                                 PlayerName_33_7AFF9B724ED9B49E42659E8BFA645EC9;    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTag                           VehicleTag_26_EFB8A773493FCE89540BDC867043818E;    // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	int32                                         TeamId_24_9362662A462254D82B35D4B107495994;        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DamageStat_10_7A9D2F014DD376B1036D5D833AE294D7;    // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BlockedStat_12_04E757BC46060E2B16F7CFA9DC36830D;   // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpottingAssistStat_14_13EF19404042B4473422F29C522DDF04; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DestroyedStat_16_9F582CC04E679EA9468F4490C5B9608A; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       NetId_32_F5049B23448814EFD26FDFB92C554658;         // 0x0030(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          bIsAlive_35_F61FCD0A4954FEA5F05663B91F2ABE9C;      // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PartyId_38_473280E84D6AC3BB1316FBB4F76643D1;       // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FBP_PlayerMatchStats;

SDK_NAMESPACE_END
