#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Recall_Lite

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_BaseTank_Lite_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_Recall_Lite.BP_Recall_Lite_C
// 0x0028 (0x05E8 - 0x05C0)
class ABP_Recall_Lite_C final : public ABP_BaseTank_Lite_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Recall_Lite_C;                   // 0x05C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInstancedStaticMeshComponent*          Tracks_Tread_Right;                                // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Tracks_Spline_Right;                               // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Tracks_Spline_Left;                                // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          Tracks_Tread_Left;                                 // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ExecuteUbergraph_BP_Recall_Lite(int32 EntryPoint);
	void CustomTick(double DeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Recall_Lite_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Recall_Lite_C")
	}
	static class ABP_Recall_Lite_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Recall_Lite_C>();
	}
};
DUMPER7_ASSERTS_ABP_Recall_Lite_C;

SDK_NAMESPACE_END
