#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReticleUpdateMessage_AbsorbOvermatch

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct BP_ReticleUpdateMessage_AbsorbOvermatch.BP_ReticleUpdateMessage_AbsorbOvermatch
// 0x00B0 (0x00B0 - 0x0000)
struct FBP_ReticleUpdateMessage_AbsorbOvermatch final
{
public:
	struct FVector                                WorldPosition_54_6FFEFCE047644FC1029C53AE38CDDB0C; // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             MuzzleTransform_57_4E2A41B147757E934EB9AA867A2A9878; // 0x0020(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WorldDistance_23_31DB1542416FEB27AFABA5BF4DF99BCA; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValidTarget_18_31850A074304B819257A37AD67CBBB95; // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPenOvermatch_52_C691C22C49C1E22B50ED4DB3C2B685E0; // 0x0089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShotWillPen_19_57A531F44D25AC2973CA9EAC05FC3FBB;  // 0x008A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShotHalfChancePen_46_EB9D4E1F42C979132DE2478EFD6DDFD2; // 0x008B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPrecisionReticle_25_47CB538D44F37889780CF8BA4893E205; // 0x008C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentPrecisionModeTimer_38_221C7D33481AFBDB9C8984B16CEAB2AA; // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxPrecisionModeTime_37_ED72282B4FABC7EAB754AE9480127A07; // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsModule_27_7682AE244F63A5EDBF06A3B57A67987B;     // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsModuleDisabled_29_D776D58F4E37DAAB2C2CFD92697949D0; // 0x00A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bModuleAbsorbDamage_48_7EBBFB2A4709FAFECBE3859E25843632; // 0x00A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsTurretLocked_50_48F025D042393FCC9745E9AE6F813D13; // 0x00A3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FBP_ReticleUpdateMessage_AbsorbOvermatch;

SDK_NAMESPACE_END
