#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Recall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_BaseTank_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_Recall.BP_Recall_C
// 0x00E0 (0x0D08 - 0x0C28)
class ABP_Recall_C final : public ABP_BaseTank_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Recall_C;                        // 0x0C28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInstancedStaticMeshComponent*          Tracks_Tread_Left;                                 // 0x0C30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          Tracks_Tread_Right;                                // 0x0C38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Tracks_Spline_Right;                               // 0x0C40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Tracks_Spline_Left;                                // 0x0C48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ProceduralTracksNative_C*          ProceduralTracksComponent;                         // 0x0C50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ModuleTrackComponent_C*            ModuleTrackComponent;                              // 0x0C58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ModuleFireComponent_C*             ModuleFireComponent;                               // 0x0C60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ModuleGunComponent_C*              ModuleGunComponent;                                // 0x0C68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         PubColorIndex;                                     // 0x0C70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumTracksTreads;                                   // 0x0C74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           TracksWheelsRight;                                 // 0x0C78(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           TracksWheelsLeft;                                  // 0x0C88(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        Tracks_Time_Side;                                  // 0x0C98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TracksSpeed_Mult;                                  // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TracksSpeed_Right;                                 // 0x0CA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TracksSpeed_Left;                                  // 0x0CB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ThreadDistance;                                    // 0x0CB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                TracksTime;                                        // 0x0CC0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        TracksSpeed;                                       // 0x0CD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                TracksSplinePoints;                                // 0x0CD8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        TracksPointsTransform;                             // 0x0CE8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               DynamicVisualMeshOverlay;                          // 0x0CF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         SkinDebug;                                         // 0x0D00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Recall(int32 EntryPoint);
	void GetTankArmorMesh(class USkeletalMeshComponent** ArmorMesh_0);
	void GetTankPhysicsMesh(class USkeletalMeshComponent** PhysicsMesh_0);
	void GetTankTurretComp(class UBPC_TurretBaseComponent_C** TurretComp);
	void GetTankVisualMesh(class USkeletalMeshComponent** VisualMesh_0);
	void K2_PlayerStateClientReady();
	void K2_PlayerStateServerReady();
	void ReceiveBeginPlay();
	void SetupMeshes();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Recall_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Recall_C")
	}
	static class ABP_Recall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Recall_C>();
	}
};
DUMPER7_ASSERTS_ABP_Recall_C;

SDK_NAMESPACE_END
