#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Recall

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_Recall.BP_Recall_C.ExecuteUbergraph_BP_Recall
// 0x0040 (0x0040 - 0x0000)
struct BP_Recall_C_ExecuteUbergraph_BP_Recall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0008(0x0020)()
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrMiniMapUpdateSubsystem*             CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetColorIndex_ReturnValue;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Recall_C_ExecuteUbergraph_BP_Recall;

// Function BP_Recall.BP_Recall_C.GetTankArmorMesh
// 0x0010 (0x0010 - 0x0000)
struct BP_Recall_C_GetTankArmorMesh final
{
public:
	class USkeletalMeshComponent*                 ArmorMesh_0;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetArmorMesh_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Recall_C_GetTankArmorMesh;

// Function BP_Recall.BP_Recall_C.GetTankPhysicsMesh
// 0x0010 (0x0010 - 0x0000)
struct BP_Recall_C_GetTankPhysicsMesh final
{
public:
	class USkeletalMeshComponent*                 PhysicsMesh_0;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetPhysicsMesh_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Recall_C_GetTankPhysicsMesh;

// Function BP_Recall.BP_Recall_C.GetTankTurretComp
// 0x0008 (0x0008 - 0x0000)
struct BP_Recall_C_GetTankTurretComp final
{
public:
	class UBPC_TurretBaseComponent_C*             TurretComp;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Recall_C_GetTankTurretComp;

// Function BP_Recall.BP_Recall_C.GetTankVisualMesh
// 0x0008 (0x0008 - 0x0000)
struct BP_Recall_C_GetTankVisualMesh final
{
public:
	class USkeletalMeshComponent*                 VisualMesh_0;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Recall_C_GetTankVisualMesh;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
