#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TyrPlayerState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_TyrPlayerState.BP_TyrPlayerState_C
// 0x0018 (0x08D8 - 0x08C0)
class ABP_TyrPlayerState_C final : public ATyrPlayerStateBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bPubIsAlly;                                        // 0x08D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAlive;                                          // 0x08D1(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D2[0x2];                                      // 0x08D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CachedTeamId;                                      // 0x08D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Client_MatchEnd(int32 WinningTeamIndex);
	void Client_UpdateCaptureProgress(int32 TeamId, int32 CapturePoints);
	void ExecuteUbergraph_BP_TyrPlayerState(int32 EntryPoint);
	void GetCombatLogContextTags(const struct FGameplayTagContainer& InGameplayTags, struct FGameplayTagContainer* CombatTags);
	void GetCombatLogTagFromModule(const class FString& InSuffix, const struct FGameplayTag& InParentTag, struct FGameplayTag* CombatLogTag);
	void GetCombatLogType(const struct FGameplayTagContainer& InGameplayTags, ECombatLogType* CombatType, struct FGameplayTag* CombatTypeTag);
	void HandleDeath();
	void InitializeAbility();
	void On_RepTeamId();
	void On_RepVehicleIndex();
	void On_RepVehicleTag();
	void OnAbilityAssistMessage(const struct FTyrGameActionMessage& InMessage);
	void OnAmmoDepotAssistMessage(const struct FTyrGameActionMessage& InMessage);
	void OnBlockingAssistMessage(const struct FTyrGameActionMessage& InMessage);
	void OnCaptureProgressAssistMessage(const struct FTyrGameActionMessage& InMessage);
	void OnCaptureReductionAssistMessage(const struct FTyrGameActionMessage& InMessage);
	void OnFirstSpotAssistMessage(const struct FTyrGameActionMessage& InMessage);
	void OnMessageReceived_0F0D214B49E55B4E95428BB9C69DFEFD(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_1A326F7F488F59BCD5988E8144E42819(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_25031FBB4D9872C2897BF4BF23CE8E16(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_30E8579EB44887CBF1CCB8BA4E4BB360(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_ACAFD2144F288897D37A4785365EA300(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_B1F3387A449A41CB52D0CF9FADC72F72(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_C0FC82FF4994710852BA8F9B08D58D8B(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_DE90479B61490B7B134717B71BDE65E0(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_F96DE9314BD1908D8C00EC89054831C6(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnModuleDamagedAssistMessage(const struct FTyrModuleActionMessage& InMessage);
	void OnPawn(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn);
	void OnReceiveDamageMessage(const struct FTyrGameActionMessage& InMessage);
	void OnSpottingAssistMessage(const struct FTyrGameActionMessage& InMessage);
	void OnTeamChanged_2BE099034914C78E0F093E88ADA4BA6F(bool bTeamSet, int32 TeamId);
	void OnTeamChanged_33CC27D24935747A61872294EA11A97B(bool bTeamSet, int32 TeamId);
	void ReceiveBeginPlay();
	void TeamChangeEvent();
	void UpdateHealthBars(class ATyrPlayerStateBase* State);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_TyrPlayerState_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_TyrPlayerState_C")
	}
	static class ABP_TyrPlayerState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TyrPlayerState_C>();
	}
};
DUMPER7_ASSERTS_ABP_TyrPlayerState_C;

SDK_NAMESPACE_END
