#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TestBotTank

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_TestBotTank.BP_TestBotTank_C
// 0x0060 (0x0440 - 0x03E0)
class ABP_TestBotTank_C final : public ATyrAIControllerBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ATyrWheeledVehiclePawnBase*             TankPawn;                                          // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CapZoneLocation;                                   // 0x03F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNavigationPath*                        Path;                                              // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bApplyModuleDamageOnSpawn;                         // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ModuleComponentDefaultObject;                      // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ModuleTypeTag;                                     // 0x0420(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        ModuleDamage_DelayTime;                            // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTimerHandle>                   Timers;                                            // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ApplyModuleDamage();
	void ExecuteUbergraph_BP_TestBotTank(int32 EntryPoint);
	void OnUpdateThrottle();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void ReceivePossess(class APawn* PossessedPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_TestBotTank_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_TestBotTank_C")
	}
	static class ABP_TestBotTank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TestBotTank_C>();
	}
};
DUMPER7_ASSERTS_ABP_TestBotTank_C;

SDK_NAMESPACE_END
