#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TyrGameMode

#include "Basic.hpp"

#include "DataRegistry_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_PlayerMatchStats_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "E_MatchEndCondition_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_TyrGameMode.BP_TyrGameMode_C
// 0x00B8 (0x0608 - 0x0550)
class ABP_TyrGameMode_C final : public ATyrGameModeBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0550(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_GamePlayerManager_C*               BPC_GamePlayerManagerComponent;                    // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        MatchTime;                                         // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WinningTeamIndex;                                  // 0x0570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnToLobbyAmount;                               // 0x0574(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VehicleCleanupAmount;                              // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  VehicleClassTags;                                  // 0x0580(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           GameTimer;                                         // 0x05A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	E_MatchEndCondition                           MatchEndCondition;                                 // 0x05A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FUniqueNetIdRepl, struct FBP_PlayerMatchStats> PlayerStatsEntries;                   // 0x05B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MatchLength;                                       // 0x0600(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class AActor* ChoosePlayerStart(class AController* Player);
	void CleanUpVehicles();
	void DetermineTieBreaker();
	void ExecuteUbergraph_BP_TyrGameMode(int32 EntryPoint);
	void FilloutEOGStats(struct FMatchDetails* Payload);
	void GameIntroComplete();
	class UClass* GetDefaultPawnClassForController(class AController* InController);
	void HandleStartingNewPlayer(class APlayerController* NewPlayer);
	void K2_OnLogout(class AController* ExitingController);
	void MatchEnd();
	void OnMatchPhaseChange(ETyrMatchPhase OldPhase, ETyrMatchPhase NewPhase);
	void PackageEndGameStats();
	void PackagePlayerStats(class APlayerState* InPlayerState, struct FBP_PlayerMatchStats* PlayerMatchStats);
	void ReceiveBeginPlay();
	void ReturnToHomeScreen();
	void ReturnToLobby();
	void TwoMinuteWarning();
	void UpdatePlayerStatsEntry(class APlayerState* InPlayerState, struct FBP_PlayerMatchStats* OutMatchStats);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_TyrGameMode_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_TyrGameMode_C")
	}
	static class ABP_TyrGameMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TyrGameMode_C>();
	}
};
DUMPER7_ASSERTS_ABP_TyrGameMode_C;

SDK_NAMESPACE_END
