#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Tank_Animation_Interface

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_Tank_Animation_Interface.BP_Tank_Animation_Interface_C.GetTankArmorMesh
// 0x0008 (0x0008 - 0x0000)
struct BP_Tank_Animation_Interface_C_GetTankArmorMesh final
{
public:
	class USkeletalMeshComponent*                 ArmorMesh;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Tank_Animation_Interface_C_GetTankArmorMesh;

// Function BP_Tank_Animation_Interface.BP_Tank_Animation_Interface_C.GetTankPhysicsMesh
// 0x0008 (0x0008 - 0x0000)
struct BP_Tank_Animation_Interface_C_GetTankPhysicsMesh final
{
public:
	class USkeletalMeshComponent*                 PhysicsMesh;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Tank_Animation_Interface_C_GetTankPhysicsMesh;

// Function BP_Tank_Animation_Interface.BP_Tank_Animation_Interface_C.GetTankTurretComp
// 0x0008 (0x0008 - 0x0000)
struct BP_Tank_Animation_Interface_C_GetTankTurretComp final
{
public:
	class UBPC_TurretBaseComponent_C*             TurretComp;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Tank_Animation_Interface_C_GetTankTurretComp;

// Function BP_Tank_Animation_Interface.BP_Tank_Animation_Interface_C.GetTankVisualizerTurretMantleRotations
// 0x0010 (0x0010 - 0x0000)
struct BP_Tank_Animation_Interface_C_GetTankVisualizerTurretMantleRotations final
{
public:
	double                                        TurretYaw;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GunPitch;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Tank_Animation_Interface_C_GetTankVisualizerTurretMantleRotations;

// Function BP_Tank_Animation_Interface.BP_Tank_Animation_Interface_C.GetTankVisualMesh
// 0x0008 (0x0008 - 0x0000)
struct BP_Tank_Animation_Interface_C_GetTankVisualMesh final
{
public:
	class USkeletalMeshComponent*                 VisualMesh;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Tank_Animation_Interface_C_GetTankVisualMesh;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
