#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VehicleClassPlayerInfoHolder

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_VehicleClassPlayerInfoHolder.BP_VehicleClassPlayerInfoHolder_C
// 0x0028 (0x0050 - 0x0028)
class UBP_VehicleClassPlayerInfoHolder_C final : public UObject
{
public:
	class ATyrPlayerStateBase*                    PubPlayerState;                                    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 PubVehicleClassName;                               // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         PubTeamID;                                         // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bPubVisualClassDivider;                            // 0x0044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bPubShowVehicleClassIcon;                          // 0x0045(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           PubKeystoneTag;                                    // 0x0048(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void SetInfo(class ATyrPlayerStateBase* InPlayerState, const class FString& InVehicleClassName, int32 InTeamId, bool bInVisualClassDivider, bool bInShowVehicleClassIcon);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_VehicleClassPlayerInfoHolder_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_VehicleClassPlayerInfoHolder_C")
	}
	static class UBP_VehicleClassPlayerInfoHolder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VehicleClassPlayerInfoHolder_C>();
	}
};
DUMPER7_ASSERTS_UBP_VehicleClassPlayerInfoHolder_C;

SDK_NAMESPACE_END
