#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_ModuleFireComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BPC_ModuleFireComponent.BPC_ModuleFireComponent_C
// 0x0040 (0x01F0 - 0x01B0)
class UBPC_ModuleFireComponent_C final : public UTyrModuleComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         DamagePeriod;                                      // 0x01B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           DamageTimerHandle;                                 // 0x01C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        DamageAmount;                                      // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwnerAbilitySystem;                                // 0x01D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContextFromHit;                              // 0x01D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void DoDamage();
	void ExecuteUbergraph_BPC_ModuleFireComponent(int32 EntryPoint);
	void InitializeAbilitySystem(class UAbilitySystemComponent* AbilitySystem);
	void K2_OnTakeHitMessage(const struct FTyrModuleActionMessage& Message, const struct FGameplayEffectContextHandle& EffectContext);
	void OnTagAdded_C4DCD3014AF0766D219FE4A50CEE6C53(const struct FGameplayTag& Tag);
	void OnTagRemoved_C4DCD3014AF0766D219FE4A50CEE6C53(const struct FGameplayTag& Tag);
	void OnTakeHitMessage_BPVersion(const struct FTyrModuleActionMessage& InModuleActionMessage, struct FGameplayEffectContextHandle& InEffectContext, bool* bModuleSuccessfullyDamaged);
	void PostPlayerStateInitializeAbilitySystem(class UAbilitySystemComponent* AbilitySystem);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_ModuleFireComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_ModuleFireComponent_C")
	}
	static class UBPC_ModuleFireComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_ModuleFireComponent_C>();
	}
};
DUMPER7_ASSERTS_UBPC_ModuleFireComponent_C;

SDK_NAMESPACE_END
