#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_NoGoComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BPC_NoGoComponent.BPC_NoGoComponent_C
// 0x0098 (0x0150 - 0x00B8)
class UBPC_NoGoComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 NoGoGameplayEffectClass;                           // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                ASC;                                               // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         NoGoZonesOverlapping;                              // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TeleportToLocation;                                // 0x00D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             EnterTransform;                                    // 0x00F0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPC_NoGoComponent(int32 EntryPoint);
	void InitializeAbilitySystem(class UAbilitySystemComponent* AbilitySystem);
	void OnEnterNoGoZone();
	void OnExitNoGoZone();
	void OnTagAdded_1C7BA6284445FAE0A510F59A5612E904(const struct FGameplayTag& Tag);
	void OnTagRemoved_1C7BA6284445FAE0A510F59A5612E904(const struct FGameplayTag& Tag);
	void PostPlayerStateInitializeAbilitySystem(class UAbilitySystemComponent* AbilitySystem);
	void TryTeleportPlayer();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_NoGoComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_NoGoComponent_C")
	}
	static class UBPC_NoGoComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_NoGoComponent_C>();
	}
};
DUMPER7_ASSERTS_UBPC_NoGoComponent_C;

SDK_NAMESPACE_END
