#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_StatusEffect_OverlayMat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BPC_StatusEffect_OverlayMat.BPC_StatusEffect_OverlayMat_C
// 0x0028 (0x00E0 - 0x00B8)
class UBPC_StatusEffect_OverlayMat_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialInstanceDynamic*               OverlayMat_DMI;                                    // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     OverlayMat_Source;                                 // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATyrWheeledVehiclePawnBase*             Loc_VehiclePawn;                                   // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Loc_VisualMesh;                                    // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPC_StatusEffect_OverlayMat(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetupOverlayMat();
	void StatusEffect_EnergyGain_Burst();
	void StatusEffect_Healing_Burst();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_StatusEffect_OverlayMat_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_StatusEffect_OverlayMat_C")
	}
	static class UBPC_StatusEffect_OverlayMat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_StatusEffect_OverlayMat_C>();
	}
};
DUMPER7_ASSERTS_UBPC_StatusEffect_OverlayMat_C;

SDK_NAMESPACE_END
