#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPCN_AttachToVehicle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayCameras_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BPCN_AttachToVehicle.BPCN_AttachToVehicle_C
// 0x0050 (0x0160 - 0x0110)
class UBPCN_AttachToVehicle_C final : public UBlueprintCameraNodeEvaluator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0110(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                PreviousLocation;                                  // 0x0118(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FixedOffset;                                       // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CameraAttachSocketName;                            // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CachedAttachActor;                                 // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SocketOffset;                                      // 0x0148(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPCN_AttachToVehicle(int32 EntryPoint);
	void TickCameraNode(float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPCN_AttachToVehicle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPCN_AttachToVehicle_C")
	}
	static class UBPCN_AttachToVehicle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPCN_AttachToVehicle_C>();
	}
};
DUMPER7_ASSERTS_UBPCN_AttachToVehicle_C;

SDK_NAMESPACE_END
