#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPCN_SetPoseToBaseLocation

#include "Basic.hpp"

#include "GameplayCameras_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BPCN_SetPoseToBaseLocation.BPCN_SetPoseToBaseLocation_C.ExecuteUbergraph_BPCN_SetPoseToBaseLocation
// 0x0138 (0x0138 - 0x0000)
struct BPCN_SetPoseToBaseLocation_C_ExecuteUbergraph_BPCN_SetPoseToBaseLocation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerCameraManager_C*              K2Node_DynamicCast_AsBP_Player_Camera_Manager;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlueprintCameraPose                   CallFunc_GetCurrentCameraPose_ReturnValue;         // 0x0028(0x0088)(NoDestructor)
	struct FBlueprintCameraPose                   K2Node_SetFieldsInStruct_StructOut;                // 0x00B0(0x0088)(NoDestructor)
};
DUMPER7_ASSERTS_BPCN_SetPoseToBaseLocation_C_ExecuteUbergraph_BPCN_SetPoseToBaseLocation;

// Function BPCN_SetPoseToBaseLocation.BPCN_SetPoseToBaseLocation_C.TickCameraNode
// 0x0004 (0x0004 - 0x0000)
struct BPCN_SetPoseToBaseLocation_C_TickCameraNode final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPCN_SetPoseToBaseLocation_C_TickCameraNode;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
