#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPCN_OverheadCameraUpdateRotation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayCameras_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BPCN_OverheadCameraUpdateRotation.BPCN_OverheadCameraUpdateRotation_C
// 0x0050 (0x0160 - 0x0110)
class UBPCN_OverheadCameraUpdateRotation_C final : public UBlueprintCameraNodeEvaluator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0110(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                CameraTargetLocation;                              // 0x0118(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LastTargetDistance;                                // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasSetTargetLocationOnce;                         // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ErrorTolerance;                                    // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               PreviousFrameControlRotation;                      // 0x0148(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BPCN_OverheadCameraUpdateRotation(int32 EntryPoint);
	void InitializeCameraNode();
	void TickCameraNode(float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPCN_OverheadCameraUpdateRotation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPCN_OverheadCameraUpdateRotation_C")
	}
	static class UBPCN_OverheadCameraUpdateRotation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPCN_OverheadCameraUpdateRotation_C>();
	}
};
DUMPER7_ASSERTS_UBPCN_OverheadCameraUpdateRotation_C;

SDK_NAMESPACE_END
