#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CDE_PlayerCameras

#include "Basic.hpp"

#include "GameplayCameras_structs.hpp"
#include "E_GameCameraRig_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function CDE_PlayerCameras.CDE_PlayerCameras_C.ActivateCameraDirector
// 0x0010 (0x0010 - 0x0000)
struct CDE_PlayerCameras_C_ActivateCameraDirector final
{
public:
	class UObject*                                EvaluationContextOwner;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FBlueprintCameraDirectorActivateParams Params_0;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
DUMPER7_ASSERTS_CDE_PlayerCameras_C_ActivateCameraDirector;

// Function CDE_PlayerCameras.CDE_PlayerCameras_C.ExecuteUbergraph_CDE_PlayerCameras
// 0x0050 (0x0050 - 0x0000)
struct CDE_PlayerCameras_C_ExecuteUbergraph_CDE_PlayerCameras final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_EvaluationContextOwner_1;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FBlueprintCameraDirectorActivateParams K2Node_Event_Params_1;                             // 0x0010(0x0008)(ConstParm, NoDestructor)
	float                                         K2Node_Event_DeltaTime;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_EvaluationContextOwner;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FBlueprintCameraDirectorEvaluationParams K2Node_Event_Params;                             // 0x0028(0x0010)(ConstParm, NoDestructor)
	class APlayerController*                      CallFunc_FindEvaluationContextOwnerActor_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerCameraManager_C*              K2Node_DynamicCast_AsBP_Player_Camera_Manager;     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GameCameraRig                               CallFunc_GetActiveCameraRig_CameraRig;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CDE_PlayerCameras_C_ExecuteUbergraph_CDE_PlayerCameras;

// Function CDE_PlayerCameras.CDE_PlayerCameras_C.RunCameraDirector
// 0x0020 (0x0020 - 0x0000)
struct CDE_PlayerCameras_C_RunCameraDirector final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                EvaluationContextOwner;                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FBlueprintCameraDirectorEvaluationParams Params_0;                                        // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
DUMPER7_ASSERTS_CDE_PlayerCameras_C_RunCameraDirector;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
