#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClonerEffector

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// Enum ClonerEffector.ECEClonerAttachmentStatus
// NumValues: 0x0005
enum class ECEClonerAttachmentStatus : uint8
{
	Invalid                                  = 0,
	Outdated                                 = 1,
	Updated                                  = 2,
	Updating                                 = 3,
	ECEClonerAttachmentStatus_MAX            = 4,
};

// Enum ClonerEffector.ECEClonerAxis
// NumValues: 0x0005
enum class ECEClonerAxis : uint8
{
	X                                        = 0,
	Y                                        = 1,
	Z                                        = 2,
	Custom                                   = 3,
	ECEClonerAxis_MAX                        = 4,
};

// Enum ClonerEffector.ECEClonerPlane
// NumValues: 0x0005
enum class ECEClonerPlane : uint8
{
	XY                                       = 0,
	YZ                                       = 1,
	XZ                                       = 2,
	Custom                                   = 3,
	ECEClonerPlane_MAX                       = 4,
};

// Enum ClonerEffector.ECEClonerMeshRenderMode
// NumValues: 0x0004
enum class ECEClonerMeshRenderMode : uint8
{
	Iterate                                  = 0,
	Random                                   = 1,
	Blend                                    = 2,
	ECEClonerMeshRenderMode_MAX              = 3,
};

// Enum ClonerEffector.ECEClonerGridConstraint
// NumValues: 0x0005
enum class ECEClonerGridConstraint : uint8
{
	None                                     = 0,
	Sphere                                   = 1,
	Cylinder                                 = 2,
	Texture                                  = 3,
	ECEClonerGridConstraint_MAX              = 4,
};

// Enum ClonerEffector.ECEClonerEasing
// NumValues: 0x0021
enum class ECEClonerEasing : uint8
{
	Linear                                   = 0,
	InSine                                   = 1,
	OutSine                                  = 2,
	InOutSine                                = 3,
	InQuad                                   = 4,
	OutQuad                                  = 5,
	InOutQuad                                = 6,
	InCubic                                  = 7,
	OutCubic                                 = 8,
	InOutCubic                               = 9,
	InQuart                                  = 10,
	OutQuart                                 = 11,
	InOutQuart                               = 12,
	InQuint                                  = 13,
	OutQuint                                 = 14,
	InOutQuint                               = 15,
	InExpo                                   = 16,
	OutExpo                                  = 17,
	InOutExpo                                = 18,
	InCirc                                   = 19,
	OutCirc                                  = 20,
	InOutCirc                                = 21,
	InBack                                   = 22,
	OutBack                                  = 23,
	InOutBack                                = 24,
	InElastic                                = 25,
	OutElastic                               = 26,
	InOutElastic                             = 27,
	InBounce                                 = 28,
	OutBounce                                = 29,
	InOutBounce                              = 30,
	Random                                   = 31,
	ECEClonerEasing_MAX                      = 32,
};

// Enum ClonerEffector.ECEClonerMeshAsset
// NumValues: 0x0003
enum class ECEClonerMeshAsset : uint8
{
	StaticMesh                               = 0,
	SkeletalMesh                             = 1,
	ECEClonerMeshAsset_MAX                   = 2,
};

// Enum ClonerEffector.ECEClonerMeshSampleData
// NumValues: 0x0006
enum class ECEClonerMeshSampleData : uint8
{
	Vertices                                 = 0,
	Triangles                                = 1,
	Sockets                                  = 2,
	Bones                                    = 3,
	Sections                                 = 4,
	ECEClonerMeshSampleData_MAX              = 5,
};

// Enum ClonerEffector.ECEClonerEffectorType
// NumValues: 0x0007
enum class ECEClonerEffectorType : uint8
{
	Sphere                                   = 0,
	Plane                                    = 1,
	Box                                      = 2,
	Unbound                                  = 3,
	Radial                                   = 4,
	Torus                                    = 5,
	ECEClonerEffectorType_MAX                = 6,
};

// Enum ClonerEffector.ECEClonerEffectorMode
// NumValues: 0x0008
enum class ECEClonerEffectorMode : uint8
{
	Default                                  = 0,
	Target                                   = 1,
	Procedural                               = 2,
	Push                                     = 3,
	Step                                     = 4,
	Cull                                     = 5,
	Cancel                                   = 6,
	ECEClonerEffectorMode_MAX                = 7,
};

// Enum ClonerEffector.ECEClonerEffectorProceduralPattern
// NumValues: 0x0004
enum class ECEClonerEffectorProceduralPattern : uint8
{
	CurlNoise                                = 0,
	DirectionalWave                          = 1,
	CircularWave                             = 2,
	ECEClonerEffectorProceduralPattern_MAX   = 3,
};

// Enum ClonerEffector.ECEClonerEffectorPushDirection
// NumValues: 0x0006
enum class ECEClonerEffectorPushDirection : uint8
{
	Forward                                  = 0,
	Right                                    = 1,
	Up                                       = 2,
	Effector                                 = 3,
	Random                                   = 4,
	ECEClonerEffectorPushDirection_MAX       = 5,
};

// Enum ClonerEffector.ECEClonerTextureSampleChannel
// NumValues: 0x0008
enum class ECEClonerTextureSampleChannel : uint8
{
	RGBLuminance                             = 0,
	RGBAverage                               = 1,
	RGBMax                                   = 2,
	R                                        = 3,
	G                                        = 4,
	B                                        = 5,
	A                                        = 6,
	ECEClonerTextureSampleChannel_MAX        = 7,
};

// Enum ClonerEffector.ECEClonerCompareMode
// NumValues: 0x0007
enum class ECEClonerCompareMode : uint8
{
	Greater                                  = 0,
	GreaterEqual                             = 1,
	Equal                                    = 2,
	NotEqual                                 = 3,
	Less                                     = 4,
	LessEqual                                = 5,
	ECEClonerCompareMode_MAX                 = 6,
};

// Enum ClonerEffector.ECEClonerSpawnLoopMode
// NumValues: 0x0004
enum class ECEClonerSpawnLoopMode : uint8
{
	Once                                     = 0,
	Multiple                                 = 1,
	Infinite                                 = 2,
	ECEClonerSpawnLoopMode_MAX               = 3,
};

// Enum ClonerEffector.ECEClonerSpawnBehaviorMode
// NumValues: 0x0003
enum class ECEClonerSpawnBehaviorMode : uint8
{
	Instant                                  = 0,
	Rate                                     = 1,
	ECEClonerSpawnBehaviorMode_MAX           = 2,
};

// Enum ClonerEffector.ECEClonerCollisionRadiusMode
// NumValues: 0x0005
enum class ECEClonerCollisionRadiusMode : uint8
{
	Manual                                   = 0,
	MinExtent                                = 1,
	MaxExtent                                = 2,
	ExtentLength                             = 3,
	ECEClonerCollisionRadiusMode_MAX         = 4,
};

// Enum ClonerEffector.ECEClonerTextureProvider
// NumValues: 0x0004
enum class ECEClonerTextureProvider : uint8
{
	Constraint                               = 0,
	Displacement                             = 1,
	Custom                                   = 2,
	ECEClonerTextureProvider_MAX             = 3,
};

// Enum ClonerEffector.ECEEffectorCullModeBehavior
// NumValues: 0x0003
enum class ECEEffectorCullModeBehavior : uint8
{
	Kill                                     = 0,
	Hide                                     = 1,
	ECEEffectorCullModeBehavior_MAX          = 2,
};

// ScriptStruct ClonerEffector.CEClonerAttachmentItem
// 0x00F0 (0x00F0 - 0x0000)
struct FCEClonerAttachmentItem final
{
public:
	TSet<TWeakObjectPtr<class AActor>>            ChildrenActors;                                    // 0x0000(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  ItemActor;                                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  ParentActor;                                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           BakedMesh;                                         // 0x0060(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<TWeakObjectPtr<class UMaterialInterface>> BakedMaterials;                                 // 0x0068(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	ECEClonerAttachmentStatus                     MeshStatus;                                        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ActorTransform;                                    // 0x0080(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRootItem;                                         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetupDone;                                        // 0x00E1(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECEClonerAttachmentStatus                     Status;                                            // 0x00E2(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E3[0xD];                                       // 0x00E3(0x000D)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCEClonerAttachmentItem;

// ScriptStruct ClonerEffector.CEClonerAttachmentTree
// 0x0108 (0x0108 - 0x0000)
struct FCEClonerAttachmentTree final
{
public:
	TMap<TWeakObjectPtr<class AActor>, struct FCEClonerAttachmentItem> ItemAttachmentMap;            // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class AActor>>          RootActors;                                        // 0x0050(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UStaticMesh*>                    MergedBakedMeshes;                                 // 0x0060(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	ECEClonerAttachmentStatus                     Status;                                            // 0x0070(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<TWeakObjectPtr<class AActor>>            DirtyItemAttachments;                              // 0x0078(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bItemAttachmentsDirty;                             // 0x00C8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3F];                                      // 0x00C9(0x003F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCEClonerAttachmentTree;

// ScriptStruct ClonerEffector.CEClonerEffectorChannelData
// 0x01B0 (0x01B0 - 0x0000)
struct alignas(0x10) FCEClonerEffectorChannelData final
{
public:
	uint8                                         Pad_0[0x1AC];                                      // 0x0000(0x01AC)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Identifier;                                        // 0x01AC(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FCEClonerEffectorChannelData;

// ScriptStruct ClonerEffector.CEClonerGridConstraintSphere
// 0x0020 (0x0020 - 0x0000)
struct FCEClonerGridConstraintSphere final
{
public:
	float                                         Radius;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Center;                                            // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCEClonerGridConstraintSphere;

// ScriptStruct ClonerEffector.CEClonerGridConstraintCylinder
// 0x0020 (0x0020 - 0x0000)
struct FCEClonerGridConstraintCylinder final
{
public:
	float                                         Radius;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Center;                                            // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCEClonerGridConstraintCylinder;

// ScriptStruct ClonerEffector.CEClonerGridConstraintTexture
// 0x0010 (0x0010 - 0x0000)
struct FCEClonerGridConstraintTexture final
{
public:
	TWeakObjectPtr<class UTexture>                Texture;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECEClonerTextureSampleChannel                 Channel;                                           // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECEClonerPlane                                Plane;                                             // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECEClonerCompareMode                          CompareMode;                                       // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Threshold;                                         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCEClonerGridConstraintTexture;

SDK_NAMESPACE_END
