#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClonerEffector

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ClonerEffector_structs.hpp"
#include "Niagara_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function ClonerEffector.CEClonerActor.GetClonerComponent
// 0x0008 (0x0008 - 0x0000)
struct CEClonerActor_GetClonerComponent final
{
public:
	class UCEClonerComponent*                     ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerActor_GetClonerComponent;

// Function ClonerEffector.CEClonerLayoutBase.GetLayoutName
// 0x0008 (0x0008 - 0x0000)
struct CEClonerLayoutBase_GetLayoutName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerLayoutBase_GetLayoutName;

// Function ClonerEffector.CEClonerLayoutBase.IsLayoutActive
// 0x0001 (0x0001 - 0x0000)
struct CEClonerLayoutBase_IsLayoutActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerLayoutBase_IsLayoutActive;

// Function ClonerEffector.CEClonerCircleLayout.SetAngleRatio
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCircleLayout_SetAngleRatio final
{
public:
	float                                         InAngleRatio;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCircleLayout_SetAngleRatio;

// Function ClonerEffector.CEClonerCircleLayout.SetAngleStart
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCircleLayout_SetAngleStart final
{
public:
	float                                         InAngleStart;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCircleLayout_SetAngleStart;

// Function ClonerEffector.CEClonerCircleLayout.SetCount
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCircleLayout_SetCount final
{
public:
	int32                                         InCount;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCircleLayout_SetCount;

// Function ClonerEffector.CEClonerCircleLayout.SetOrientMesh
// 0x0001 (0x0001 - 0x0000)
struct CEClonerCircleLayout_SetOrientMesh final
{
public:
	bool                                          bInOrientMesh;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCircleLayout_SetOrientMesh;

// Function ClonerEffector.CEClonerCircleLayout.SetPlane
// 0x0001 (0x0001 - 0x0000)
struct CEClonerCircleLayout_SetPlane final
{
public:
	ECEClonerPlane                                InPlane;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCircleLayout_SetPlane;

// Function ClonerEffector.CEClonerCircleLayout.SetRadius
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCircleLayout_SetRadius final
{
public:
	float                                         InRadius;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCircleLayout_SetRadius;

// Function ClonerEffector.CEClonerCircleLayout.SetRingCount
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCircleLayout_SetRingCount final
{
public:
	int32                                         InCount;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCircleLayout_SetRingCount;

// Function ClonerEffector.CEClonerCircleLayout.SetRotation
// 0x0018 (0x0018 - 0x0000)
struct CEClonerCircleLayout_SetRotation final
{
public:
	struct FRotator                               InRotation;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCircleLayout_SetRotation;

// Function ClonerEffector.CEClonerCircleLayout.SetScale
// 0x0018 (0x0018 - 0x0000)
struct CEClonerCircleLayout_SetScale final
{
public:
	struct FVector                                InScale;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCircleLayout_SetScale;

// Function ClonerEffector.CEClonerCircleLayout.GetAngleRatio
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCircleLayout_GetAngleRatio final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCircleLayout_GetAngleRatio;

// Function ClonerEffector.CEClonerCircleLayout.GetAngleStart
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCircleLayout_GetAngleStart final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCircleLayout_GetAngleStart;

// Function ClonerEffector.CEClonerCircleLayout.GetCount
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCircleLayout_GetCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCircleLayout_GetCount;

// Function ClonerEffector.CEClonerCircleLayout.GetOrientMesh
// 0x0001 (0x0001 - 0x0000)
struct CEClonerCircleLayout_GetOrientMesh final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCircleLayout_GetOrientMesh;

// Function ClonerEffector.CEClonerCircleLayout.GetPlane
// 0x0001 (0x0001 - 0x0000)
struct CEClonerCircleLayout_GetPlane final
{
public:
	ECEClonerPlane                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCircleLayout_GetPlane;

// Function ClonerEffector.CEClonerCircleLayout.GetRadius
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCircleLayout_GetRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCircleLayout_GetRadius;

// Function ClonerEffector.CEClonerCircleLayout.GetRingCount
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCircleLayout_GetRingCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCircleLayout_GetRingCount;

// Function ClonerEffector.CEClonerCircleLayout.GetRotation
// 0x0018 (0x0018 - 0x0000)
struct CEClonerCircleLayout_GetRotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCircleLayout_GetRotation;

// Function ClonerEffector.CEClonerCircleLayout.GetScale
// 0x0018 (0x0018 - 0x0000)
struct CEClonerCircleLayout_GetScale final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCircleLayout_GetScale;

// Function ClonerEffector.CEClonerComponent.SetColor
// 0x0010 (0x0010 - 0x0000)
struct CEClonerComponent_SetColor final
{
public:
	struct FLinearColor                           InColor;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_SetColor;

// Function ClonerEffector.CEClonerComponent.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct CEClonerComponent_SetEnabled final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_SetEnabled;

// Function ClonerEffector.CEClonerComponent.SetGlobalRotation
// 0x0018 (0x0018 - 0x0000)
struct CEClonerComponent_SetGlobalRotation final
{
public:
	struct FRotator                               InRotation;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_SetGlobalRotation;

// Function ClonerEffector.CEClonerComponent.SetGlobalScale
// 0x0018 (0x0018 - 0x0000)
struct CEClonerComponent_SetGlobalScale final
{
public:
	struct FVector                                InScale;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_SetGlobalScale;

// Function ClonerEffector.CEClonerComponent.SetLayoutClass
// 0x0008 (0x0008 - 0x0000)
struct CEClonerComponent_SetLayoutClass final
{
public:
	TSubclassOf<class UCEClonerLayoutBase>        InLayoutClass;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_SetLayoutClass;

// Function ClonerEffector.CEClonerComponent.SetLayoutName
// 0x0008 (0x0008 - 0x0000)
struct CEClonerComponent_SetLayoutName final
{
public:
	class FName                                   InLayoutName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_SetLayoutName;

// Function ClonerEffector.CEClonerComponent.SetSeed
// 0x0004 (0x0004 - 0x0000)
struct CEClonerComponent_SetSeed final
{
public:
	int32                                         InSeed;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_SetSeed;

// Function ClonerEffector.CEClonerComponent.GetActiveExtensions
// 0x0010 (0x0010 - 0x0000)
struct CEClonerComponent_GetActiveExtensions final
{
public:
	TArray<class UCEClonerExtensionBase*>         OutExtensions;                                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_GetActiveExtensions;

// Function ClonerEffector.CEClonerComponent.GetActiveLayout
// 0x0008 (0x0008 - 0x0000)
struct CEClonerComponent_GetActiveLayout final
{
public:
	class UCEClonerLayoutBase*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_GetActiveLayout;

// Function ClonerEffector.CEClonerComponent.GetAttachmentCount
// 0x0004 (0x0004 - 0x0000)
struct CEClonerComponent_GetAttachmentCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_GetAttachmentCount;

// Function ClonerEffector.CEClonerComponent.GetClonerLayoutNames
// 0x0010 (0x0010 - 0x0000)
struct CEClonerComponent_GetClonerLayoutNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_GetClonerLayoutNames;

// Function ClonerEffector.CEClonerComponent.GetClonerTreeBehaviorNames
// 0x0010 (0x0010 - 0x0000)
struct CEClonerComponent_GetClonerTreeBehaviorNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_GetClonerTreeBehaviorNames;

// Function ClonerEffector.CEClonerComponent.GetColor
// 0x0010 (0x0010 - 0x0000)
struct CEClonerComponent_GetColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_GetColor;

// Function ClonerEffector.CEClonerComponent.GetEnabled
// 0x0001 (0x0001 - 0x0000)
struct CEClonerComponent_GetEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_GetEnabled;

// Function ClonerEffector.CEClonerComponent.GetExtension
// 0x0010 (0x0010 - 0x0000)
struct CEClonerComponent_GetExtension final
{
public:
	TSubclassOf<class UCEClonerExtensionBase>     InExtensionClass;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCEClonerExtensionBase*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_GetExtension;

// Function ClonerEffector.CEClonerComponent.GetGlobalRotation
// 0x0018 (0x0018 - 0x0000)
struct CEClonerComponent_GetGlobalRotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_GetGlobalRotation;

// Function ClonerEffector.CEClonerComponent.GetGlobalScale
// 0x0018 (0x0018 - 0x0000)
struct CEClonerComponent_GetGlobalScale final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_GetGlobalScale;

// Function ClonerEffector.CEClonerComponent.GetLayoutClass
// 0x0008 (0x0008 - 0x0000)
struct CEClonerComponent_GetLayoutClass final
{
public:
	TSubclassOf<class UCEClonerLayoutBase>        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_GetLayoutClass;

// Function ClonerEffector.CEClonerComponent.GetLayoutName
// 0x0008 (0x0008 - 0x0000)
struct CEClonerComponent_GetLayoutName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_GetLayoutName;

// Function ClonerEffector.CEClonerComponent.GetMeshCount
// 0x0004 (0x0004 - 0x0000)
struct CEClonerComponent_GetMeshCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_GetMeshCount;

// Function ClonerEffector.CEClonerComponent.GetSeed
// 0x0004 (0x0004 - 0x0000)
struct CEClonerComponent_GetSeed final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerComponent_GetSeed;

// Function ClonerEffector.CEClonerExtensionBase.GetExtensionName
// 0x0008 (0x0008 - 0x0000)
struct CEClonerExtensionBase_GetExtensionName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerExtensionBase_GetExtensionName;

// Function ClonerEffector.CEClonerExtensionBase.IsExtensionActive
// 0x0001 (0x0001 - 0x0000)
struct CEClonerExtensionBase_IsExtensionActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerExtensionBase_IsExtensionActive;

// Function ClonerEffector.CEClonerCollisionExtension.SetCollisionGridResolution
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCollisionExtension_SetCollisionGridResolution final
{
public:
	int32                                         InCollisionGridResolution;                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCollisionExtension_SetCollisionGridResolution;

// Function ClonerEffector.CEClonerCollisionExtension.SetCollisionGridSize
// 0x0018 (0x0018 - 0x0000)
struct CEClonerCollisionExtension_SetCollisionGridSize final
{
public:
	struct FVector                                InCollisionGridSize;                               // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCollisionExtension_SetCollisionGridSize;

// Function ClonerEffector.CEClonerCollisionExtension.SetCollisionIterations
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCollisionExtension_SetCollisionIterations final
{
public:
	int32                                         InCollisionIterations;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCollisionExtension_SetCollisionIterations;

// Function ClonerEffector.CEClonerCollisionExtension.SetCollisionRadiusMode
// 0x0001 (0x0001 - 0x0000)
struct CEClonerCollisionExtension_SetCollisionRadiusMode final
{
public:
	ECEClonerCollisionRadiusMode                  InMode;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCollisionExtension_SetCollisionRadiusMode;

// Function ClonerEffector.CEClonerCollisionExtension.SetCollisionVelocityEnabled
// 0x0001 (0x0001 - 0x0000)
struct CEClonerCollisionExtension_SetCollisionVelocityEnabled final
{
public:
	bool                                          bInCollisionVelocityEnabled;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCollisionExtension_SetCollisionVelocityEnabled;

// Function ClonerEffector.CEClonerCollisionExtension.SetMassMax
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCollisionExtension_SetMassMax final
{
public:
	float                                         InMassMax;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCollisionExtension_SetMassMax;

// Function ClonerEffector.CEClonerCollisionExtension.SetMassMin
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCollisionExtension_SetMassMin final
{
public:
	float                                         InMassMin;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCollisionExtension_SetMassMin;

// Function ClonerEffector.CEClonerCollisionExtension.SetParticleCollisionEnabled
// 0x0001 (0x0001 - 0x0000)
struct CEClonerCollisionExtension_SetParticleCollisionEnabled final
{
public:
	bool                                          bInParticleCollisionEnabled;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCollisionExtension_SetParticleCollisionEnabled;

// Function ClonerEffector.CEClonerCollisionExtension.SetSurfaceCollisionEnabled
// 0x0001 (0x0001 - 0x0000)
struct CEClonerCollisionExtension_SetSurfaceCollisionEnabled final
{
public:
	bool                                          bInSurfaceCollisionEnabled;                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCollisionExtension_SetSurfaceCollisionEnabled;

// Function ClonerEffector.CEClonerCollisionExtension.GetCollisionGridResolution
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCollisionExtension_GetCollisionGridResolution final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCollisionExtension_GetCollisionGridResolution;

// Function ClonerEffector.CEClonerCollisionExtension.GetCollisionGridSize
// 0x0018 (0x0018 - 0x0000)
struct CEClonerCollisionExtension_GetCollisionGridSize final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCollisionExtension_GetCollisionGridSize;

// Function ClonerEffector.CEClonerCollisionExtension.GetCollisionIterations
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCollisionExtension_GetCollisionIterations final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCollisionExtension_GetCollisionIterations;

// Function ClonerEffector.CEClonerCollisionExtension.GetCollisionRadii
// 0x0010 (0x0010 - 0x0000)
struct CEClonerCollisionExtension_GetCollisionRadii final
{
public:
	TArray<float>                                 ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCollisionExtension_GetCollisionRadii;

// Function ClonerEffector.CEClonerCollisionExtension.GetCollisionRadiusMode
// 0x0001 (0x0001 - 0x0000)
struct CEClonerCollisionExtension_GetCollisionRadiusMode final
{
public:
	ECEClonerCollisionRadiusMode                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCollisionExtension_GetCollisionRadiusMode;

// Function ClonerEffector.CEClonerCollisionExtension.GetCollisionVelocityEnabled
// 0x0001 (0x0001 - 0x0000)
struct CEClonerCollisionExtension_GetCollisionVelocityEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCollisionExtension_GetCollisionVelocityEnabled;

// Function ClonerEffector.CEClonerCollisionExtension.GetMassMax
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCollisionExtension_GetMassMax final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCollisionExtension_GetMassMax;

// Function ClonerEffector.CEClonerCollisionExtension.GetMassMin
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCollisionExtension_GetMassMin final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCollisionExtension_GetMassMin;

// Function ClonerEffector.CEClonerCollisionExtension.GetParticleCollisionEnabled
// 0x0001 (0x0001 - 0x0000)
struct CEClonerCollisionExtension_GetParticleCollisionEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCollisionExtension_GetParticleCollisionEnabled;

// Function ClonerEffector.CEClonerCollisionExtension.GetSurfaceCollisionEnabled
// 0x0001 (0x0001 - 0x0000)
struct CEClonerCollisionExtension_GetSurfaceCollisionEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCollisionExtension_GetSurfaceCollisionEnabled;

// Function ClonerEffector.CEClonerConstraintExtension.SetConstraint
// 0x0001 (0x0001 - 0x0000)
struct CEClonerConstraintExtension_SetConstraint final
{
public:
	ECEClonerGridConstraint                       InConstraint;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_SetConstraint;

// Function ClonerEffector.CEClonerConstraintExtension.SetCylinderCenter
// 0x0018 (0x0018 - 0x0000)
struct CEClonerConstraintExtension_SetCylinderCenter final
{
public:
	struct FVector                                InCylinderCenter;                                  // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_SetCylinderCenter;

// Function ClonerEffector.CEClonerConstraintExtension.SetCylinderHeight
// 0x0004 (0x0004 - 0x0000)
struct CEClonerConstraintExtension_SetCylinderHeight final
{
public:
	float                                         InCylinderHeight;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_SetCylinderHeight;

// Function ClonerEffector.CEClonerConstraintExtension.SetCylinderRadius
// 0x0004 (0x0004 - 0x0000)
struct CEClonerConstraintExtension_SetCylinderRadius final
{
public:
	float                                         InCylinderRadius;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_SetCylinderRadius;

// Function ClonerEffector.CEClonerConstraintExtension.SetInvertConstraint
// 0x0001 (0x0001 - 0x0000)
struct CEClonerConstraintExtension_SetInvertConstraint final
{
public:
	bool                                          bInInvertConstraint;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_SetInvertConstraint;

// Function ClonerEffector.CEClonerConstraintExtension.SetSphereCenter
// 0x0018 (0x0018 - 0x0000)
struct CEClonerConstraintExtension_SetSphereCenter final
{
public:
	struct FVector                                InSphereCenter;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_SetSphereCenter;

// Function ClonerEffector.CEClonerConstraintExtension.SetSphereRadius
// 0x0004 (0x0004 - 0x0000)
struct CEClonerConstraintExtension_SetSphereRadius final
{
public:
	float                                         InSphereRadius;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_SetSphereRadius;

// Function ClonerEffector.CEClonerConstraintExtension.SetTextureAsset
// 0x0008 (0x0008 - 0x0000)
struct CEClonerConstraintExtension_SetTextureAsset final
{
public:
	class UTexture*                               InTexture;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_SetTextureAsset;

// Function ClonerEffector.CEClonerConstraintExtension.SetTextureClamp
// 0x0001 (0x0001 - 0x0000)
struct CEClonerConstraintExtension_SetTextureClamp final
{
public:
	bool                                          bInClamp;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_SetTextureClamp;

// Function ClonerEffector.CEClonerConstraintExtension.SetTextureCompareMode
// 0x0001 (0x0001 - 0x0000)
struct CEClonerConstraintExtension_SetTextureCompareMode final
{
public:
	ECEClonerCompareMode                          InMode;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_SetTextureCompareMode;

// Function ClonerEffector.CEClonerConstraintExtension.SetTextureOffset
// 0x0010 (0x0010 - 0x0000)
struct CEClonerConstraintExtension_SetTextureOffset final
{
public:
	struct FVector2D                              InOffset;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_SetTextureOffset;

// Function ClonerEffector.CEClonerConstraintExtension.SetTexturePlane
// 0x0001 (0x0001 - 0x0000)
struct CEClonerConstraintExtension_SetTexturePlane final
{
public:
	ECEClonerPlane                                InPlane;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_SetTexturePlane;

// Function ClonerEffector.CEClonerConstraintExtension.SetTextureRotation
// 0x0004 (0x0004 - 0x0000)
struct CEClonerConstraintExtension_SetTextureRotation final
{
public:
	float                                         InRotation;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_SetTextureRotation;

// Function ClonerEffector.CEClonerConstraintExtension.SetTextureSampleMode
// 0x0001 (0x0001 - 0x0000)
struct CEClonerConstraintExtension_SetTextureSampleMode final
{
public:
	ECEClonerTextureSampleChannel                 InSampleMode;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_SetTextureSampleMode;

// Function ClonerEffector.CEClonerConstraintExtension.SetTextureScale
// 0x0010 (0x0010 - 0x0000)
struct CEClonerConstraintExtension_SetTextureScale final
{
public:
	struct FVector2D                              InScale;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_SetTextureScale;

// Function ClonerEffector.CEClonerConstraintExtension.SetTextureThreshold
// 0x0004 (0x0004 - 0x0000)
struct CEClonerConstraintExtension_SetTextureThreshold final
{
public:
	float                                         InThreshold;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_SetTextureThreshold;

// Function ClonerEffector.CEClonerConstraintExtension.GetConstraint
// 0x0001 (0x0001 - 0x0000)
struct CEClonerConstraintExtension_GetConstraint final
{
public:
	ECEClonerGridConstraint                       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_GetConstraint;

// Function ClonerEffector.CEClonerConstraintExtension.GetCylinderCenter
// 0x0018 (0x0018 - 0x0000)
struct CEClonerConstraintExtension_GetCylinderCenter final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_GetCylinderCenter;

// Function ClonerEffector.CEClonerConstraintExtension.GetCylinderHeight
// 0x0004 (0x0004 - 0x0000)
struct CEClonerConstraintExtension_GetCylinderHeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_GetCylinderHeight;

// Function ClonerEffector.CEClonerConstraintExtension.GetCylinderRadius
// 0x0004 (0x0004 - 0x0000)
struct CEClonerConstraintExtension_GetCylinderRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_GetCylinderRadius;

// Function ClonerEffector.CEClonerConstraintExtension.GetInvertConstraint
// 0x0001 (0x0001 - 0x0000)
struct CEClonerConstraintExtension_GetInvertConstraint final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_GetInvertConstraint;

// Function ClonerEffector.CEClonerConstraintExtension.GetSphereCenter
// 0x0018 (0x0018 - 0x0000)
struct CEClonerConstraintExtension_GetSphereCenter final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_GetSphereCenter;

// Function ClonerEffector.CEClonerConstraintExtension.GetSphereRadius
// 0x0004 (0x0004 - 0x0000)
struct CEClonerConstraintExtension_GetSphereRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_GetSphereRadius;

// Function ClonerEffector.CEClonerConstraintExtension.GetTextureAsset
// 0x0008 (0x0008 - 0x0000)
struct CEClonerConstraintExtension_GetTextureAsset final
{
public:
	class UTexture*                               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_GetTextureAsset;

// Function ClonerEffector.CEClonerConstraintExtension.GetTextureClamp
// 0x0001 (0x0001 - 0x0000)
struct CEClonerConstraintExtension_GetTextureClamp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_GetTextureClamp;

// Function ClonerEffector.CEClonerConstraintExtension.GetTextureCompareMode
// 0x0001 (0x0001 - 0x0000)
struct CEClonerConstraintExtension_GetTextureCompareMode final
{
public:
	ECEClonerCompareMode                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_GetTextureCompareMode;

// Function ClonerEffector.CEClonerConstraintExtension.GetTextureOffset
// 0x0010 (0x0010 - 0x0000)
struct CEClonerConstraintExtension_GetTextureOffset final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_GetTextureOffset;

// Function ClonerEffector.CEClonerConstraintExtension.GetTexturePlane
// 0x0001 (0x0001 - 0x0000)
struct CEClonerConstraintExtension_GetTexturePlane final
{
public:
	ECEClonerPlane                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_GetTexturePlane;

// Function ClonerEffector.CEClonerConstraintExtension.GetTextureRotation
// 0x0004 (0x0004 - 0x0000)
struct CEClonerConstraintExtension_GetTextureRotation final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_GetTextureRotation;

// Function ClonerEffector.CEClonerConstraintExtension.GetTextureSampleMode
// 0x0001 (0x0001 - 0x0000)
struct CEClonerConstraintExtension_GetTextureSampleMode final
{
public:
	ECEClonerTextureSampleChannel                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_GetTextureSampleMode;

// Function ClonerEffector.CEClonerConstraintExtension.GetTextureScale
// 0x0010 (0x0010 - 0x0000)
struct CEClonerConstraintExtension_GetTextureScale final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_GetTextureScale;

// Function ClonerEffector.CEClonerConstraintExtension.GetTextureThreshold
// 0x0004 (0x0004 - 0x0000)
struct CEClonerConstraintExtension_GetTextureThreshold final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerConstraintExtension_GetTextureThreshold;

// Function ClonerEffector.CEClonerCylinderLayout.SetAngleRatio
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCylinderLayout_SetAngleRatio final
{
public:
	float                                         InAngleRatio;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCylinderLayout_SetAngleRatio;

// Function ClonerEffector.CEClonerCylinderLayout.SetAngleStart
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCylinderLayout_SetAngleStart final
{
public:
	float                                         InAngleStart;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCylinderLayout_SetAngleStart;

// Function ClonerEffector.CEClonerCylinderLayout.SetBaseCount
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCylinderLayout_SetBaseCount final
{
public:
	int32                                         InBaseCount;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCylinderLayout_SetBaseCount;

// Function ClonerEffector.CEClonerCylinderLayout.SetHeight
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCylinderLayout_SetHeight final
{
public:
	float                                         InHeight;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCylinderLayout_SetHeight;

// Function ClonerEffector.CEClonerCylinderLayout.SetHeightCount
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCylinderLayout_SetHeightCount final
{
public:
	int32                                         InHeightCount;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCylinderLayout_SetHeightCount;

// Function ClonerEffector.CEClonerCylinderLayout.SetOrientMesh
// 0x0001 (0x0001 - 0x0000)
struct CEClonerCylinderLayout_SetOrientMesh final
{
public:
	bool                                          bInOrientMesh;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCylinderLayout_SetOrientMesh;

// Function ClonerEffector.CEClonerCylinderLayout.SetPlane
// 0x0001 (0x0001 - 0x0000)
struct CEClonerCylinderLayout_SetPlane final
{
public:
	ECEClonerPlane                                InPlane;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCylinderLayout_SetPlane;

// Function ClonerEffector.CEClonerCylinderLayout.SetRadius
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCylinderLayout_SetRadius final
{
public:
	float                                         InRadius;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCylinderLayout_SetRadius;

// Function ClonerEffector.CEClonerCylinderLayout.SetRotation
// 0x0018 (0x0018 - 0x0000)
struct CEClonerCylinderLayout_SetRotation final
{
public:
	struct FRotator                               InRotation;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCylinderLayout_SetRotation;

// Function ClonerEffector.CEClonerCylinderLayout.SetScale
// 0x0018 (0x0018 - 0x0000)
struct CEClonerCylinderLayout_SetScale final
{
public:
	struct FVector                                InScale;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCylinderLayout_SetScale;

// Function ClonerEffector.CEClonerCylinderLayout.GetAngleRatio
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCylinderLayout_GetAngleRatio final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCylinderLayout_GetAngleRatio;

// Function ClonerEffector.CEClonerCylinderLayout.GetAngleStart
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCylinderLayout_GetAngleStart final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCylinderLayout_GetAngleStart;

// Function ClonerEffector.CEClonerCylinderLayout.GetBaseCount
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCylinderLayout_GetBaseCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCylinderLayout_GetBaseCount;

// Function ClonerEffector.CEClonerCylinderLayout.GetHeight
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCylinderLayout_GetHeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCylinderLayout_GetHeight;

// Function ClonerEffector.CEClonerCylinderLayout.GetHeightCount
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCylinderLayout_GetHeightCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCylinderLayout_GetHeightCount;

// Function ClonerEffector.CEClonerCylinderLayout.GetOrientMesh
// 0x0001 (0x0001 - 0x0000)
struct CEClonerCylinderLayout_GetOrientMesh final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCylinderLayout_GetOrientMesh;

// Function ClonerEffector.CEClonerCylinderLayout.GetPlane
// 0x0001 (0x0001 - 0x0000)
struct CEClonerCylinderLayout_GetPlane final
{
public:
	ECEClonerPlane                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCylinderLayout_GetPlane;

// Function ClonerEffector.CEClonerCylinderLayout.GetRadius
// 0x0004 (0x0004 - 0x0000)
struct CEClonerCylinderLayout_GetRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCylinderLayout_GetRadius;

// Function ClonerEffector.CEClonerCylinderLayout.GetRotation
// 0x0018 (0x0018 - 0x0000)
struct CEClonerCylinderLayout_GetRotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCylinderLayout_GetRotation;

// Function ClonerEffector.CEClonerCylinderLayout.GetScale
// 0x0018 (0x0018 - 0x0000)
struct CEClonerCylinderLayout_GetScale final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerCylinderLayout_GetScale;

// Function ClonerEffector.CEClonerDisplacementExtension.SetDisplacementEnabled
// 0x0001 (0x0001 - 0x0000)
struct CEClonerDisplacementExtension_SetDisplacementEnabled final
{
public:
	bool                                          bInEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerDisplacementExtension_SetDisplacementEnabled;

// Function ClonerEffector.CEClonerDisplacementExtension.SetDisplacementInvert
// 0x0001 (0x0001 - 0x0000)
struct CEClonerDisplacementExtension_SetDisplacementInvert final
{
public:
	bool                                          bInInvert;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerDisplacementExtension_SetDisplacementInvert;

// Function ClonerEffector.CEClonerDisplacementExtension.SetDisplacementOffsetMax
// 0x0018 (0x0018 - 0x0000)
struct CEClonerDisplacementExtension_SetDisplacementOffsetMax final
{
public:
	struct FVector                                InMax;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerDisplacementExtension_SetDisplacementOffsetMax;

// Function ClonerEffector.CEClonerDisplacementExtension.SetDisplacementRotationMax
// 0x0018 (0x0018 - 0x0000)
struct CEClonerDisplacementExtension_SetDisplacementRotationMax final
{
public:
	struct FRotator                               InMax;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerDisplacementExtension_SetDisplacementRotationMax;

// Function ClonerEffector.CEClonerDisplacementExtension.SetDisplacementScaleMax
// 0x0018 (0x0018 - 0x0000)
struct CEClonerDisplacementExtension_SetDisplacementScaleMax final
{
public:
	struct FVector                                InMax;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerDisplacementExtension_SetDisplacementScaleMax;

// Function ClonerEffector.CEClonerDisplacementExtension.SetDisplacementTextureAsset
// 0x0008 (0x0008 - 0x0000)
struct CEClonerDisplacementExtension_SetDisplacementTextureAsset final
{
public:
	class UTexture*                               InTexture;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerDisplacementExtension_SetDisplacementTextureAsset;

// Function ClonerEffector.CEClonerDisplacementExtension.SetDisplacementTextureClamp
// 0x0001 (0x0001 - 0x0000)
struct CEClonerDisplacementExtension_SetDisplacementTextureClamp final
{
public:
	bool                                          bInClamp;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerDisplacementExtension_SetDisplacementTextureClamp;

// Function ClonerEffector.CEClonerDisplacementExtension.SetDisplacementTextureOffset
// 0x0010 (0x0010 - 0x0000)
struct CEClonerDisplacementExtension_SetDisplacementTextureOffset final
{
public:
	struct FVector2D                              InOffset;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerDisplacementExtension_SetDisplacementTextureOffset;

// Function ClonerEffector.CEClonerDisplacementExtension.SetDisplacementTexturePlane
// 0x0001 (0x0001 - 0x0000)
struct CEClonerDisplacementExtension_SetDisplacementTexturePlane final
{
public:
	ECEClonerPlane                                InPlane;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerDisplacementExtension_SetDisplacementTexturePlane;

// Function ClonerEffector.CEClonerDisplacementExtension.SetDisplacementTextureRotation
// 0x0004 (0x0004 - 0x0000)
struct CEClonerDisplacementExtension_SetDisplacementTextureRotation final
{
public:
	float                                         InRotation;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerDisplacementExtension_SetDisplacementTextureRotation;

// Function ClonerEffector.CEClonerDisplacementExtension.SetDisplacementTextureSampleMode
// 0x0001 (0x0001 - 0x0000)
struct CEClonerDisplacementExtension_SetDisplacementTextureSampleMode final
{
public:
	ECEClonerTextureSampleChannel                 InSampleMode;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerDisplacementExtension_SetDisplacementTextureSampleMode;

// Function ClonerEffector.CEClonerDisplacementExtension.SetDisplacementTextureScale
// 0x0010 (0x0010 - 0x0000)
struct CEClonerDisplacementExtension_SetDisplacementTextureScale final
{
public:
	struct FVector2D                              InScale;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CEClonerDisplacementExtension_SetDisplacementTextureScale;

// Function ClonerEffector.CEClonerDisplacementExtension.GetDisplacementEnabled
// 0x0001 (0x0001 - 0x0000)
struct CEClonerDisplacementExtension_GetDisplacementEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
