#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClonerEffector

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ClonerEffector_structs.hpp"
#include "Niagara_structs.hpp"
#include "Niagara_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ClonerEffectorMeshBuilder_structs.hpp"
#include "DeveloperSettings_classes.hpp"


SDK_NAMESPACE_START

// Class ClonerEffector.CEClonerActor
// 0x0290 (0x0538 - 0x02A8)
class ACEClonerActor final : public AActor
{
public:
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCEClonerComponent*                     ClonerComponent;                                   // 0x02B0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	bool                                          bEnabled;                                          // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TreeUpdateInterval;                                // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         Seed;                                              // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           Color;                                             // 0x02C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bVisualizeEffectors;                               // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECEClonerMeshRenderMode                       MeshRenderMode;                                    // 0x02D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraMeshFacingMode                        MeshFacingMode;                                    // 0x02D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bMeshCastShadows;                                  // 0x02D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UStaticMesh*>                    DefaultMeshes;                                     // 0x02D8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	bool                                          bUseOverrideMaterial;                              // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     OverrideMaterial;                                  // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	bool                                          bSurfaceCollisionEnabled;                          // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bParticleCollisionEnabled;                         // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCollisionVelocityEnabled;                         // 0x02FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2FB[0x1];                                      // 0x02FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CollisionIterations;                               // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         CollisionGridResolution;                           // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CollisionGridSize;                                 // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECEClonerCollisionRadiusMode                  CollisionRadiusMode;                               // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CollisionRadii;                                    // 0x0328(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	float                                         MassMin;                                           // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MassMax;                                           // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECEClonerSpawnLoopMode                        SpawnLoopMode;                                     // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpawnLoopIterations;                               // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SpawnLoopInterval;                                 // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECEClonerSpawnBehaviorMode                    SpawnBehaviorMode;                                 // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpawnRate;                                         // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLifetimeEnabled;                                  // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LifetimeMin;                                       // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LifetimeMax;                                       // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLifetimeScaleEnabled;                             // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRichCurve                             LifetimeScaleCurve;                                // 0x0368(0x0080)(NativeAccessSpecifierPrivate)
	class FName                                   LayoutName;                                        // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDeltaStepEnabled;                                 // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               DeltaStepRotation;                                 // 0x03F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FVector                                DeltaStepScale;                                    // 0x0410(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bRangeEnabled;                                     // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RangeOffsetMin;                                    // 0x0430(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                RangeOffsetMax;                                    // 0x0448(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                               RangeRotationMin;                                  // 0x0460(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FRotator                               RangeRotationMax;                                  // 0x0478(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bRangeScaleUniform;                                // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RangeScaleMin;                                     // 0x0498(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                RangeScaleMax;                                     // 0x04B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RangeScaleUniformMin;                              // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RangeScaleUniformMax;                              // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bInvertProgress;                                   // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4D1[0x3];                                      // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Progress;                                          // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class ACEEffectorActor>> EffectorsWeak;                                    // 0x04D8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class FName, class UCEClonerLayoutBase*> LayoutInstances;                                   // 0x04E8(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	class UCEClonerComponent* GetClonerComponent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CEClonerActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CEClonerActor")
	}
	static class ACEClonerActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACEClonerActor>();
	}
};
DUMPER7_ASSERTS_ACEClonerActor;

// Class ClonerEffector.CEClonerLayoutBase
// 0x0058 (0x0080 - 0x0028)
class UCEClonerLayoutBase : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LayoutName;                                        // 0x0040(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 LayoutAssetPath;                                   // 0x0048(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UNiagaraSystem*                         NiagaraSystem;                                     // 0x0058(0x0008)(ZeroConstructor, DuplicateTransient, NoDestructor, TextExportTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UNiagaraMeshRendererProperties*         MeshRenderer;                                      // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, TextExportTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FString                                 CachedSystemHash;                                  // 0x0068(0x0010)(ZeroConstructor, DuplicateTransient, TextExportTransient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FName GetLayoutName() const;
	bool IsLayoutActive() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CEClonerLayoutBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CEClonerLayoutBase")
	}
	static class UCEClonerLayoutBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCEClonerLayoutBase>();
	}
};
DUMPER7_ASSERTS_UCEClonerLayoutBase;

// Class ClonerEffector.CEClonerCircleLayout
// 0x0048 (0x00C8 - 0x0080)
class UCEClonerCircleLayout final : public UCEClonerLayoutBase
{
public:
	int32                                         Count;                                             // 0x0080(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         RingCount;                                         // 0x0084(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Radius;                                            // 0x0088(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AngleStart;                                        // 0x008C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AngleRatio;                                        // 0x0090(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOrientMesh;                                       // 0x0094(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECEClonerPlane                                Plane;                                             // 0x0095(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Rotation;                                          // 0x0098(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                                Scale;                                             // 0x00B0(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetAngleRatio(float InAngleRatio);
	void SetAngleStart(float InAngleStart);
	void SetCount(int32 InCount);
	void SetOrientMesh(bool bInOrientMesh);
	void SetPlane(ECEClonerPlane InPlane);
	void SetRadius(float InRadius);
	void SetRingCount(int32 InCount);
	void SetRotation(const struct FRotator& InRotation);
	void SetScale(const struct FVector& InScale);

	float GetAngleRatio() const;
	float GetAngleStart() const;
	int32 GetCount() const;
	bool GetOrientMesh() const;
	ECEClonerPlane GetPlane() const;
	float GetRadius() const;
	int32 GetRingCount() const;
	const struct FRotator GetRotation() const;
	const struct FVector GetScale() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CEClonerCircleLayout")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CEClonerCircleLayout")
	}
	static class UCEClonerCircleLayout* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCEClonerCircleLayout>();
	}
};
DUMPER7_ASSERTS_UCEClonerCircleLayout;

// Class ClonerEffector.CEClonerComponent
// 0x0220 (0x09D0 - 0x07B0)
class UCEClonerComponent final : public UNiagaraComponent
{
public:
	bool                                          bEnabled;                                          // 0x07B0(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7B1[0x3];                                      // 0x07B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Seed;                                              // 0x07B4(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           Color;                                             // 0x07B8(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                GlobalScale;                                       // 0x07C8(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               GlobalRotation;                                    // 0x07E0(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class FName                                   TreeBehaviorName;                                  // 0x07F8(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   LayoutName;                                        // 0x0800(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCEClonerLayoutBase*                    ActiveLayout;                                      // 0x0808(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<class UCEClonerExtensionBase*>         ActiveExtensions;                                  // 0x0810(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<class UCEClonerLayoutBase*>            LayoutInstances;                                   // 0x0820(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<class UCEClonerExtensionBase*>         ExtensionInstances;                                // 0x0830(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	struct FCEClonerAttachmentTree                ClonerTree;                                        // 0x0840(0x0108)(NonTransactional, NativeAccessSpecifierPrivate)
	struct FCEMeshBuilder                         MeshBuilder;                                       // 0x0948(0x0068)(Transient, DuplicateTransient, NonTransactional, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9B0[0x20];                                     // 0x09B0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetColor(const struct FLinearColor& InColor);
	void SetEnabled(bool bInEnable);
	void SetGlobalRotation(const struct FRotator& InRotation);
	void SetGlobalScale(const struct FVector& InScale);
	void SetLayoutClass(TSubclassOf<class UCEClonerLayoutBase> InLayoutClass);
	void SetLayoutName(class FName InLayoutName);
	void SetSeed(int32 InSeed);

	void GetActiveExtensions(TArray<class UCEClonerExtensionBase*>* OutExtensions) const;
	class UCEClonerLayoutBase* GetActiveLayout() const;
	int32 GetAttachmentCount() const;
	TArray<class FName> GetClonerLayoutNames() const;
	TArray<class FName> GetClonerTreeBehaviorNames() const;
	const struct FLinearColor GetColor() const;
	bool GetEnabled() const;
	class UCEClonerExtensionBase* GetExtension(TSubclassOf<class UCEClonerExtensionBase> InExtensionClass) const;
	const struct FRotator GetGlobalRotation() const;
	const struct FVector GetGlobalScale() const;
	TSubclassOf<class UCEClonerLayoutBase> GetLayoutClass() const;
	class FName GetLayoutName() const;
	int32 GetMeshCount() const;
	int32 GetSeed() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CEClonerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CEClonerComponent")
	}
	static class UCEClonerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCEClonerComponent>();
	}
};
DUMPER7_ASSERTS_UCEClonerComponent;

// Class ClonerEffector.CEClonerExtensionBase
// 0x0010 (0x0038 - 0x0028)
class UCEClonerExtensionBase : public UObject
{
public:
	class FName                                   ExtensionName;                                     // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ExtensionPriority;                                 // 0x0030(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FName GetExtensionName() const;
	bool IsExtensionActive() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CEClonerExtensionBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CEClonerExtensionBase")
	}
	static class UCEClonerExtensionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCEClonerExtensionBase>();
	}
};
DUMPER7_ASSERTS_UCEClonerExtensionBase;

// Class ClonerEffector.CEClonerCollisionExtension
// 0x0048 (0x0080 - 0x0038)
class UCEClonerCollisionExtension final : public UCEClonerExtensionBase
{
public:
	bool                                          bSurfaceCollisionEnabled;                          // 0x0038(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bParticleCollisionEnabled;                         // 0x0039(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCollisionVelocityEnabled;                         // 0x003A(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CollisionIterations;                               // 0x003C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CollisionGridResolution;                           // 0x0040(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CollisionGridSize;                                 // 0x0048(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECEClonerCollisionRadiusMode                  CollisionRadiusMode;                               // 0x0060(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CollisionRadii;                                    // 0x0068(0x0010)(Edit, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	float                                         MassMin;                                           // 0x0078(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MassMax;                                           // 0x007C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetCollisionGridResolution(int32 InCollisionGridResolution);
	void SetCollisionGridSize(const struct FVector& InCollisionGridSize);
	void SetCollisionIterations(int32 InCollisionIterations);
	void SetCollisionRadiusMode(ECEClonerCollisionRadiusMode InMode);
	void SetCollisionVelocityEnabled(bool bInCollisionVelocityEnabled);
	void SetMassMax(float InMassMax);
	void SetMassMin(float InMassMin);
	void SetParticleCollisionEnabled(bool bInParticleCollisionEnabled);
	void SetSurfaceCollisionEnabled(bool bInSurfaceCollisionEnabled);

	int32 GetCollisionGridResolution() const;
	struct FVector GetCollisionGridSize() const;
	int32 GetCollisionIterations() const;
	const TArray<float> GetCollisionRadii() const;
	ECEClonerCollisionRadiusMode GetCollisionRadiusMode() const;
	bool GetCollisionVelocityEnabled() const;
	float GetMassMax() const;
	float GetMassMin() const;
	bool GetParticleCollisionEnabled() const;
	bool GetSurfaceCollisionEnabled() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CEClonerCollisionExtension")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CEClonerCollisionExtension")
	}
	static class UCEClonerCollisionExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCEClonerCollisionExtension>();
	}
};
DUMPER7_ASSERTS_UCEClonerCollisionExtension;

// Class ClonerEffector.CEClonerConstraintExtension
// 0x0080 (0x00B8 - 0x0038)
class UCEClonerConstraintExtension final : public UCEClonerExtensionBase
{
public:
	ECEClonerGridConstraint                       Constraint;                                        // 0x0038(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInvertConstraint;                                 // 0x0039(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SphereRadius;                                      // 0x003C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                SphereCenter;                                      // 0x0040(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CylinderRadius;                                    // 0x0058(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CylinderHeight;                                    // 0x005C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                CylinderCenter;                                    // 0x0060(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture*                               TextureAsset;                                      // 0x0078(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	ECEClonerPlane                                TexturePlane;                                      // 0x0080(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECEClonerTextureSampleChannel                 TextureSampleMode;                                 // 0x0081(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECEClonerCompareMode                          TextureCompareMode;                                // 0x0082(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TextureThreshold;                                  // 0x0084(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              TextureOffset;                                     // 0x0088(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TextureRotation;                                   // 0x0098(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              TextureScale;                                      // 0x00A0(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTextureClamp;                                     // 0x00B0(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetConstraint(ECEClonerGridConstraint InConstraint);
	void SetCylinderCenter(const struct FVector& InCylinderCenter);
	void SetCylinderHeight(float InCylinderHeight);
	void SetCylinderRadius(float InCylinderRadius);
	void SetInvertConstraint(bool bInInvertConstraint);
	void SetSphereCenter(const struct FVector& InSphereCenter);
	void SetSphereRadius(float InSphereRadius);
	void SetTextureAsset(class UTexture* InTexture);
	void SetTextureClamp(bool bInClamp);
	void SetTextureCompareMode(ECEClonerCompareMode InMode);
	void SetTextureOffset(const struct FVector2D& InOffset);
	void SetTexturePlane(ECEClonerPlane InPlane);
	void SetTextureRotation(float InRotation);
	void SetTextureSampleMode(ECEClonerTextureSampleChannel InSampleMode);
	void SetTextureScale(const struct FVector2D& InScale);
	void SetTextureThreshold(float InThreshold);

	ECEClonerGridConstraint GetConstraint() const;
	struct FVector GetCylinderCenter() const;
	float GetCylinderHeight() const;
	float GetCylinderRadius() const;
	bool GetInvertConstraint() const;
	struct FVector GetSphereCenter() const;
	float GetSphereRadius() const;
	class UTexture* GetTextureAsset() const;
	bool GetTextureClamp() const;
	ECEClonerCompareMode GetTextureCompareMode() const;
	struct FVector2D GetTextureOffset() const;
	ECEClonerPlane GetTexturePlane() const;
	float GetTextureRotation() const;
	ECEClonerTextureSampleChannel GetTextureSampleMode() const;
	struct FVector2D GetTextureScale() const;
	float GetTextureThreshold() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CEClonerConstraintExtension")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CEClonerConstraintExtension")
	}
	static class UCEClonerConstraintExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCEClonerConstraintExtension>();
	}
};
DUMPER7_ASSERTS_UCEClonerConstraintExtension;

// Class ClonerEffector.CEClonerCylinderLayout
// 0x0050 (0x00D0 - 0x0080)
class UCEClonerCylinderLayout final : public UCEClonerLayoutBase
{
public:
	int32                                         BaseCount;                                         // 0x0080(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         HeightCount;                                       // 0x0084(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Height;                                            // 0x0088(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Radius;                                            // 0x008C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AngleStart;                                        // 0x0090(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AngleRatio;                                        // 0x0094(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOrientMesh;                                       // 0x0098(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECEClonerPlane                                Plane;                                             // 0x0099(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Rotation;                                          // 0x00A0(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                                Scale;                                             // 0x00B8(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetAngleRatio(float InAngleRatio);
	void SetAngleStart(float InAngleStart);
	void SetBaseCount(int32 InBaseCount);
	void SetHeight(float InHeight);
	void SetHeightCount(int32 InHeightCount);
	void SetOrientMesh(bool bInOrientMesh);
	void SetPlane(ECEClonerPlane InPlane);
	void SetRadius(float InRadius);
	void SetRotation(const struct FRotator& InRotation);
	void SetScale(const struct FVector& InScale);

	float GetAngleRatio() const;
	float GetAngleStart() const;
	int32 GetBaseCount() const;
	float GetHeight() const;
	int32 GetHeightCount() const;
	bool GetOrientMesh() const;
	ECEClonerPlane GetPlane() const;
	float GetRadius() const;
	const struct FRotator GetRotation() const;
	const struct FVector GetScale() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CEClonerCylinderLayout")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CEClonerCylinderLayout")
	}
	static class UCEClonerCylinderLayout* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCEClonerCylinderLayout>();
	}
};
DUMPER7_ASSERTS_UCEClonerCylinderLayout;

// Class ClonerEffector.CEClonerDisplacementExtension
// 0x0090 (0x00C8 - 0x0038)
class UCEClonerDisplacementExtension final : public UCEClonerExtensionBase
{
public:
	bool                                          bDisplacementEnabled;                              // 0x0038(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisplacementInvert;                               // 0x0039(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DisplacementOffsetMax;                             // 0x0040(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               DisplacementRotationMax;                           // 0x0058(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                                DisplacementScaleMax;                              // 0x0070(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture*                               DisplacementTextureAsset;                          // 0x0088(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	ECEClonerPlane                                DisplacementTexturePlane;                          // 0x0090(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECEClonerTextureSampleChannel                 DisplacementTextureSampleMode;                     // 0x0091(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              DisplacementTextureOffset;                         // 0x0098(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DisplacementTextureRotation;                       // 0x00A8(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              DisplacementTextureScale;                          // 0x00B0(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisplacementTextureClamp;                         // 0x00C0(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetDisplacementEnabled(bool bInEnabled);
	void SetDisplacementInvert(bool bInInvert);
	void SetDisplacementOffsetMax(const struct FVector& InMax);
	void SetDisplacementRotationMax(const struct FRotator& InMax);
	void SetDisplacementScaleMax(const struct FVector& InMax);
	void SetDisplacementTextureAsset(class UTexture* InTexture);
	void SetDisplacementTextureClamp(bool bInClamp);
	void SetDisplacementTextureOffset(const struct FVector2D& InOffset);
	void SetDisplacementTexturePlane(ECEClonerPlane InPlane);
	void SetDisplacementTextureRotation(float InRotation);
	void SetDisplacementTextureSampleMode(ECEClonerTextureSampleChannel InSampleMode);
	void SetDisplacementTextureScale(const struct FVector2D& InScale);

	bool GetDisplacementEnabled() const;
	bool GetDisplacementInvert() const;
	const struct FVector GetDisplacementOffsetMax() const;
	const struct FRotator GetDisplacementRotationMax() const;
	const struct FVector GetDisplacementScaleMax() const;
	class UTexture* GetDisplacementTextureAsset() const;
	bool GetDisplacementTextureClamp() const;
	struct FVector2D GetDisplacementTextureOffset() const;
	ECEClonerPlane GetDisplacementTexturePlane() const;
	float GetDisplacementTextureRotation() const;
	ECEClonerTextureSampleChannel GetDisplacementTextureSampleMode() const;
	struct FVector2D GetDisplacementTextureScale() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CEClonerDisplacementExtension")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CEClonerDisplacementExtension")
	}
	static class UCEClonerDisplacementExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCEClonerDisplacementExtension>();
	}
};
DUMPER7_ASSERTS_UCEClonerDisplacementExtension;

// Class ClonerEffector.CEClonerEffectorExtension
// 0x0060 (0x0098 - 0x0038)
class UCEClonerEffectorExtension final : public UCEClonerExtensionBase
{
public:
	TArray<TWeakObjectPtr<class AActor>>          EffectorActorsWeak;                                // 0x0038(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSet<TWeakObjectPtr<class UCEEffectorComponent>> EffectorsInternalWeak;                          // 0x0048(0x0050)(ExportObject, Transient, DuplicateTransient, NonTransactional, ContainsInstancedReference, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	bool LinkEffector(class AActor* InEffectorActor);
	bool UnlinkEffector(class AActor* InEffectorActor);

	int32 GetEffectorCount() const;
	bool IsEffectorLinked(const class AActor* InEffectorActor) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CEClonerEffectorExtension")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CEClonerEffectorExtension")
	}
	static class UCEClonerEffectorExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCEClonerEffectorExtension>();
	}
};
DUMPER7_ASSERTS_UCEClonerEffectorExtension;

// Class ClonerEffector.CEClonerEffectorSettings
// 0x0078 (0x00B0 - 0x0038)
class UCEClonerEffectorSettings final : public UDeveloperSettings
{
public:
	struct FLinearColor                           VisualizerInnerColor;                              // 0x0038(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           VisualizerOuterColor;                              // 0x0048(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSpawnDefaultActorAttached;                        // 0x0058(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             DefaultStaticMesh;                                 // 0x0060(0x0028)(Edit, Config, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UMaterialInterface>      DefaultMaterial;                                   // 0x0088(0x0028)(Edit, Config, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CEClonerEffectorSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CEClonerEffectorSettings")
	}
	static class UCEClonerEffectorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCEClonerEffectorSettings>();
	}
};
DUMPER7_ASSERTS_UCEClonerEffectorSettings;

// Class ClonerEffector.CEClonerEmitterSpawnExtension
// 0x0020 (0x0058 - 0x0038)
class UCEClonerEmitterSpawnExtension final : public UCEClonerExtensionBase
{
public:
	ECEClonerSpawnLoopMode                        SpawnLoopMode;                                     // 0x0038(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpawnLoopIterations;                               // 0x003C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECEClonerSpawnBehaviorMode                    SpawnBehaviorMode;                                 // 0x0040(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpawnLoopInterval;                                 // 0x0044(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SpawnRate;                                         // 0x0048(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseLocalSpace;                                    // 0x004C(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpawnMaxFrameCount;                                // 0x0050(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SpawnMaxTotalCount;                                // 0x0054(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetSpawnBehaviorMode(ECEClonerSpawnBehaviorMode InMode);
	void SetSpawnLoopInterval(float InInterval);
	void SetSpawnLoopIterations(int32 InIterations);
	void SetSpawnLoopMode(ECEClonerSpawnLoopMode InMode);
	void SetSpawnMaxFrameCount(int32 InCount);
	void SetSpawnMaxTotalCount(int32 InCount);
	void SetSpawnRate(float InRate);

	ECEClonerSpawnBehaviorMode GetSpawnBehaviorMode() const;
	float GetSpawnLoopInterval() const;
	int32 GetSpawnLoopIterations() const;
	ECEClonerSpawnLoopMode GetSpawnLoopMode() const;
	int32 GetSpawnMaxFrameCount() const;
	int32 GetSpawnMaxTotalCount() const;
	float GetSpawnRate() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CEClonerEmitterSpawnExtension")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CEClonerEmitterSpawnExtension")
	}
	static class UCEClonerEmitterSpawnExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCEClonerEmitterSpawnExtension>();
	}
};
DUMPER7_ASSERTS_UCEClonerEmitterSpawnExtension;

// Class ClonerEffector.CEClonerFreePlacementLayout
// 0x0000 (0x0080 - 0x0080)
class UCEClonerFreePlacementLayout final : public UCEClonerLayoutBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CEClonerFreePlacementLayout")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CEClonerFreePlacementLayout")
	}
	static class UCEClonerFreePlacementLayout* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCEClonerFreePlacementLayout>();
	}
};
DUMPER7_ASSERTS_UCEClonerFreePlacementLayout;

// Class ClonerEffector.CEClonerGridLayout
// 0x0070 (0x00F0 - 0x0080)
class UCEClonerGridLayout final : public UCEClonerLayoutBase
{
public:
	int32                                         CountX;                                            // 0x0080(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CountY;                                            // 0x0084(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CountZ;                                            // 0x0088(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SpacingX;                                          // 0x008C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SpacingY;                                          // 0x0090(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SpacingZ;                                          // 0x0094(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TwistFactor;                                       // 0x0098(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECEClonerAxis                                 TwistAxis;                                         // 0x009C(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECEClonerGridConstraint                       Constraint;                                        // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bInvertConstraint;                                 // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCEClonerGridConstraintSphere          SphereConstraint;                                  // 0x00A0(0x0020)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FCEClonerGridConstraintCylinder        CylinderConstraint;                                // 0x00C0(0x0020)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FCEClonerGridConstraintTexture         TextureConstraint;                                 // 0x00E0(0x0010)(NoDestructor, NativeAccessSpecifierPrivate)

public:
	void SetCountX(int32 InCountX);
	void SetCountY(int32 InCountY);
	void SetCountZ(int32 InCountZ);
	void SetSpacingX(float InSpacingX);
	void SetSpacingY(float InSpacingY);
	void SetSpacingZ(float InSpacingZ);
	void SetTwistAxis(ECEClonerAxis InAxis);
	void SetTwistFactor(float InFactor);

	int32 GetCountX() const;
	int32 GetCountY() const;
	int32 GetCountZ() const;
	float GetSpacingX() const;
	float GetSpacingY() const;
	float GetSpacingZ() const;
	ECEClonerAxis GetTwistAxis() const;
	float GetTwistFactor() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CEClonerGridLayout")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CEClonerGridLayout")
	}
	static class UCEClonerGridLayout* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCEClonerGridLayout>();
	}
};
DUMPER7_ASSERTS_UCEClonerGridLayout;

// Class ClonerEffector.CEClonerHoneycombLayout
// 0x0028 (0x00A8 - 0x0080)
class UCEClonerHoneycombLayout final : public UCEClonerLayoutBase
{
public:
	ECEClonerPlane                                Plane;                                             // 0x0080(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WidthCount;                                        // 0x0084(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         HeightCount;                                       // 0x0088(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WidthOffset;                                       // 0x008C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
