#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicMaterial

#include "Basic.hpp"


SDK_NAMESPACE_START

// Enum DynamicMaterial.EDMMaterialPropertyType
// NumValues: 0x0018
enum class EDMMaterialPropertyType : uint8
{
	None                                     = 0,
	BaseColor                                = 1,
	EmissiveColor                            = 2,
	Opacity                                  = 3,
	OpacityMask                              = 4,
	Roughness                                = 5,
	Specular                                 = 6,
	Metallic                                 = 7,
	Normal                                   = 8,
	PixelDepthOffset                         = 9,
	WorldPositionOffset                      = 10,
	AmbientOcclusion                         = 11,
	Anisotropy                               = 12,
	Refraction                               = 13,
	Tangent                                  = 14,
	Custom1                                  = 15,
	Custom2                                  = 16,
	Custom3                                  = 17,
	Custom4                                  = 18,
	Displacement                             = 19,
	SubsurfaceColor                          = 20,
	SurfaceThickness                         = 21,
	Any                                      = 22,
	EDMMaterialPropertyType_MAX              = 23,
};

// Enum DynamicMaterial.EDMValueType
// NumValues: 0x000D
enum class EDMValueType : uint8
{
	VT_None                                  = 0,
	VT_Bool                                  = 1,
	VT_Float1                                = 2,
	VT_Float2                                = 3,
	VT_Float3_RPY                            = 4,
	VT_Float3_RGB                            = 5,
	VT_Float3_XYZ                            = 6,
	VT_Float4_RGBA                           = 7,
	VT_Float_Any                             = 8,
	VT_Texture                               = 9,
	VT_ColorAtlas                            = 10,
	VT_Unused                                = 11,
	VT_MAX                                   = 12,
};

// Enum DynamicMaterial.EDMUpdateType
// NumValues: 0x0005
enum class EDMUpdateType : uint8
{
	Value                                    = 0,
	Structure                                = 1,
	AllowParentUpdate                        = 2,
	RefreshDetailView                        = 4,
	EDMUpdateType_MAX                        = 5,
};

// Enum DynamicMaterial.EDMMaterialShadingModel
// NumValues: 0x0003
enum class EDMMaterialShadingModel : uint8
{
	Unlit                                    = 0,
	DefaultLit                               = 1,
	EDMMaterialShadingModel_MAX              = 2,
};

// Enum DynamicMaterial.EDMUVSource
// NumValues: 0x0004
enum class EDMUVSource : uint8
{
	Texture                                  = 0,
	ScreenPosition                           = 1,
	WorldPosition                            = 2,
	EDMUVSource_MAX                          = 3,
};

// Enum DynamicMaterial.EDMLocationType
// NumValues: 0x0003
enum class EDMLocationType : uint8
{
	World                                    = 0,
	Actor                                    = 1,
	EDMLocationType_MAX                      = 2,
};

// Enum DynamicMaterial.EDMComponentLifetimeState
// NumValues: 0x0004
enum class EDMComponentLifetimeState : uint8
{
	Created                                  = 0,
	Added                                    = 1,
	Removed                                  = 2,
	EDMComponentLifetimeState_MAX            = 3,
};

// Enum DynamicMaterial.EDMBuildRequestType
// NumValues: 0x0004
enum class EDMBuildRequestType : uint8
{
	Immediate                                = 0,
	Async                                    = 1,
	Preview                                  = 2,
	EDMBuildRequestType_MAX                  = 3,
};

// ScriptStruct DynamicMaterial.DMMaterialStageConnectorChannel
// 0x0010 (0x0010 - 0x0000)
struct FDMMaterialStageConnectorChannel final
{
public:
	int32                                         SourceIndex;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDMMaterialPropertyType                       MaterialProperty;                                  // 0x0004(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OutputIndex;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutputChannel;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDMMaterialStageConnectorChannel;

// ScriptStruct DynamicMaterial.DMTextLine
// 0x0020 (0x0020 - 0x0000)
struct FDMTextLine final
{
public:
	class FString                                 Line;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDMTextLine;

// ScriptStruct DynamicMaterial.DMValueDefinition
// 0x0030 (0x0030 - 0x0000)
struct FDMValueDefinition final
{
public:
	EDMValueType                                  Type;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         FloatCount;                                        // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<class FText>                           ChannelNames;                                      // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UDMMaterialValue>           ValueClass;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FDMValueDefinition;

SDK_NAMESPACE_END
