#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicMaterial

#include "Basic.hpp"

#include "DynamicMaterial_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function DynamicMaterial.DMMaterialComponent.Update
// 0x0010 (0x0010 - 0x0000)
struct DMMaterialComponent_Update final
{
public:
	class UDMMaterialComponent*                   InSource;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDMUpdateType                                 InUpdateType;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DMMaterialComponent_Update;

// Function DynamicMaterial.DMMaterialComponent.GetComponentByPath
// 0x0018 (0x0018 - 0x0000)
struct DMMaterialComponent_GetComponentByPath final
{
public:
	class FString                                 InPath;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDMMaterialComponent*                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialComponent_GetComponentByPath;

// Function DynamicMaterial.DMMaterialComponent.GetOuterSafe
// 0x0008 (0x0008 - 0x0000)
struct DMMaterialComponent_GetOuterSafe final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialComponent_GetOuterSafe;

// Function DynamicMaterial.DMMaterialComponent.IsComponentValid
// 0x0001 (0x0001 - 0x0000)
struct DMMaterialComponent_IsComponentValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialComponent_IsComponentValid;

// Function DynamicMaterial.DMRenderTargetRenderer.CreateRenderTargetRenderer
// 0x0018 (0x0018 - 0x0000)
struct DMRenderTargetRenderer_CreateRenderTargetRenderer final
{
public:
	TSubclassOf<class UDMRenderTargetRenderer>    InRendererClass;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDMMaterialValueRenderTarget*           InRenderTargetValue;                               // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDMRenderTargetRenderer*                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetRenderer_CreateRenderTargetRenderer;

// Function DynamicMaterial.DMRenderTargetRenderer.GetRenderTargetValue
// 0x0008 (0x0008 - 0x0000)
struct DMRenderTargetRenderer_GetRenderTargetValue final
{
public:
	class UDMMaterialValueRenderTarget*           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetRenderer_GetRenderTargetValue;

// Function DynamicMaterial.DMRenderTargetRenderer.IsUpdating
// 0x0001 (0x0001 - 0x0000)
struct DMRenderTargetRenderer_IsUpdating final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetRenderer_IsUpdating;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetAutoWrapText
// 0x0001 (0x0001 - 0x0000)
struct DMRenderTargetTextRenderer_SetAutoWrapText final
{
public:
	bool                                          bInAutoWrap;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetAutoWrapText;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetBackgroundColor
// 0x0010 (0x0010 - 0x0000)
struct DMRenderTargetTextRenderer_SetBackgroundColor final
{
public:
	struct FLinearColor                           InBackgroundColor;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetBackgroundColor;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetFlowDirection
// 0x0001 (0x0001 - 0x0000)
struct DMRenderTargetTextRenderer_SetFlowDirection final
{
public:
	ETextFlowDirection                            InFlowDirection;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetFlowDirection;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetFontInfo
// 0x0060 (0x0060 - 0x0000)
struct DMRenderTargetTextRenderer_SetFontInfo final
{
public:
	struct FSlateFontInfo                         InFontInfo;                                        // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetFontInfo;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetHasHighlight
// 0x0001 (0x0001 - 0x0000)
struct DMRenderTargetTextRenderer_SetHasHighlight final
{
public:
	bool                                          bInHasHighlight;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetHasHighlight;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetHasShadow
// 0x0001 (0x0001 - 0x0000)
struct DMRenderTargetTextRenderer_SetHasShadow final
{
public:
	bool                                          bInHasShadow;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetHasShadow;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetHighlightColor
// 0x0010 (0x0010 - 0x0000)
struct DMRenderTargetTextRenderer_SetHighlightColor final
{
public:
	struct FLinearColor                           InHighlightColor;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetHighlightColor;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetJustify
// 0x0001 (0x0001 - 0x0000)
struct DMRenderTargetTextRenderer_SetJustify final
{
public:
	ETextJustify                                  InJustify;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetJustify;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetLineHeight
// 0x0004 (0x0004 - 0x0000)
struct DMRenderTargetTextRenderer_SetLineHeight final
{
public:
	float                                         InLineHeight;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetLineHeight;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetOverrideRenderTargetSize
// 0x0001 (0x0001 - 0x0000)
struct DMRenderTargetTextRenderer_SetOverrideRenderTargetSize final
{
public:
	bool                                          bInOverride;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetOverrideRenderTargetSize;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetPaddingBottom
// 0x0004 (0x0004 - 0x0000)
struct DMRenderTargetTextRenderer_SetPaddingBottom final
{
public:
	float                                         InPadding;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetPaddingBottom;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetPaddingLeft
// 0x0004 (0x0004 - 0x0000)
struct DMRenderTargetTextRenderer_SetPaddingLeft final
{
public:
	float                                         InPadding;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetPaddingLeft;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetPaddingRight
// 0x0004 (0x0004 - 0x0000)
struct DMRenderTargetTextRenderer_SetPaddingRight final
{
public:
	float                                         InPadding;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetPaddingRight;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetPaddingTop
// 0x0004 (0x0004 - 0x0000)
struct DMRenderTargetTextRenderer_SetPaddingTop final
{
public:
	float                                         InPadding;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetPaddingTop;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetShadowColor
// 0x0010 (0x0010 - 0x0000)
struct DMRenderTargetTextRenderer_SetShadowColor final
{
public:
	struct FLinearColor                           InShadowColor;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetShadowColor;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetShadowOffset
// 0x0010 (0x0010 - 0x0000)
struct DMRenderTargetTextRenderer_SetShadowOffset final
{
public:
	struct FVector2D                              InShadowOffset;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetShadowOffset;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetShapingMethod
// 0x0001 (0x0001 - 0x0000)
struct DMRenderTargetTextRenderer_SetShapingMethod final
{
public:
	ETextShapingMethod                            InShapingMethod;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetShapingMethod;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetStrikeBrush
// 0x0010 (0x0010 - 0x0000)
struct DMRenderTargetTextRenderer_SetStrikeBrush final
{
public:
	struct FInstancedStruct                       InStrikeBrush;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetStrikeBrush;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetText
// 0x0010 (0x0010 - 0x0000)
struct DMRenderTargetTextRenderer_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetText;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetTextColor
// 0x0010 (0x0010 - 0x0000)
struct DMRenderTargetTextRenderer_SetTextColor final
{
public:
	struct FLinearColor                           InColor;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetTextColor;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetTransformPolicy
// 0x0001 (0x0001 - 0x0000)
struct DMRenderTargetTextRenderer_SetTransformPolicy final
{
public:
	ETextTransformPolicy                          InTransformPolicy;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetTransformPolicy;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetWrappingPolicy
// 0x0001 (0x0001 - 0x0000)
struct DMRenderTargetTextRenderer_SetWrappingPolicy final
{
public:
	ETextWrappingPolicy                           InWrappingPolicy;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetWrappingPolicy;

// Function DynamicMaterial.DMRenderTargetTextRenderer.SetWrapTextAt
// 0x0004 (0x0004 - 0x0000)
struct DMRenderTargetTextRenderer_SetWrapTextAt final
{
public:
	float                                         InWrapAt;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_SetWrapTextAt;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetAutoWrapText
// 0x0001 (0x0001 - 0x0000)
struct DMRenderTargetTextRenderer_GetAutoWrapText final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetAutoWrapText;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetBackgroundColor
// 0x0010 (0x0010 - 0x0000)
struct DMRenderTargetTextRenderer_GetBackgroundColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetBackgroundColor;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetFlowDirection
// 0x0001 (0x0001 - 0x0000)
struct DMRenderTargetTextRenderer_GetFlowDirection final
{
public:
	ETextFlowDirection                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetFlowDirection;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetFontInfo
// 0x0060 (0x0060 - 0x0000)
struct DMRenderTargetTextRenderer_GetFontInfo final
{
public:
	struct FSlateFontInfo                         ReturnValue;                                       // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetFontInfo;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetHasHighlight
// 0x0001 (0x0001 - 0x0000)
struct DMRenderTargetTextRenderer_GetHasHighlight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetHasHighlight;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetHasShadow
// 0x0001 (0x0001 - 0x0000)
struct DMRenderTargetTextRenderer_GetHasShadow final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetHasShadow;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetHighlightColor
// 0x0010 (0x0010 - 0x0000)
struct DMRenderTargetTextRenderer_GetHighlightColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetHighlightColor;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetJustify
// 0x0001 (0x0001 - 0x0000)
struct DMRenderTargetTextRenderer_GetJustify final
{
public:
	ETextJustify                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetJustify;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetLineHeight
// 0x0004 (0x0004 - 0x0000)
struct DMRenderTargetTextRenderer_GetLineHeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetLineHeight;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetPaddingBottom
// 0x0004 (0x0004 - 0x0000)
struct DMRenderTargetTextRenderer_GetPaddingBottom final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetPaddingBottom;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetPaddingLeft
// 0x0004 (0x0004 - 0x0000)
struct DMRenderTargetTextRenderer_GetPaddingLeft final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetPaddingLeft;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetPaddingRight
// 0x0004 (0x0004 - 0x0000)
struct DMRenderTargetTextRenderer_GetPaddingRight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetPaddingRight;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetPaddingTop
// 0x0004 (0x0004 - 0x0000)
struct DMRenderTargetTextRenderer_GetPaddingTop final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetPaddingTop;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetShadowColor
// 0x0010 (0x0010 - 0x0000)
struct DMRenderTargetTextRenderer_GetShadowColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetShadowColor;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetShadowOffset
// 0x0010 (0x0010 - 0x0000)
struct DMRenderTargetTextRenderer_GetShadowOffset final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetShadowOffset;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetShapingMethod
// 0x0001 (0x0001 - 0x0000)
struct DMRenderTargetTextRenderer_GetShapingMethod final
{
public:
	ETextShapingMethod                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetShapingMethod;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetStrikeBrush
// 0x0010 (0x0010 - 0x0000)
struct DMRenderTargetTextRenderer_GetStrikeBrush final
{
public:
	struct FInstancedStruct                       ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetStrikeBrush;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetText
// 0x0010 (0x0010 - 0x0000)
struct DMRenderTargetTextRenderer_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetText;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetTextColor
// 0x0010 (0x0010 - 0x0000)
struct DMRenderTargetTextRenderer_GetTextColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetTextColor;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetTransformPolicy
// 0x0001 (0x0001 - 0x0000)
struct DMRenderTargetTextRenderer_GetTransformPolicy final
{
public:
	ETextTransformPolicy                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetTransformPolicy;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetWrappingPolicy
// 0x0001 (0x0001 - 0x0000)
struct DMRenderTargetTextRenderer_GetWrappingPolicy final
{
public:
	ETextWrappingPolicy                           ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetWrappingPolicy;

// Function DynamicMaterial.DMRenderTargetTextRenderer.GetWrapTextAt
// 0x0004 (0x0004 - 0x0000)
struct DMRenderTargetTextRenderer_GetWrapTextAt final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_GetWrapTextAt;

// Function DynamicMaterial.DMRenderTargetTextRenderer.IsOverridingRenderTargetSize
// 0x0001 (0x0001 - 0x0000)
struct DMRenderTargetTextRenderer_IsOverridingRenderTargetSize final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMRenderTargetTextRenderer_IsOverridingRenderTargetSize;

// Function DynamicMaterial.DMMaterialValue.GetMaterialModel
// 0x0008 (0x0008 - 0x0000)
struct DMMaterialValue_GetMaterialModel final
{
public:
	class UDynamicMaterialModel*                  ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValue_GetMaterialModel;

// Function DynamicMaterial.DMMaterialValue.GetMaterialParameterName
// 0x0008 (0x0008 - 0x0000)
struct DMMaterialValue_GetMaterialParameterName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValue_GetMaterialParameterName;

// Function DynamicMaterial.DMMaterialValue.GetParameter
// 0x0008 (0x0008 - 0x0000)
struct DMMaterialValue_GetParameter final
{
public:
	class UDMMaterialParameter*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValue_GetParameter;

// Function DynamicMaterial.DMMaterialValue.GetType
// 0x0001 (0x0001 - 0x0000)
struct DMMaterialValue_GetType final
{
public:
	EDMValueType                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValue_GetType;

// Function DynamicMaterial.DMMaterialValue.IsLocal
// 0x0001 (0x0001 - 0x0000)
struct DMMaterialValue_IsLocal final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValue_IsLocal;

// Function DynamicMaterial.DMTextureUV.SetOffset
// 0x0010 (0x0010 - 0x0000)
struct DMTextureUV_SetOffset final
{
public:
	struct FVector2D                              InOffset;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUV_SetOffset;

// Function DynamicMaterial.DMTextureUV.SetPivot
// 0x0010 (0x0010 - 0x0000)
struct DMTextureUV_SetPivot final
{
public:
	struct FVector2D                              InPivot;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUV_SetPivot;

// Function DynamicMaterial.DMTextureUV.SetRotation
// 0x0004 (0x0004 - 0x0000)
struct DMTextureUV_SetRotation final
{
public:
	float                                         InRotation;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUV_SetRotation;

// Function DynamicMaterial.DMTextureUV.SetTiling
// 0x0010 (0x0010 - 0x0000)
struct DMTextureUV_SetTiling final
{
public:
	struct FVector2D                              InTiling;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUV_SetTiling;

// Function DynamicMaterial.DMTextureUV.GetMaterialModel
// 0x0008 (0x0008 - 0x0000)
struct DMTextureUV_GetMaterialModel final
{
public:
	class UDynamicMaterialModel*                  ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUV_GetMaterialModel;

// Function DynamicMaterial.DMTextureUV.GetMaterialParameter
// 0x0018 (0x0018 - 0x0000)
struct DMTextureUV_GetMaterialParameter final
{
public:
	class FName                                   InPropertyName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InComponent;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDMMaterialParameter*                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUV_GetMaterialParameter;

// Function DynamicMaterial.DMTextureUV.GetMaterialParameterName
// 0x0014 (0x0014 - 0x0000)
struct DMTextureUV_GetMaterialParameterName final
{
public:
	class FName                                   InPropertyName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InComponent;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x000C(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUV_GetMaterialParameterName;

// Function DynamicMaterial.DMTextureUV.GetOffset
// 0x0010 (0x0010 - 0x0000)
struct DMTextureUV_GetOffset final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUV_GetOffset;

// Function DynamicMaterial.DMTextureUV.GetParameters
// 0x0010 (0x0010 - 0x0000)
struct DMTextureUV_GetParameters final
{
public:
	TArray<class UDMMaterialParameter*>           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUV_GetParameters;

// Function DynamicMaterial.DMTextureUV.GetPivot
// 0x0010 (0x0010 - 0x0000)
struct DMTextureUV_GetPivot final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUV_GetPivot;

// Function DynamicMaterial.DMTextureUV.GetRotation
// 0x0004 (0x0004 - 0x0000)
struct DMTextureUV_GetRotation final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUV_GetRotation;

// Function DynamicMaterial.DMTextureUV.GetTiling
// 0x0010 (0x0010 - 0x0000)
struct DMTextureUV_GetTiling final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUV_GetTiling;

// Function DynamicMaterial.DMMaterialValueBool.SetValue
// 0x0001 (0x0001 - 0x0000)
struct DMMaterialValueBool_SetValue final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueBool_SetValue;

// Function DynamicMaterial.DMMaterialValueBool.GetValue
// 0x0001 (0x0001 - 0x0000)
struct DMMaterialValueBool_GetValue final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueBool_GetValue;

// Function DynamicMaterial.DMMaterialValueTexture.SetValue
// 0x0008 (0x0008 - 0x0000)
struct DMMaterialValueTexture_SetValue final
{
public:
	class UTexture*                               InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueTexture_SetValue;

// Function DynamicMaterial.DMMaterialValueTexture.GetValue
// 0x0008 (0x0008 - 0x0000)
struct DMMaterialValueTexture_GetValue final
{
public:
	class UTexture*                               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueTexture_GetValue;

// Function DynamicMaterial.DMMaterialValueRenderTarget.SetClearColor
// 0x0010 (0x0010 - 0x0000)
struct DMMaterialValueRenderTarget_SetClearColor final
{
public:
	struct FLinearColor                           InClearColor;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueRenderTarget_SetClearColor;

// Function DynamicMaterial.DMMaterialValueRenderTarget.SetRenderer
// 0x0008 (0x0008 - 0x0000)
struct DMMaterialValueRenderTarget_SetRenderer final
{
public:
	class UDMRenderTargetRenderer*                InRenderer;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueRenderTarget_SetRenderer;

// Function DynamicMaterial.DMMaterialValueRenderTarget.SetTextureFormat
// 0x0001 (0x0001 - 0x0000)
struct DMMaterialValueRenderTarget_SetTextureFormat final
{
public:
	ETextureRenderTargetFormat                    InTextureFormat;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueRenderTarget_SetTextureFormat;

// Function DynamicMaterial.DMMaterialValueRenderTarget.SetTextureSize
// 0x0008 (0x0008 - 0x0000)
struct DMMaterialValueRenderTarget_SetTextureSize final
{
public:
	struct FIntPoint                              InTextureSize;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueRenderTarget_SetTextureSize;

// Function DynamicMaterial.DMMaterialValueRenderTarget.GetClearColor
// 0x0010 (0x0010 - 0x0000)
struct DMMaterialValueRenderTarget_GetClearColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueRenderTarget_GetClearColor;

// Function DynamicMaterial.DMMaterialValueRenderTarget.GetRenderer
// 0x0008 (0x0008 - 0x0000)
struct DMMaterialValueRenderTarget_GetRenderer final
{
public:
	class UDMRenderTargetRenderer*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueRenderTarget_GetRenderer;

// Function DynamicMaterial.DMMaterialValueRenderTarget.GetRenderTarget
// 0x0008 (0x0008 - 0x0000)
struct DMMaterialValueRenderTarget_GetRenderTarget final
{
public:
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueRenderTarget_GetRenderTarget;

// Function DynamicMaterial.DMMaterialValueRenderTarget.GetTextureFormat
// 0x0001 (0x0001 - 0x0000)
struct DMMaterialValueRenderTarget_GetTextureFormat final
{
public:
	ETextureRenderTargetFormat                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueRenderTarget_GetTextureFormat;

// Function DynamicMaterial.DMMaterialValueRenderTarget.GetTextureSize
// 0x0008 (0x0008 - 0x0000)
struct DMMaterialValueRenderTarget_GetTextureSize final
{
public:
	struct FIntPoint                              ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueRenderTarget_GetTextureSize;

// Function DynamicMaterial.DMMaterialValueFloat.SetValueRange
// 0x0008 (0x0008 - 0x0000)
struct DMMaterialValueFloat_SetValueRange final
{
public:
	struct FFloatInterval                         InValueRange;                                      // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueFloat_SetValueRange;

// Function DynamicMaterial.DMMaterialValueFloat.GetValueRange
// 0x0008 (0x0008 - 0x0000)
struct DMMaterialValueFloat_GetValueRange final
{
public:
	struct FFloatInterval                         ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueFloat_GetValueRange;

// Function DynamicMaterial.DMMaterialValueFloat.HasValueRange
// 0x0001 (0x0001 - 0x0000)
struct DMMaterialValueFloat_HasValueRange final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueFloat_HasValueRange;

// Function DynamicMaterial.DMMaterialValueFloat1.SetValue
// 0x0004 (0x0004 - 0x0000)
struct DMMaterialValueFloat1_SetValue final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueFloat1_SetValue;

// Function DynamicMaterial.DMMaterialValueFloat1.GetValue
// 0x0004 (0x0004 - 0x0000)
struct DMMaterialValueFloat1_GetValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueFloat1_GetValue;

// Function DynamicMaterial.DMMaterialValueFloat2.SetValue
// 0x0010 (0x0010 - 0x0000)
struct DMMaterialValueFloat2_SetValue final
{
public:
	struct FVector2D                              InValue;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueFloat2_SetValue;

// Function DynamicMaterial.DMMaterialValueFloat2.GetValue
// 0x0010 (0x0010 - 0x0000)
struct DMMaterialValueFloat2_GetValue final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueFloat2_GetValue;

// Function DynamicMaterial.DMMaterialValueFloat3RPY.SetValue
// 0x0018 (0x0018 - 0x0000)
struct DMMaterialValueFloat3RPY_SetValue final
{
public:
	struct FRotator                               InValue;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueFloat3RPY_SetValue;

// Function DynamicMaterial.DMMaterialValueFloat3RPY.GetValue
// 0x0018 (0x0018 - 0x0000)
struct DMMaterialValueFloat3RPY_GetValue final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueFloat3RPY_GetValue;

// Function DynamicMaterial.DMMaterialComponentDynamic.GeResolvedParentComponent
// 0x0008 (0x0008 - 0x0000)
struct DMMaterialComponentDynamic_GeResolvedParentComponent final
{
public:
	class UDMMaterialComponent*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialComponentDynamic_GeResolvedParentComponent;

// Function DynamicMaterial.DMMaterialComponentDynamic.GetMaterialModelDynamic
// 0x0008 (0x0008 - 0x0000)
struct DMMaterialComponentDynamic_GetMaterialModelDynamic final
{
public:
	class UDynamicMaterialModelDynamic*           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialComponentDynamic_GetMaterialModelDynamic;

// Function DynamicMaterial.DMMaterialComponentDynamic.GetParentComponentName
// 0x0008 (0x0008 - 0x0000)
struct DMMaterialComponentDynamic_GetParentComponentName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialComponentDynamic_GetParentComponentName;

// Function DynamicMaterial.DMMaterialValueDynamic.GetParentValue
// 0x0008 (0x0008 - 0x0000)
struct DMMaterialValueDynamic_GetParentValue final
{
public:
	class UDMMaterialValue*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueDynamic_GetParentValue;

// Function DynamicMaterial.DMMaterialValueFloat3RGBDynamic.SetValue
// 0x0010 (0x0010 - 0x0000)
struct DMMaterialValueFloat3RGBDynamic_SetValue final
{
public:
	struct FLinearColor                           InValue;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueFloat3RGBDynamic_SetValue;

// Function DynamicMaterial.DMMaterialValueFloat3RGBDynamic.GetValue
// 0x0010 (0x0010 - 0x0000)
struct DMMaterialValueFloat3RGBDynamic_GetValue final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueFloat3RGBDynamic_GetValue;

// Function DynamicMaterial.DMMaterialValueFloat3RGB.SetValue
// 0x0010 (0x0010 - 0x0000)
struct DMMaterialValueFloat3RGB_SetValue final
{
public:
	struct FLinearColor                           InValue;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueFloat3RGB_SetValue;

// Function DynamicMaterial.DMMaterialValueFloat3RGB.GetValue
// 0x0010 (0x0010 - 0x0000)
struct DMMaterialValueFloat3RGB_GetValue final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueFloat3RGB_GetValue;

// Function DynamicMaterial.DMMaterialValueFloat3XYZ.SetValue
// 0x0018 (0x0018 - 0x0000)
struct DMMaterialValueFloat3XYZ_SetValue final
{
public:
	struct FVector                                InValue;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueFloat3XYZ_SetValue;

// Function DynamicMaterial.DMMaterialValueFloat3XYZ.GetValue
// 0x0018 (0x0018 - 0x0000)
struct DMMaterialValueFloat3XYZ_GetValue final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueFloat3XYZ_GetValue;

// Function DynamicMaterial.DMParameterContainer.CopyParametersFrom
// 0x0008 (0x0008 - 0x0000)
struct DMParameterContainer_CopyParametersFrom final
{
public:
	class UObject*                                InOther;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMParameterContainer_CopyParametersFrom;

// Function DynamicMaterial.DMMaterialValueFloat4.SetValue
// 0x0010 (0x0010 - 0x0000)
struct DMMaterialValueFloat4_SetValue final
{
public:
	struct FLinearColor                           InValue;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueFloat4_SetValue;

// Function DynamicMaterial.DMMaterialValueFloat4.GetValue
// 0x0010 (0x0010 - 0x0000)
struct DMMaterialValueFloat4_GetValue final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueFloat4_GetValue;

// Function DynamicMaterial.DMTextureUVDynamic.SetOffset
// 0x0010 (0x0010 - 0x0000)
struct DMTextureUVDynamic_SetOffset final
{
public:
	struct FVector2D                              InOffset;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUVDynamic_SetOffset;

// Function DynamicMaterial.DMTextureUVDynamic.SetPivot
// 0x0010 (0x0010 - 0x0000)
struct DMTextureUVDynamic_SetPivot final
{
public:
	struct FVector2D                              InPivot;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUVDynamic_SetPivot;

// Function DynamicMaterial.DMTextureUVDynamic.SetRotation
// 0x0004 (0x0004 - 0x0000)
struct DMTextureUVDynamic_SetRotation final
{
public:
	float                                         InRotation;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUVDynamic_SetRotation;

// Function DynamicMaterial.DMTextureUVDynamic.SetTiling
// 0x0010 (0x0010 - 0x0000)
struct DMTextureUVDynamic_SetTiling final
{
public:
	struct FVector2D                              InTiling;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUVDynamic_SetTiling;

// Function DynamicMaterial.DMTextureUVDynamic.GetOffset
// 0x0010 (0x0010 - 0x0000)
struct DMTextureUVDynamic_GetOffset final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUVDynamic_GetOffset;

// Function DynamicMaterial.DMTextureUVDynamic.GetParentTextureUV
// 0x0008 (0x0008 - 0x0000)
struct DMTextureUVDynamic_GetParentTextureUV final
{
public:
	class UDMTextureUV*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUVDynamic_GetParentTextureUV;

// Function DynamicMaterial.DMTextureUVDynamic.GetPivot
// 0x0010 (0x0010 - 0x0000)
struct DMTextureUVDynamic_GetPivot final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUVDynamic_GetPivot;

// Function DynamicMaterial.DMTextureUVDynamic.GetRotation
// 0x0004 (0x0004 - 0x0000)
struct DMTextureUVDynamic_GetRotation final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUVDynamic_GetRotation;

// Function DynamicMaterial.DMTextureUVDynamic.GetTiling
// 0x0010 (0x0010 - 0x0000)
struct DMTextureUVDynamic_GetTiling final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMTextureUVDynamic_GetTiling;

// Function DynamicMaterial.DMMaterialValueColorAtlas.SetValue
// 0x0004 (0x0004 - 0x0000)
struct DMMaterialValueColorAtlas_SetValue final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueColorAtlas_SetValue;

// Function DynamicMaterial.DMMaterialValueColorAtlas.GetValue
// 0x0004 (0x0004 - 0x0000)
struct DMMaterialValueColorAtlas_GetValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueColorAtlas_GetValue;

// Function DynamicMaterial.DMMaterialParameter.GetMaterialModel
// 0x0008 (0x0008 - 0x0000)
struct DMMaterialParameter_GetMaterialModel final
{
public:
	class UDynamicMaterialModel*                  ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialParameter_GetMaterialModel;

// Function DynamicMaterial.DMMaterialParameter.GetParameterName
// 0x0008 (0x0008 - 0x0000)
struct DMMaterialParameter_GetParameterName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialParameter_GetParameterName;

// Function DynamicMaterial.DMMaterialValueBoolDynamic.SetValue
// 0x0001 (0x0001 - 0x0000)
struct DMMaterialValueBoolDynamic_SetValue final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueBoolDynamic_SetValue;

// Function DynamicMaterial.DMMaterialValueBoolDynamic.GetValue
// 0x0001 (0x0001 - 0x0000)
struct DMMaterialValueBoolDynamic_GetValue final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueBoolDynamic_GetValue;

// Function DynamicMaterial.DMMaterialValueColorAtlasDynamic.SetValue
// 0x0004 (0x0004 - 0x0000)
struct DMMaterialValueColorAtlasDynamic_SetValue final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueColorAtlasDynamic_SetValue;

// Function DynamicMaterial.DMMaterialValueColorAtlasDynamic.GetValue
// 0x0004 (0x0004 - 0x0000)
struct DMMaterialValueColorAtlasDynamic_GetValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueColorAtlasDynamic_GetValue;

// Function DynamicMaterial.DMMaterialValueFloat1Dynamic.SetValue
// 0x0004 (0x0004 - 0x0000)
struct DMMaterialValueFloat1Dynamic_SetValue final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueFloat1Dynamic_SetValue;

// Function DynamicMaterial.DMMaterialValueFloat1Dynamic.GetValue
// 0x0004 (0x0004 - 0x0000)
struct DMMaterialValueFloat1Dynamic_GetValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueFloat1Dynamic_GetValue;

// Function DynamicMaterial.DMMaterialValueFloat2Dynamic.SetValue
// 0x0010 (0x0010 - 0x0000)
struct DMMaterialValueFloat2Dynamic_SetValue final
{
public:
	struct FVector2D                              InValue;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DMMaterialValueFloat2Dynamic_SetValue;

// Function DynamicMaterial.DMMaterialValueFloat2Dynamic.GetValue
// 0x0010 (0x0010 - 0x0000)
struct DMMaterialValueFloat2Dynamic_GetValue final
{
public:
