#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicMaterial

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DynamicMaterial_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"


SDK_NAMESPACE_START

// Class DynamicMaterial.DMMaterialComponent
// 0x0008 (0x0030 - 0x0028)
class UDMMaterialComponent : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Update(class UDMMaterialComponent* InSource, EDMUpdateType InUpdateType);

	class UDMMaterialComponent* GetComponentByPath(const class FString& InPath) const;
	class UObject* GetOuterSafe() const;
	bool IsComponentValid() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialComponent")
	}
	static class UDMMaterialComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialComponent>();
	}
};
DUMPER7_ASSERTS_UDMMaterialComponent;

// Class DynamicMaterial.DMRenderTargetRenderer
// 0x0018 (0x0048 - 0x0030)
class UDMRenderTargetRenderer : public UDMMaterialComponent
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDMRenderTargetRenderer* CreateRenderTargetRenderer(TSubclassOf<class UDMRenderTargetRenderer> InRendererClass, class UDMMaterialValueRenderTarget* InRenderTargetValue);

	void AsyncUpdateRenderTarget();
	void UpdateRenderTarget();

	class UDMMaterialValueRenderTarget* GetRenderTargetValue() const;
	bool IsUpdating() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMRenderTargetRenderer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMRenderTargetRenderer")
	}
	static class UDMRenderTargetRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMRenderTargetRenderer>();
	}
};
DUMPER7_ASSERTS_UDMRenderTargetRenderer;

// Class DynamicMaterial.DMRenderTargetWidgetRendererBase
// 0x0020 (0x0068 - 0x0048)
class UDMRenderTargetWidgetRendererBase : public UDMRenderTargetRenderer
{
public:
	uint8                                         Pad_48[0x20];                                      // 0x0048(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMRenderTargetWidgetRendererBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMRenderTargetWidgetRendererBase")
	}
	static class UDMRenderTargetWidgetRendererBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMRenderTargetWidgetRendererBase>();
	}
};
DUMPER7_ASSERTS_UDMRenderTargetWidgetRendererBase;

// Class DynamicMaterial.DMRenderTargetTextRenderer
// 0x0108 (0x0170 - 0x0068)
class UDMRenderTargetTextRenderer final : public UDMRenderTargetWidgetRendererBase
{
public:
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         FontInfo;                                          // 0x0070(0x0060)(Edit, BlueprintVisible, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   Text;                                              // 0x00D0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDMTextLine>                    Lines;                                             // 0x00E0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FLinearColor                           TextColor;                                         // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasHighlight;                                     // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           HighlightColor;                                    // 0x0104(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasShadow;                                        // 0x0114(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ShadowColor;                                       // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              ShadowOffset;                                      // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoWrapText;                                     // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WrapTextAt;                                        // 0x013C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETextWrappingPolicy                           WrappingPolicy;                                    // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETextJustify                                  Justify;                                           // 0x0141(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETextTransformPolicy                          TransformPolicy;                                   // 0x0142(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETextFlowDirection                            FlowDirection;                                     // 0x0143(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETextShapingMethod                            ShapingMethod;                                     // 0x0144(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       StrikeBrush;                                       // 0x0148(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	float                                         LineHeight;                                        // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PaddingLeft;                                       // 0x015C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PaddingRight;                                      // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PaddingTop;                                        // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PaddingBottom;                                     // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideRenderTargetSize;                         // 0x016C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAutoWrapText(bool bInAutoWrap);
	void SetBackgroundColor(const struct FLinearColor& InBackgroundColor);
	void SetFlowDirection(ETextFlowDirection InFlowDirection);
	void SetFontInfo(const struct FSlateFontInfo& InFontInfo);
	void SetHasHighlight(bool bInHasHighlight);
	void SetHasShadow(bool bInHasShadow);
	void SetHighlightColor(const struct FLinearColor& InHighlightColor);
	void SetJustify(ETextJustify InJustify);
	void SetLineHeight(float InLineHeight);
	void SetOverrideRenderTargetSize(bool bInOverride);
	void SetPaddingBottom(float InPadding);
	void SetPaddingLeft(float InPadding);
	void SetPaddingRight(float InPadding);
	void SetPaddingTop(float InPadding);
	void SetShadowColor(const struct FLinearColor& InShadowColor);
	void SetShadowOffset(const struct FVector2D& InShadowOffset);
	void SetShapingMethod(ETextShapingMethod InShapingMethod);
	void SetStrikeBrush(const struct FInstancedStruct& InStrikeBrush);
	void SetText(const class FText& InText);
	void SetTextColor(const struct FLinearColor& InColor);
	void SetTransformPolicy(ETextTransformPolicy InTransformPolicy);
	void SetWrappingPolicy(ETextWrappingPolicy InWrappingPolicy);
	void SetWrapTextAt(float InWrapAt);

	bool GetAutoWrapText() const;
	const struct FLinearColor GetBackgroundColor() const;
	ETextFlowDirection GetFlowDirection() const;
	const struct FSlateFontInfo GetFontInfo() const;
	bool GetHasHighlight() const;
	bool GetHasShadow() const;
	const struct FLinearColor GetHighlightColor() const;
	ETextJustify GetJustify() const;
	float GetLineHeight() const;
	float GetPaddingBottom() const;
	float GetPaddingLeft() const;
	float GetPaddingRight() const;
	float GetPaddingTop() const;
	const struct FLinearColor GetShadowColor() const;
	const struct FVector2D GetShadowOffset() const;
	ETextShapingMethod GetShapingMethod() const;
	const struct FInstancedStruct GetStrikeBrush() const;
	const class FText GetText() const;
	const struct FLinearColor GetTextColor() const;
	ETextTransformPolicy GetTransformPolicy() const;
	ETextWrappingPolicy GetWrappingPolicy() const;
	float GetWrapTextAt() const;
	bool IsOverridingRenderTargetSize() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMRenderTargetTextRenderer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMRenderTargetTextRenderer")
	}
	static class UDMRenderTargetTextRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMRenderTargetTextRenderer>();
	}
};
DUMPER7_ASSERTS_UDMRenderTargetTextRenderer;

// Class DynamicMaterial.DMMaterialLinkedComponent
// 0x0000 (0x0030 - 0x0030)
class UDMMaterialLinkedComponent : public UDMMaterialComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialLinkedComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialLinkedComponent")
	}
	static class UDMMaterialLinkedComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialLinkedComponent>();
	}
};
DUMPER7_ASSERTS_UDMMaterialLinkedComponent;

// Class DynamicMaterial.DMMaterialValue
// 0x0028 (0x0058 - 0x0030)
class UDMMaterialValue : public UDMMaterialLinkedComponent
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	EDMValueType                                  Type;                                              // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLocal;                                            // 0x0041(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDMMaterialParameter*                   Parameter;                                         // 0x0048(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class FName                                   CachedParameterName;                               // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, TextExportTransient, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UDynamicMaterialModel* GetMaterialModel() const;
	class FName GetMaterialParameterName() const;
	class UDMMaterialParameter* GetParameter() const;
	EDMValueType GetType() const;
	bool IsLocal() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValue")
	}
	static class UDMMaterialValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValue>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValue;

// Class DynamicMaterial.DMTextureUV
// 0x0140 (0x0170 - 0x0030)
class UDMTextureUV final : public UDMMaterialLinkedComponent
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Offset;                                            // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              Pivot;                                             // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Rotation;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Tiling;                                            // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              Scale;                                             // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<int32, class UDMMaterialParameter*>      MaterialParameters;                                // 0x0080(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, DuplicateTransient, Protected, TextExportTransient, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	TMap<int32, class FName>                      CachedParameterNames;                              // 0x00D0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, DuplicateTransient, Protected, TextExportTransient, NativeAccessSpecifierProtected)
	TSet<int32>                                   ExposedParameters;                                 // 0x0120(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, Protected, NativeAccessSpecifierProtected)

public:
	void SetOffset(const struct FVector2D& InOffset);
	void SetPivot(const struct FVector2D& InPivot);
	void SetRotation(float InRotation);
	void SetTiling(const struct FVector2D& InTiling);

	class UDynamicMaterialModel* GetMaterialModel() const;
	class UDMMaterialParameter* GetMaterialParameter(class FName InPropertyName, int32 InComponent) const;
	class FName GetMaterialParameterName(class FName InPropertyName, int32 InComponent) const;
	const struct FVector2D GetOffset() const;
	TArray<class UDMMaterialParameter*> GetParameters() const;
	const struct FVector2D GetPivot() const;
	float GetRotation() const;
	const struct FVector2D GetTiling() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMTextureUV")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMTextureUV")
	}
	static class UDMTextureUV* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMTextureUV>();
	}
};
DUMPER7_ASSERTS_UDMTextureUV;

// Class DynamicMaterial.DMMaterialValueBool
// 0x0008 (0x0060 - 0x0058)
class UDMMaterialValueBool final : public UDMMaterialValue
{
public:
	bool                                          Value;                                             // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetValue(bool InValue);

	bool GetValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueBool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueBool")
	}
	static class UDMMaterialValueBool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueBool>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueBool;

// Class DynamicMaterial.DMMaterialValueTexture
// 0x0008 (0x0060 - 0x0058)
class UDMMaterialValueTexture : public UDMMaterialValue
{
public:
	class UTexture*                               Value;                                             // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoClear, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	void SetValue(class UTexture* InValue);

	class UTexture* GetValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueTexture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueTexture")
	}
	static class UDMMaterialValueTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueTexture>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueTexture;

// Class DynamicMaterial.DMMaterialValueRenderTarget
// 0x0030 (0x0090 - 0x0060)
class UDMMaterialValueRenderTarget final : public UDMMaterialValueTexture
{
public:
	struct FIntPoint                              TextureSize;                                       // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETextureRenderTargetFormat                    TextureFormat;                                     // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ClearColor;                                        // 0x006C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDMRenderTargetRenderer*                Renderer;                                          // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetClearColor(const struct FLinearColor& InClearColor);
	void SetRenderer(class UDMRenderTargetRenderer* InRenderer);
	void SetTextureFormat(ETextureRenderTargetFormat InTextureFormat);
	void SetTextureSize(const struct FIntPoint& InTextureSize);

	const struct FLinearColor GetClearColor() const;
	class UDMRenderTargetRenderer* GetRenderer() const;
	class UTextureRenderTarget2D* GetRenderTarget() const;
	ETextureRenderTargetFormat GetTextureFormat() const;
	const struct FIntPoint GetTextureSize() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueRenderTarget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueRenderTarget")
	}
	static class UDMMaterialValueRenderTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueRenderTarget>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueRenderTarget;

// Class DynamicMaterial.DMMaterialValueFloat
// 0x0008 (0x0060 - 0x0058)
class UDMMaterialValueFloat : public UDMMaterialValue
{
public:
	struct FFloatInterval                         ValueRange;                                        // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetValueRange(const struct FFloatInterval& InValueRange);

	const struct FFloatInterval GetValueRange() const;
	bool HasValueRange() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueFloat")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueFloat")
	}
	static class UDMMaterialValueFloat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueFloat>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueFloat;

// Class DynamicMaterial.DMMaterialValueFloat1
// 0x0008 (0x0068 - 0x0060)
class UDMMaterialValueFloat1 final : public UDMMaterialValueFloat
{
public:
	float                                         Value;                                             // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetValue(float InValue);

	float GetValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueFloat1")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueFloat1")
	}
	static class UDMMaterialValueFloat1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueFloat1>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueFloat1;

// Class DynamicMaterial.DMMaterialValueFloat2
// 0x0010 (0x0070 - 0x0060)
class UDMMaterialValueFloat2 final : public UDMMaterialValueFloat
{
public:
	struct FVector2D                              Value;                                             // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetValue(const struct FVector2D& InValue);

	const struct FVector2D GetValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueFloat2")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueFloat2")
	}
	static class UDMMaterialValueFloat2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueFloat2>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueFloat2;

// Class DynamicMaterial.DMMaterialValueFloat3RPY
// 0x0018 (0x0078 - 0x0060)
class UDMMaterialValueFloat3RPY final : public UDMMaterialValueFloat
{
public:
	struct FRotator                               Value;                                             // 0x0060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void SetValue(const struct FRotator& InValue);

	const struct FRotator GetValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueFloat3RPY")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueFloat3RPY")
	}
	static class UDMMaterialValueFloat3RPY* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueFloat3RPY>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueFloat3RPY;

// Class DynamicMaterial.DMMaterialComponentDynamic
// 0x0010 (0x0040 - 0x0030)
class UDMMaterialComponentDynamic : public UDMMaterialComponent
{
public:
	class FName                                   ParentComponentName;                               // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDMMaterialComponent*                   ParentComponent;                                   // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	class UDMMaterialComponent* GeResolvedParentComponent() const;
	class UDynamicMaterialModelDynamic* GetMaterialModelDynamic() const;
	class FName GetParentComponentName() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialComponentDynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialComponentDynamic")
	}
	static class UDMMaterialComponentDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialComponentDynamic>();
	}
};
DUMPER7_ASSERTS_UDMMaterialComponentDynamic;

// Class DynamicMaterial.DMMaterialValueDynamic
// 0x0010 (0x0050 - 0x0040)
class UDMMaterialValueDynamic : public UDMMaterialComponentDynamic
{
public:
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UDMMaterialValue* GetParentValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueDynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueDynamic")
	}
	static class UDMMaterialValueDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueDynamic>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueDynamic;

// Class DynamicMaterial.DMMaterialValueFloat3RGBDynamic
// 0x0010 (0x0060 - 0x0050)
class UDMMaterialValueFloat3RGBDynamic final : public UDMMaterialValueDynamic
{
public:
	struct FLinearColor                           Value;                                             // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetValue(const struct FLinearColor& InValue);

	const struct FLinearColor GetValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueFloat3RGBDynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueFloat3RGBDynamic")
	}
	static class UDMMaterialValueFloat3RGBDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueFloat3RGBDynamic>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueFloat3RGBDynamic;

// Class DynamicMaterial.DMMaterialValueFloat3RGB
// 0x0010 (0x0070 - 0x0060)
class UDMMaterialValueFloat3RGB final : public UDMMaterialValueFloat
{
public:
	struct FLinearColor                           Value;                                             // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetValue(const struct FLinearColor& InValue);

	const struct FLinearColor GetValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueFloat3RGB")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueFloat3RGB")
	}
	static class UDMMaterialValueFloat3RGB* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueFloat3RGB>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueFloat3RGB;

// Class DynamicMaterial.DMMaterialValueFloat3XYZ
// 0x0018 (0x0078 - 0x0060)
class UDMMaterialValueFloat3XYZ final : public UDMMaterialValueFloat
{
public:
	struct FVector                                Value;                                             // 0x0060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetValue(const struct FVector& InValue);

	const struct FVector GetValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueFloat3XYZ")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueFloat3XYZ")
	}
	static class UDMMaterialValueFloat3XYZ* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueFloat3XYZ>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueFloat3XYZ;

// Class DynamicMaterial.DMParameterContainer
// 0x0000 (0x0000 - 0x0000)
class IDMParameterContainer final
{
public:
	void CopyParametersFrom(class UObject* InOther);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMParameterContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMParameterContainer")
	}
	static class IDMParameterContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDMParameterContainer>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IDMParameterContainer;

// Class DynamicMaterial.DMMaterialValueFloat4
// 0x0010 (0x0070 - 0x0060)
class UDMMaterialValueFloat4 final : public UDMMaterialValueFloat
{
public:
	struct FLinearColor                           Value;                                             // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetValue(const struct FLinearColor& InValue);

	const struct FLinearColor GetValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueFloat4")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueFloat4")
	}
	static class UDMMaterialValueFloat4* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueFloat4>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueFloat4;

// Class DynamicMaterial.DynamicMaterialModelEditorOnlyDataInterface
// 0x0000 (0x0000 - 0x0000)
class IDynamicMaterialModelEditorOnlyDataInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicMaterialModelEditorOnlyDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicMaterialModelEditorOnlyDataInterface")
	}
	static class IDynamicMaterialModelEditorOnlyDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDynamicMaterialModelEditorOnlyDataInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IDynamicMaterialModelEditorOnlyDataInterface;

// Class DynamicMaterial.DMTextureUVDynamic
// 0x0040 (0x0080 - 0x0040)
class UDMTextureUVDynamic final : public UDMMaterialComponentDynamic
{
public:
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Offset;                                            // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              Pivot;                                             // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Rotation;                                          // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Tiling;                                            // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetOffset(const struct FVector2D& InOffset);
	void SetPivot(const struct FVector2D& InPivot);
	void SetRotation(float InRotation);
	void SetTiling(const struct FVector2D& InTiling);

	const struct FVector2D GetOffset() const;
	class UDMTextureUV* GetParentTextureUV() const;
	const struct FVector2D GetPivot() const;
	float GetRotation() const;
	const struct FVector2D GetTiling() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMTextureUVDynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMTextureUVDynamic")
	}
	static class UDMTextureUVDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMTextureUVDynamic>();
	}
};
DUMPER7_ASSERTS_UDMTextureUVDynamic;

// Class DynamicMaterial.DMMaterialValueColorAtlas
// 0x0008 (0x0060 - 0x0058)
class UDMMaterialValueColorAtlas final : public UDMMaterialValue
{
public:
	float                                         Value;                                             // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetValue(float InValue);

	float GetValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueColorAtlas")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueColorAtlas")
	}
	static class UDMMaterialValueColorAtlas* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueColorAtlas>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueColorAtlas;

// Class DynamicMaterial.DMJsonSerializable
// 0x0000 (0x0000 - 0x0000)
class IDMJsonSerializable final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMJsonSerializable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMJsonSerializable")
	}
	static class IDMJsonSerializable* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDMJsonSerializable>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IDMJsonSerializable;

// Class DynamicMaterial.DMMaterialParameter
// 0x0008 (0x0038 - 0x0030)
class UDMMaterialParameter final : public UDMMaterialLinkedComponent
{
public:
	class FName                                   ParameterName;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UDynamicMaterialModel* GetMaterialModel() const;
	class FName GetParameterName() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialParameter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialParameter")
	}
	static class UDMMaterialParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialParameter>();
	}
};
DUMPER7_ASSERTS_UDMMaterialParameter;

// Class DynamicMaterial.DMMaterialValueBoolDynamic
// 0x0008 (0x0058 - 0x0050)
class UDMMaterialValueBoolDynamic final : public UDMMaterialValueDynamic
{
public:
	bool                                          Value;                                             // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetValue(bool InValue);

	bool GetValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueBoolDynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueBoolDynamic")
	}
	static class UDMMaterialValueBoolDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueBoolDynamic>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueBoolDynamic;

// Class DynamicMaterial.DMMaterialValueColorAtlasDynamic
// 0x0008 (0x0058 - 0x0050)
class UDMMaterialValueColorAtlasDynamic final : public UDMMaterialValueDynamic
{
public:
	float                                         Value;                                             // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetValue(float InValue);

	float GetValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueColorAtlasDynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueColorAtlasDynamic")
	}
	static class UDMMaterialValueColorAtlasDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueColorAtlasDynamic>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueColorAtlasDynamic;

// Class DynamicMaterial.DMMaterialValueFloat1Dynamic
// 0x0008 (0x0058 - 0x0050)
class UDMMaterialValueFloat1Dynamic final : public UDMMaterialValueDynamic
{
public:
	float                                         Value;                                             // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetValue(float InValue);

	float GetValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueFloat1Dynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueFloat1Dynamic")
	}
	static class UDMMaterialValueFloat1Dynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueFloat1Dynamic>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueFloat1Dynamic;

// Class DynamicMaterial.DMMaterialValueFloat2Dynamic
// 0x0010 (0x0060 - 0x0050)
class UDMMaterialValueFloat2Dynamic final : public UDMMaterialValueDynamic
{
public:
	struct FVector2D                              Value;                                             // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetValue(const struct FVector2D& InValue);

	const struct FVector2D GetValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueFloat2Dynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueFloat2Dynamic")
	}
	static class UDMMaterialValueFloat2Dynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueFloat2Dynamic>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueFloat2Dynamic;

// Class DynamicMaterial.DMMaterialValueFloat3RPYDynamic
// 0x0018 (0x0068 - 0x0050)
class UDMMaterialValueFloat3RPYDynamic final : public UDMMaterialValueDynamic
{
public:
	struct FRotator                               Value;                                             // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void SetValue(const struct FRotator& InValue);

	const struct FRotator GetValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueFloat3RPYDynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueFloat3RPYDynamic")
	}
	static class UDMMaterialValueFloat3RPYDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueFloat3RPYDynamic>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueFloat3RPYDynamic;

// Class DynamicMaterial.DMMaterialValueFloat3XYZDynamic
// 0x0018 (0x0068 - 0x0050)
class UDMMaterialValueFloat3XYZDynamic final : public UDMMaterialValueDynamic
{
public:
	struct FVector                                Value;                                             // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetValue(const struct FVector& InValue);

	const struct FVector GetValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueFloat3XYZDynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueFloat3XYZDynamic")
	}
	static class UDMMaterialValueFloat3XYZDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueFloat3XYZDynamic>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueFloat3XYZDynamic;

// Class DynamicMaterial.DMMaterialValueFloat4Dynamic
// 0x0010 (0x0060 - 0x0050)
class UDMMaterialValueFloat4Dynamic final : public UDMMaterialValueDynamic
{
public:
	struct FLinearColor                           Value;                                             // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetValue(const struct FLinearColor& InValue);

	const struct FLinearColor GetValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueFloat4Dynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueFloat4Dynamic")
	}
	static class UDMMaterialValueFloat4Dynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueFloat4Dynamic>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueFloat4Dynamic;

// Class DynamicMaterial.DMMaterialValueRenderTargetDynamic
// 0x0000 (0x0050 - 0x0050)
class UDMMaterialValueRenderTargetDynamic final : public UDMMaterialValueDynamic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueRenderTargetDynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueRenderTargetDynamic")
	}
	static class UDMMaterialValueRenderTargetDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueRenderTargetDynamic>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueRenderTargetDynamic;

// Class DynamicMaterial.DMMaterialValueTextureDynamic
// 0x0008 (0x0058 - 0x0050)
class UDMMaterialValueTextureDynamic final : public UDMMaterialValueDynamic
{
public:
	class UTexture*                               Value;                                             // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	void SetValue(class UTexture* InValue);

	class UTexture* GetValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMMaterialValueTextureDynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMMaterialValueTextureDynamic")
	}
	static class UDMMaterialValueTextureDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMMaterialValueTextureDynamic>();
	}
};
DUMPER7_ASSERTS_UDMMaterialValueTextureDynamic;

// Class DynamicMaterial.DMRenderTargetUMGWidgetRenderer
// 0x0018 (0x0080 - 0x0068)
class UDMRenderTargetUMGWidgetRenderer final : public UDMRenderTargetWidgetRendererBase
{
public:
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UWidget>                    WidgetClass;                                       // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                WidgetInstance;                                    // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	void SetWidgetClass(TSubclassOf<class UWidget> InWidgetClass);

	TSubclassOf<class UWidget> GetWidgetClass() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMRenderTargetUMGWidgetRenderer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMRenderTargetUMGWidgetRenderer")
	}
	static class UDMRenderTargetUMGWidgetRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMRenderTargetUMGWidgetRenderer>();
	}
};
DUMPER7_ASSERTS_UDMRenderTargetUMGWidgetRenderer;

// Class DynamicMaterial.DMValueDefinitionLibrary
// 0x0000 (0x0028 - 0x0028)
class UDMValueDefinitionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool BP_AreTypesCompatible(EDMValueType A, EDMValueType B, int32 AChannel, int32 BChannel);
	static const struct FDMValueDefinition GetTypeForFloatCount(int32 InFloatCount);
	static const struct FDMValueDefinition GetValueDefinition(EDMValueType InValueType);
	static const TArray<EDMValueType> GetValueTypes();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DMValueDefinitionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DMValueDefinitionLibrary")
	}
	static class UDMValueDefinitionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDMValueDefinitionLibrary>();
	}
};
DUMPER7_ASSERTS_UDMValueDefinitionLibrary;

// Class DynamicMaterial.DynamicMaterialInstance
// 0x0008 (0x0348 - 0x0340)
class UDynamicMaterialInstance final : public UMaterialInstanceDynamic
{
public:
	class UDynamicMaterialModelBase*              MaterialModelBase;                                 // 0x0340(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	class UDynamicMaterialModel* GetMaterialModel() const;
	class UDynamicMaterialModelBase* GetMaterialModelBase() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicMaterialInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicMaterialInstance")
	}
	static class UDynamicMaterialInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicMaterialInstance>();
	}
};
DUMPER7_ASSERTS_UDynamicMaterialInstance;

// Class DynamicMaterial.DynamicMaterialModelBase
// 0x0000 (0x0028 - 0x0028)
class UDynamicMaterialModelBase : public UObject
{
public:
	class UDynamicMaterialModel* ResolveMaterialModel();

	class UDynamicMaterialInstance* GetDynamicMaterialInstance() const;
	class UMaterial* GetGeneratedMaterial() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicMaterialModelBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicMaterialModelBase")
	}
	static class UDynamicMaterialModelBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicMaterialModelBase>();
	}
};
DUMPER7_ASSERTS_UDynamicMaterialModelBase;

// Class DynamicMaterial.DynamicMaterialModel
// 0x0188 (0x01B0 - 0x0028)
class UDynamicMaterialModel final : public UDynamicMaterialModelBase
{
public:
	TArray<class UDMMaterialValue*>               Values;                                            // 0x0028(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	TSet<class UDMMaterialComponent*>             RuntimeComponents;                                 // 0x0038(0x0050)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, EditConst, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	TMap<class FName, TWeakObjectPtr<class UDMMaterialParameter>> ParameterMap;                      // 0x0088(0x0050)(Edit, DisableEditOnTemplate, EditConst, Protected, TextExportTransient, UObjectWrapper, NativeAccessSpecifierProtected)
	class UMaterial*                              DynamicMaterial;                                   // 0x00D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, Protected, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UDynamicMaterialInstance*               DynamicMaterialInstance;                           // 0x00E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, Protected, TextExportTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UDMMaterialValue*                       GlobalBaseColorParameterValue;                     // 0x00E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UDMMaterialValue*                       GlobalEmissiveColorParameterValue;                 // 0x00F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UDMMaterialValue*                       GlobalOpacityParameterValue;                       // 0x00F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UDMMaterialValue*                       GlobalRoughnessParameterValue;                     // 0x0100(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UDMMaterialValue*                       GlobalSpecularParameterValue;                      // 0x0108(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UDMMaterialValue*                       GlobalMetallicParameterValue;                      // 0x0110(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UDMMaterialValue*                       GlobalNormalParameterValue;                        // 0x0118(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UDMMaterialValue*                       GlobalPixelDepthOffsetParameterValue;              // 0x0120(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UDMMaterialValue*                       GlobalWorldPositionOffsetParameterValue;           // 0x0128(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UDMMaterialValue*                       GlobalAmbientOcclusionParameterValue;              // 0x0130(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UDMMaterialValue*                       GlobalAnisotropyParameterValue;                    // 0x0138(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UDMMaterialValue*                       GlobalRefractionParameterValue;                    // 0x0140(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UDMMaterialValue*                       GlobalTangentParameterValue;                       // 0x0148(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UDMMaterialValue*                       GlobalDisplacementParameterValue;                  // 0x0150(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UDMMaterialValue*                       GlobalSubsurfaceColorParameterValue;               // 0x0158(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UDMMaterialValue*                       GlobalSurfaceThicknessParameterValue;              // 0x0160(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
