#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Env_DirLight_Struct

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct Env_DirLight_Struct.Env_DirLight_Struct
// 0x0058 (0x0058 - 0x0000)
struct FEnv_DirLight_Struct final
{
public:
	double                                        Intensity_5_7729851B41D261C98C4569827E3FCFCE;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_6_7155FF624A7BCA82C9320B993FA9A29A;          // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temperature_19_85A048D54B7D5ED27D1CC5A74DE7EA82;   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VolumetricScatteringIntensity_29_5F98107C4D2C06A965D2CCACF36F86AD; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IndirectLightingIntensity_30_B0A43C1247A241131CBA558C5FE98DB0; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseTemperature_32_5A3EDF3A443B99F6086A448D1B10BED4; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableLightShaftBloom_34_0E3A10B34B4FA656276B91A3FE180E0B; // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableLightShaftOcclusion_36_28894D014A5D410C75B33E8D4D86789C; // 0x0032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        OcclusionMaskDarkness_37_7BA0495B4CABC7ED77C103B79BE66E4B; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OcclusionDepthRange_38_B300E5F5454979354317599E908C6453; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EComponentMobility                            Mobility_41_5DCDE179462E00772661B9A44FF8862B;      // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SourceAngle_40_CCFAB2BA4EB6F740481DDFB0E29969D9;   // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FEnv_DirLight_Struct;

SDK_NAMESPACE_END
