#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Ammunition_Swap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_Ammunition_Swap.GA_Ammunition_Swap_C
// 0x0028 (0x03D0 - 0x03A8)
class UGA_Ammunition_Swap_C final : public UGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FActiveGameplayEffectHandle            SwapDurationEffect;                                // 0x03B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ATyrWheeledVehiclePawnBase*             PlayerPawn;                                        // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           NewAmmunitionSlot;                                 // 0x03C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bStartedFromReload;                                // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Ammunition_Swap(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void OnCooldownCleared_700694B64F765365AC609CAEBC663748();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Ammunition_Swap_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Ammunition_Swap_C")
	}
	static class UGA_Ammunition_Swap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Ammunition_Swap_C>();
	}
};
DUMPER7_ASSERTS_UGA_Ammunition_Swap_C;

SDK_NAMESPACE_END
