#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Ping

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_Ping.GA_Ping_C
// 0x00B8 (0x0460 - 0x03A8)
class UGA_Ping_C final : public UGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Instigator;                                        // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        PingLifetime;                                      // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsMinimap;                                        // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0xF];                                      // 0x03C1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x03D0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EventTag;                                          // 0x0430(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        FindVehicleRadius;                                 // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EnemyPingLifetime;                                 // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VehiclePingOffset;                                 // 0x0448(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Cancelled_A810E076494228D48DC741AE2B8D5CF4(const struct FGameplayAbilityTargetDataHandle& Data);
	void Cancelled_AF8CBF6744BB68AA387616BDDDB2CA0F(const struct FGameplayAbilityTargetDataHandle& Data);
	void CheckVehiclesNearCursor(const struct FVector& InStartTraceVec, const struct FVector& InEndTraceVec, bool* bVehicleFound, struct FTransform* VehicleTransform);
	void ExecuteUbergraph_GA_Ping(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void ValidData_A810E076494228D48DC741AE2B8D5CF4(const struct FGameplayAbilityTargetDataHandle& Data);
	void ValidData_AF8CBF6744BB68AA387616BDDDB2CA0F(const struct FGameplayAbilityTargetDataHandle& Data);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Ping_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Ping_C")
	}
	static class UGA_Ping_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Ping_C>();
	}
};
DUMPER7_ASSERTS_UGA_Ping_C;

SDK_NAMESPACE_END
