#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Stealth

#include "Basic.hpp"

#include "DataRegistry_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_Stealth.GA_Stealth_C
// 0x0090 (0x0468 - 0x03D8)
class UGA_Stealth_C final : public UTyrCommanderAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        Duration;                                          // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WindUpTime;                                        // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WindOutAnimTime;                                   // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEffectRemoved* WaitForStealthEffectRemovedTask;                   // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bFinishedDuration;                                 // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           KeystoneTalent26;                                  // 0x0404(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            KeystoneTalent26GEHandle;                          // 0x040C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           KeystoneTalent27;                                  // 0x0414(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            KeystoneTalent27GEHandle;                          // 0x041C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      WaitForAbilityDamagedTagTask;                      // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  RecastListenerAction;                              // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bWindupInterrupted;                                // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           WindupHandle;                                      // 0x0440(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DurationHandle;                                    // 0x0448(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitAttributeChanged*     WaitForAnyDamageTask;                              // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        BodyEffectVisualTimer;                             // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           BodyEffectTimer;                                   // 0x0460(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AbilityTimeout();
	void Added_AC22E3D940A7AC3D36D6BC9809012A8F();
	void Changed_7BF5B72C4948BA9BD2F7AABCB49F7017(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue);
	void CheckAndApplyKeystone27();
	void ExecuteUbergraph_GA_Stealth(int32 EntryPoint);
	void InvalidHandle_4BC4D4A3432DE02EF0FDBC8EE3CFAE0F(const struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendedIn_12BE53E74FC4AFA7C4A0A8BA3C7DD607();
	void OnBlendedIn_12D3F93F4331285014DB3CA0E4FB02CA();
	void OnBlendedIn_FC20BC0A48A3C6A7831971BC3162ABC3();
	void OnBlendOut_12BE53E74FC4AFA7C4A0A8BA3C7DD607();
	void OnBlendOut_12D3F93F4331285014DB3CA0E4FB02CA();
	void OnBlendOut_FC20BC0A48A3C6A7831971BC3162ABC3();
	void OnCancelled_12BE53E74FC4AFA7C4A0A8BA3C7DD607();
	void OnCancelled_12D3F93F4331285014DB3CA0E4FB02CA();
	void OnCancelled_FC20BC0A48A3C6A7831971BC3162ABC3();
	void OnCompleted_12BE53E74FC4AFA7C4A0A8BA3C7DD607();
	void OnCompleted_12D3F93F4331285014DB3CA0E4FB02CA();
	void OnCompleted_FC20BC0A48A3C6A7831971BC3162ABC3();
	void OnInterrupted_12BE53E74FC4AFA7C4A0A8BA3C7DD607();
	void OnInterrupted_12D3F93F4331285014DB3CA0E4FB02CA();
	void OnInterrupted_FC20BC0A48A3C6A7831971BC3162ABC3();
	void OnMessageReceived_7F2E311D4DFFF8A2B5EA4FA82B4F2C43(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnNotifyBegin_12BE53E74FC4AFA7C4A0A8BA3C7DD607(class FName NotifyName);
	void OnNotifyBegin_12D3F93F4331285014DB3CA0E4FB02CA(class FName NotifyName);
	void OnNotifyBegin_FC20BC0A48A3C6A7831971BC3162ABC3(class FName NotifyName);
	void OnNotifyEnd_12BE53E74FC4AFA7C4A0A8BA3C7DD607(class FName NotifyName);
	void OnNotifyEnd_12D3F93F4331285014DB3CA0E4FB02CA(class FName NotifyName);
	void OnNotifyEnd_FC20BC0A48A3C6A7831971BC3162ABC3(class FName NotifyName);
	void OnRemoved_4BC4D4A3432DE02EF0FDBC8EE3CFAE0F(const struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo);
	void OnStarted_12BE53E74FC4AFA7C4A0A8BA3C7DD607();
	void OnStarted_12D3F93F4331285014DB3CA0E4FB02CA();
	void OnStarted_FC20BC0A48A3C6A7831971BC3162ABC3();
	void RecalculateReloadTime(const struct FGameplayTag& InCooldownTag, class ATyrWheeledVehiclePawnBase* InPlayerPawn);
	void Server_EndAbility();
	void StartStealth();
	void StartStealthBodyEffect();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Stealth_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Stealth_C")
	}
	static class UGA_Stealth_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Stealth_C>();
	}
};
DUMPER7_ASSERTS_UGA_Stealth_C;

SDK_NAMESPACE_END
