#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_AmmunitionHit_Standard

#include "Basic.hpp"

#include "GameplayAbilities_classes.hpp"
#include "Tyr_structs.hpp"
#include "DataRegistry_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GC_AmmunitionHit_Standard.GC_AmmunitionHit_Standard_C
// 0x0028 (0x0068 - 0x0040)
class UGC_AmmunitionHit_Standard_C final : public UGameplayCueNotify_Static
{
public:
	double                                        ImpactBusMinDamage;                                // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ImpactBusMaxDamage;                                // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ImpactBusMinHzNormalized;                          // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ImpactBusMaxHzNormalized;                          // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LargeImpactDamageCutoff;                           // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Get_Impact_Sounds(const struct FGameplayTag& InSurfaceTypeTag, class ATyrAmmunition* InImpactingProjectile, bool bInWasModuleHit, bool bInWasDamageAbsorbed, class AActor* InHitActor, double InDamageDealt, class USoundBase** SurfaceImpactSound, class USoundBase** VehicleImpactSound, class USoundBase** TwoDImpactRecievedSound, class USoundBase** TwoDImpactCausedSound) const;
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters) const;
	void UpdateCameraShakeForLocalTarget(class AActor* InHitTarget, const struct FVector& InShakeDirection, double InDamageDealt) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GC_AmmunitionHit_Standard_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GC_AmmunitionHit_Standard_C")
	}
	static class UGC_AmmunitionHit_Standard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGC_AmmunitionHit_Standard_C>();
	}
};
DUMPER7_ASSERTS_UGC_AmmunitionHit_Standard_C;

SDK_NAMESPACE_END
