#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Bush_ActivatingShader

#include "Basic.hpp"

#include "GameplayAbilities_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GC_Bush_ActivatingShader.GC_Bush_ActivatingShader_C
// 0x0060 (0x0378 - 0x0318)
class AGC_Bush_ActivatingShader_C final : public AGameplayCueNotify_Actor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             OriginalMaterials;                                 // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         TotalMaterialIndex;                                // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       DMIArray;                                          // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 OriginalArrayMatSlotRef;                           // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class USkeletalMeshComponent*>         OriginalArrayMeshRef;                              // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UMaterialInterface*>             OriginalArray;                                     // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GC_Bush_ActivatingShader_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GC_Bush_ActivatingShader_C")
	}
	static class AGC_Bush_ActivatingShader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Bush_ActivatingShader_C>();
	}
};
DUMPER7_ASSERTS_AGC_Bush_ActivatingShader_C;

SDK_NAMESPACE_END
