#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_HealingShot_WindupNotify

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GC_HealingShot_WindupNotify.GC_HealingShot_WindupNotify_C
// 0x0028 (0x0340 - 0x0318)
class AGC_HealingShot_WindupNotify_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SpawnedSystem_Barrel;                              // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ChargeUpSound;                                     // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SpawnedSystem_Turret;                              // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_HealingShot_WindupNotify(int32 EntryPoint);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void OnMessageReceived_1C829833486E42207A9C6CB9FD20751C(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GC_HealingShot_WindupNotify_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GC_HealingShot_WindupNotify_C")
	}
	static class AGC_HealingShot_WindupNotify_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_HealingShot_WindupNotify_C>();
	}
};
DUMPER7_ASSERTS_AGC_HealingShot_WindupNotify_C;

SDK_NAMESPACE_END
