#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Module_Fire_Damaged

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GC_Module_Fire_Damaged.GC_Module_Fire_Damaged_C
// 0x0028 (0x0340 - 0x0318)
class AGC_Module_Fire_Damaged_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        gp_impact_veh_destruct_fire;                       // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SpawnedSystem;                                     // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SpawnedSound;                                      // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void CleanupSpawnedComponents();
	void ExecuteUbergraph_GC_Module_Fire_Damaged(int32 EntryPoint);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void OnMessageReceived_EC9A17D4454FCE17865CA98148383B5D(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GC_Module_Fire_Damaged_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GC_Module_Fire_Damaged_C")
	}
	static class AGC_Module_Fire_Damaged_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Module_Fire_Damaged_C>();
	}
};
DUMPER7_ASSERTS_AGC_Module_Fire_Damaged_C;

SDK_NAMESPACE_END
