#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_MainWeapon_IntraclipReload

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GC_MainWeapon_IntraclipReload.GC_MainWeapon_IntraclipReload_C
// 0x0030 (0x0348 - 0x0318)
class AGC_MainWeapon_IntraclipReload_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            ReloadEffect;                                      // 0x0328(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SpawnedIntraclipSound;                             // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseTank_C*                         TrackedVehicle;                                    // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SpawnedIntraclipNearFinishSound;                   // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void CheckForIntraclipReloadTime();
	void ExecuteUbergraph_GC_MainWeapon_IntraclipReload(int32 EntryPoint);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void ReceiveTick(float DeltaSeconds);
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GC_MainWeapon_IntraclipReload_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GC_MainWeapon_IntraclipReload_C")
	}
	static class AGC_MainWeapon_IntraclipReload_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_MainWeapon_IntraclipReload_C>();
	}
};
DUMPER7_ASSERTS_AGC_MainWeapon_IntraclipReload_C;

SDK_NAMESPACE_END
