#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_StealthDuration

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GC_StealthDuration.GC_StealthDuration_C
// 0x00F8 (0x0410 - 0x0318)
class AGC_StealthDuration_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         UnstealthTimeline_Stealthing_1F809A5048039112B2B749929F03B4DF; // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            UnstealthTimeline__Direction_1F809A5048039112B2B749929F03B4DF; // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     UnstealthTimeline;                                 // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         StealthTimeline_Stealthing_52D66BBF4A7A0D2847515592820A5385; // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            StealthTimeline__Direction_52D66BBF4A7A0D2847515592820A5385; // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     StealthTimeline;                                   // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         RevealingSwipe_Stealthing_EAE20A7D46EBEAB06C7D7A90D712F615; // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RevealingSwipe__Direction_EAE20A7D46EBEAB06C7D7A90D712F615; // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RevealingSwipe;                                    // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             OriginalMaterials;                                 // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInterface*                     StealthShader;                                     // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       DMI_StealthShaders;                                // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class USkeletalMeshComponent*>         Arr_MeshPieces;                                    // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class ABP_Stealth_C*                          CastingPawn;                                       // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Duration;                                          // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartTime;                                         // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CountdownSoundTime;                                // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CountdownAudioTimerHandle;                         // 0x03B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 VisualMesh;                                        // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class UMaterialInterface*>  OriginalSkinMIs;                                   // 0x03C0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AudioStart();
	void AudioStop();
	void CountdownAudioStart();
	void ExecuteUbergraph_GC_StealthDuration(int32 EntryPoint);
	void OnBlendOut_F90B49AC432E75CC07A209980750AA93(class FName NotifyName);
	void OnCompleted_F90B49AC432E75CC07A209980750AA93(class FName NotifyName);
	void OnInterrupted_F90B49AC432E75CC07A209980750AA93(class FName NotifyName);
	void OnNotifyBegin_F90B49AC432E75CC07A209980750AA93(class FName NotifyName);
	void OnNotifyEnd_F90B49AC432E75CC07A209980750AA93(class FName NotifyName);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void ReceiveDestroyed();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void RevealingSwipe__FinishedFunc();
	void RevealingSwipe__UpdateFunc();
	void Stealthing_Activate();
	void Stealthing_Deactivate();
	void StealthTimeline__FinishedFunc();
	void StealthTimeline__UpdateFunc();
	void UnstealthTimeline__FinishedFunc();
	void UnstealthTimeline__UpdateFunc();
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GC_StealthDuration_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GC_StealthDuration_C")
	}
	static class AGC_StealthDuration_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_StealthDuration_C>();
	}
};
DUMPER7_ASSERTS_AGC_StealthDuration_C;

SDK_NAMESPACE_END
