#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeometryMask

#include "Basic.hpp"

#include "GeometryMask_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


SDK_NAMESPACE_START

// Class GeometryMask.GeometryMaskCanvas
// 0x0078 (0x00A0 - 0x0028)
class UGeometryMaskCanvas final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometryMaskCanvasId                  CanvasId;                                          // 0x0048(0x0014)(Transient, DuplicateTransient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   CanvasName;                                        // 0x005C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bApplyBlur;                                        // 0x0064(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BlurStrength;                                      // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bApplyFeather;                                     // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OuterFeatherRadius;                                // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         InnerFeatherRadius;                                // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryMaskCanvasResource*            CanvasResource;                                    // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	EGeometryMaskColorChannel                     ColorChannel;                                      // 0x0088(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_89[0x17];                                      // 0x0089(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	EGeometryMaskColorChannel GetColorChannel() const;
	class UCanvasRenderTarget2D* GetTexture() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeometryMaskCanvas")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeometryMaskCanvas")
	}
	static class UGeometryMaskCanvas* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometryMaskCanvas>();
	}
};
DUMPER7_ASSERTS_UGeometryMaskCanvas;

// Class GeometryMask.GeometryMaskCanvasActor
// 0x0020 (0x02C8 - 0x02A8)
class AGeometryMaskCanvasActor final : public AActor
{
public:
	class FName                                   CanvasName;                                        // 0x02A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryMaskCanvas*                    Canvas;                                            // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<TScriptInterface<class IGeometryMaskWriteInterface>> Writers;                             // 0x02B8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	class UCanvasRenderTarget2D* GetTexture();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeometryMaskCanvasActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeometryMaskCanvasActor")
	}
	static class AGeometryMaskCanvasActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGeometryMaskCanvasActor>();
	}
};
DUMPER7_ASSERTS_AGeometryMaskCanvasActor;

// Class GeometryMask.GeometryMaskCanvasResource
// 0x01C8 (0x01F0 - 0x0028)
class alignas(0x10) UGeometryMaskCanvasResource final : public UObject
{
public:
	TMap<EGeometryMaskColorChannel, struct FGeometryMaskCanvasId> DependentCanvasIds;                // 0x0028(0x0050)(EditFixedSize, NoClear, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x20];                                      // 0x0078(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumUsedChannels;                                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvas*                                CanvasObject;                                      // 0x00A0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	struct FIntPoint                              MaxViewportSize;                                   // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCanvasRenderTarget2D*                  RenderTargetTexture;                               // 0x00B0(0x0008)(ZeroConstructor, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_B8[0x138];                                     // 0x00B8(0x0138)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeometryMaskCanvasResource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeometryMaskCanvasResource")
	}
	static class UGeometryMaskCanvasResource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometryMaskCanvasResource>();
	}
};
DUMPER7_ASSERTS_UGeometryMaskCanvasResource;

// Class GeometryMask.GeometryMaskCanvasReferenceComponentBase
// 0x0020 (0x00D8 - 0x00B8)
class UGeometryMaskCanvasReferenceComponentBase : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UGeometryMaskCanvas>     CanvasWeak;                                        // 0x00D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, TextExportTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UCanvasRenderTarget2D* GetTexture();
	void ReceiveSetCanvas(const class UGeometryMaskCanvas* InCanvas);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeometryMaskCanvasReferenceComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeometryMaskCanvasReferenceComponentBase")
	}
	static class UGeometryMaskCanvasReferenceComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometryMaskCanvasReferenceComponentBase>();
	}
};
DUMPER7_ASSERTS_UGeometryMaskCanvasReferenceComponentBase;

// Class GeometryMask.GeometryMaskReadComponent
// 0x0018 (0x00F0 - 0x00D8)
class UGeometryMaskReadComponent final : public UGeometryMaskCanvasReferenceComponentBase
{
public:
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometryMaskReadParameters            Parameters;                                        // 0x00E0(0x000C)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeometryMaskReadComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeometryMaskReadComponent")
	}
	static class UGeometryMaskReadComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometryMaskReadComponent>();
	}
};
DUMPER7_ASSERTS_UGeometryMaskReadComponent;

// Class GeometryMask.GeometryMaskSettings
// 0x0008 (0x0040 - 0x0038)
class UGeometryMaskSettings final : public UDeveloperSettings
{
public:
	float                                         DefaultResolutionMultiplier;                       // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeometryMaskSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeometryMaskSettings")
	}
	static class UGeometryMaskSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometryMaskSettings>();
	}
};
DUMPER7_ASSERTS_UGeometryMaskSettings;

// Class GeometryMask.GeometryMaskSubsystem
// 0x0090 (0x00C0 - 0x0030)
class UGeometryMaskSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x38];                                      // 0x0030(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryMaskCanvas*                    DefaultCanvas;                                     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	TSet<class UGeometryMaskCanvasResource*>      CanvasResources;                                   // 0x0070(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	class UGeometryMaskCanvas* GetDefaultCanvas();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeometryMaskSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeometryMaskSubsystem")
	}
	static class UGeometryMaskSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometryMaskSubsystem>();
	}
};
DUMPER7_ASSERTS_UGeometryMaskSubsystem;

// Class GeometryMask.GeometryMaskWorldSubsystem
// 0x0090 (0x00C0 - 0x0030)
class UGeometryMaskWorldSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x40];                                      // 0x0030(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<TWeakObjectPtr<class ULevel>, struct FGeometryMaskLevelState> LevelStates;                  // 0x0070(0x0050)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeometryMaskWorldSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeometryMaskWorldSubsystem")
	}
	static class UGeometryMaskWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometryMaskWorldSubsystem>();
	}
};
DUMPER7_ASSERTS_UGeometryMaskWorldSubsystem;

// Class GeometryMask.GeometryMaskWriteMeshComponent
// 0x00D0 (0x01A8 - 0x00D8)
class UGeometryMaskWriteMeshComponent final : public UGeometryMaskCanvasReferenceComponentBase
{
public:
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometryMaskWriteParameters           Parameters;                                        // 0x00E0(0x0020)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bWriteWhenHidden;                                  // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastPrimitiveComponentCount;                       // 0x0104(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, TWeakObjectPtr<class USceneComponent>> CachedComponentsWeak;                   // 0x0108(0x0050)(ExportObject, DuplicateTransient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<class FName, struct FGeometryMaskBatchElementData> CachedMeshData;                          // 0x0158(0x0050)(DuplicateTransient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeometryMaskWriteMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeometryMaskWriteMeshComponent")
	}
	static class UGeometryMaskWriteMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometryMaskWriteMeshComponent>();
	}
};
DUMPER7_ASSERTS_UGeometryMaskWriteMeshComponent;

// Class GeometryMask.GeometryMaskReadInterface
// 0x0000 (0x0000 - 0x0000)
class IGeometryMaskReadInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeometryMaskReadInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeometryMaskReadInterface")
	}
	static class IGeometryMaskReadInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGeometryMaskReadInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGeometryMaskReadInterface;

// Class GeometryMask.GeometryMaskWriteInterface
// 0x0000 (0x0000 - 0x0000)
class IGeometryMaskWriteInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeometryMaskWriteInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeometryMaskWriteInterface")
	}
	static class IGeometryMaskWriteInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGeometryMaskWriteInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGeometryMaskWriteInterface;

SDK_NAMESPACE_END
