#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC_Replay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass PC_Replay.PC_Replay_C
// 0x0028 (0x0888 - 0x0860)
class APC_Replay_C final : public ATyrReplayController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0860(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_SpectatorComponent_C*              SpectatorComponent;                                // 0x0868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGameplayCameraComponent*               GameplayCamera;                                    // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bAltInfoEnabled;                                   // 0x0878(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHUDMediaControlsVisible;                          // 0x0879(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87A[0x6];                                      // 0x087A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Replay_HUD_C*                       VMReplayHUD;                                       // 0x0880(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PC_Replay(int32 EntryPoint);
	void InpActEvt_IA_AltInfo_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_AltInfo_K2Node_EnhancedInputActionEvent_4(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Replay_ToggleControls_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Replay_ToggleHud_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Replay_TogglePlayback_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void OnMatchStartAnimationFinished();
	void OnMouseMove();
	void ReceiveBeginPlay();
	void ReceiveBeginSpectatingState();
	void SetInGameScoreboardVisible(bool bIsVisible);

	void GetAltInfoEnabled(bool* Value) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PC_Replay_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PC_Replay_C")
	}
	static class APC_Replay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APC_Replay_C>();
	}
};
DUMPER7_ASSERTS_APC_Replay_C;

SDK_NAMESPACE_END
