#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC_TyrLobby

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function PC_TyrLobby.PC_TyrLobby_C.ExecuteUbergraph_PC_TyrLobby
// 0x0050 (0x0050 - 0x0000)
struct PC_TyrLobby_C_ExecuteUbergraph_PC_TyrLobby final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGarageCameraViewTarget_bDidSetViewTarget; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TyrLobbyGameMode_C*                 K2Node_DynamicCast_AsBP_Tyr_Lobby_Game_Mode;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_MapName;                        // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_TyrLobbyGameState_C*                K2Node_DynamicCast_AsBP_Tyr_Lobby_Game_State;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_NewMapName;                           // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PC_TyrLobby_C_ExecuteUbergraph_PC_TyrLobby;

// Function PC_TyrLobby.PC_TyrLobby_C.Server_SetMapName
// 0x0008 (0x0008 - 0x0000)
struct PC_TyrLobby_C_Server_SetMapName final
{
public:
	class FName                                   MapName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PC_TyrLobby_C_Server_SetMapName;

// Function PC_TyrLobby.PC_TyrLobby_C.SetMapName
// 0x0008 (0x0008 - 0x0000)
struct PC_TyrLobby_C_SetMapName final
{
public:
	class FName                                   NewMapName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PC_TyrLobby_C_SetMapName;

// Function PC_TyrLobby.PC_TyrLobby_C.GetLobbyMenuWidgetClass
// 0x0028 (0x0028 - 0x0000)
struct PC_TyrLobby_C_GetLobbyMenuWidgetClass final
{
public:
	TSoftClassPtr<class UClass>                   ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PC_TyrLobby_C_GetLobbyMenuWidgetClass;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
