#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCGExternalDataInterop

#include "Basic.hpp"

#include "PCGExternalDataInterop_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PCG_classes.hpp"


SDK_NAMESPACE_START

// Class PCGExternalDataInterop.PCGLoadAlembicSettings
// 0x0048 (0x0158 - 0x0110)
class UPCGLoadAlembicSettings final : public UPCGExternalDataSettings
{
public:
	struct FFilePath                              AlembicFilePath;                                   // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ConversionScale;                                   // 0x0120(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ConversionRotation;                                // 0x0138(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConversionFlipHandedness;                         // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetupFromStandard(EPCGLoadAlembicStandardSetup InSetup);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGLoadAlembicSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGLoadAlembicSettings")
	}
	static class UPCGLoadAlembicSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGLoadAlembicSettings>();
	}
};
DUMPER7_ASSERTS_UPCGLoadAlembicSettings;

SDK_NAMESPACE_END
