#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PropertyAnimatorCore

#include "Basic.hpp"

#include "MovieScene_structs.hpp"


SDK_NAMESPACE_START

// Enum PropertyAnimatorCore.EMovieSceneAnimatorEvalTimeMode
// NumValues: 0x0004
enum class EMovieSceneAnimatorEvalTimeMode : uint8
{
	Sequence                                 = 0,
	Section                                  = 1,
	Custom                                   = 2,
	EMovieSceneAnimatorEvalTimeMode_MAX      = 3,
};

// Enum PropertyAnimatorCore.EPropertyAnimatorPropertySupport
// NumValues: 0x0005
enum class EPropertyAnimatorPropertySupport : uint8
{
	None                                     = 0,
	Incomplete                               = 1,
	Complete                                 = 2,
	All                                      = 3,
	EPropertyAnimatorPropertySupport_MAX     = 4,
};

// Enum PropertyAnimatorCore.EPropertyAnimatorCoreMode
// NumValues: 0x0003
enum class EPropertyAnimatorCoreMode : uint8
{
	Absolute                                 = 0,
	Additive                                 = 1,
	EPropertyAnimatorCoreMode_MAX            = 2,
};

// Enum PropertyAnimatorCore.EBoolConverterComparison
// NumValues: 0x0007
enum class EBoolConverterComparison : uint8
{
	Equal                                    = 0,
	NotEqual                                 = 1,
	Greater                                  = 2,
	Less                                     = 3,
	GreaterEqual                             = 4,
	LessEqual                                = 5,
	EBoolConverterComparison_MAX             = 6,
};

// Enum PropertyAnimatorCore.EInt32ConverterMethod
// NumValues: 0x0004
enum class EInt32ConverterMethod : uint8
{
	Round                                    = 0,
	Floor                                    = 1,
	Ceil                                     = 2,
	EInt32ConverterMethod_MAX                = 3,
};

// Enum PropertyAnimatorCore.EPropertyAnimatorCoreManualStatus
// NumValues: 0x0005
enum class EPropertyAnimatorCoreManualStatus : uint8
{
	Stopped                                  = 0,
	Paused                                   = 1,
	PlayingForward                           = 2,
	PlayingBackward                          = 3,
	EPropertyAnimatorCoreManualStatus_MAX    = 4,
};

// Enum PropertyAnimatorCore.EPropertyAnimatorCoreSystemMode
// NumValues: 0x0004
enum class EPropertyAnimatorCoreSystemMode : uint8
{
	LocalTime                                = 0,
	Countdown                                = 1,
	Stopwatch                                = 2,
	EPropertyAnimatorCoreSystemMode_MAX      = 3,
};

// Enum PropertyAnimatorCore.EPropertyAnimatorCoreSystemCountdownFormat
// NumValues: 0x0003
enum class EPropertyAnimatorCoreSystemCountdownFormat : uint8
{
	Duration                                 = 0,
	Target                                   = 1,
	EPropertyAnimatorCoreSystemCountdownFormat_MAX = 2,
};

// ScriptStruct PropertyAnimatorCore.MovieSceneAnimatorEvalTemplate
// 0x0020 (0x0040 - 0x0020)
struct FMovieSceneAnimatorEvalTemplate final : public FMovieSceneEvalTemplate
{
public:
	uint8                                         Pad_20[0x20];                                      // 0x0020(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneAnimatorEvalTemplate;

// ScriptStruct PropertyAnimatorCore.PropertyAnimatorCoreConverterRuleBase
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct SDK_ALIGN(0x01) FPropertyAnimatorCoreConverterRuleBase
{
};
#pragma pack(pop)
DUMPER7_ASSERTS_FPropertyAnimatorCoreConverterRuleBase;

// ScriptStruct PropertyAnimatorCore.BoolConverterCondition
// 0x0010 (0x0010 - 0x0000)
struct FBoolConverterCondition final
{
public:
	EBoolConverterComparison                      Comparison;                                        // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Threshold;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBoolConverterCondition;

// ScriptStruct PropertyAnimatorCore.BoolConverterRule
// 0x0010 (0x0010 - 0x0000)
struct FBoolConverterRule final : public FPropertyAnimatorCoreConverterRuleBase
{
public:
	TArray<struct FBoolConverterCondition>        TrueConditions;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBoolConverterRule;

// ScriptStruct PropertyAnimatorCore.Int32ConverterRule
// 0x0001 (0x0001 - 0x0000)
struct FInt32ConverterRule final : public FPropertyAnimatorCoreConverterRuleBase
{
public:
	EInt32ConverterMethod                         Method;                                            // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInt32ConverterRule;

// ScriptStruct PropertyAnimatorCore.PropertyAnimatorCoreData
// 0x0068 (0x0068 - 0x0000)
struct FPropertyAnimatorCoreData final
{
public:
	TWeakObjectPtr<class UObject>                 OwnerWeak;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 PropertyDisplayName;                               // 0x0008(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 PathHash;                                          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 LocatorPath;                                       // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TFieldPath<class FProperty>>           ChainProperties;                                   // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UFunction>               SetterFunctionWeak;                                // 0x0048(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSetterFunctionCached;                             // 0x0050(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UPropertyAnimatorCoreResolver> PropertyResolverClass;                          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPropertyAnimatorCoreHandlerBase*       PropertyHandler;                                   // 0x0060(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
};
DUMPER7_ASSERTS_FPropertyAnimatorCoreData;

// ScriptStruct PropertyAnimatorCore.PropertyAnimatorCoreSequencerTimeSourceEvalResult
// 0x0018 (0x0018 - 0x0000)
struct FPropertyAnimatorCoreSequencerTimeSourceEvalResult final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        EvalTime;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPropertyAnimatorCoreSequencerTimeSourceEvalResult;

SDK_NAMESPACE_END
