#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PropertyAnimatorCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "PropertyAnimatorCore_structs.hpp"
#include "Engine_classes.hpp"
#include "MovieScene_classes.hpp"
#include "DeveloperSettings_classes.hpp"


SDK_NAMESPACE_START

// Class PropertyAnimatorCore.MovieSceneAnimatorSection
// 0x0018 (0x0120 - 0x0108)
class UMovieSceneAnimatorSection final : public UMovieSceneSection
{
public:
	EMovieSceneAnimatorEvalTimeMode               EvalTimeMode;                                      // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CustomStartTime;                                   // 0x0110(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        CustomEndTime;                                     // 0x0118(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneAnimatorSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneAnimatorSection")
	}
	static class UMovieSceneAnimatorSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneAnimatorSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneAnimatorSection;

// Class PropertyAnimatorCore.MovieSceneAnimatorTrack
// 0x0018 (0x0128 - 0x0110)
class UMovieSceneAnimatorTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0118(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneAnimatorTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneAnimatorTrack")
	}
	static class UMovieSceneAnimatorTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneAnimatorTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneAnimatorTrack;

// Class PropertyAnimatorCore.PropertyAnimatorCorePresetBase
// 0x0028 (0x0050 - 0x0028)
class UPropertyAnimatorCorePresetBase : public UObject
{
public:
	class FName                                   PresetName;                                        // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PresetVersion;                                     // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PresetFormat;                                      // 0x0034(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PresetContent;                                     // 0x0040(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCorePresetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCorePresetBase")
	}
	static class UPropertyAnimatorCorePresetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCorePresetBase>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCorePresetBase;

// Class PropertyAnimatorCore.PropertyAnimatorCoreAnimatorPreset
// 0x0018 (0x0068 - 0x0050)
class UPropertyAnimatorCoreAnimatorPreset final : public UPropertyAnimatorCorePresetBase
{
public:
	TSubclassOf<class UPropertyAnimatorCoreBase>  TargetAnimatorClass;                               // 0x0050(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreAnimatorPreset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreAnimatorPreset")
	}
	static class UPropertyAnimatorCoreAnimatorPreset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreAnimatorPreset>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreAnimatorPreset;

// Class PropertyAnimatorCore.PropertyAnimatorCoreBase
// 0x00C8 (0x00F0 - 0x0028)
class UPropertyAnimatorCoreBase : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAnimatorEnabled;                                  // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AnimatorDisplayName;                               // 0x0034(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPropertyAnimatorCoreContext*>   LinkedProperties;                                  // 0x0040(0x0010)(Edit, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, NoClear, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	bool                                          bOverrideTimeSource;                               // 0x0050(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TimeSourceName;                                    // 0x0054(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPropertyAnimatorCoreTimeSourceBase*    ActiveTimeSource;                                  // 0x0060(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, DuplicateTransient, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	TMap<class FName, class UPropertyAnimatorCoreTimeSourceBase*> TimeSourcesInstances;              // 0x0068(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<class UPropertyAnimatorCoreTimeSourceBase*> TimeSources;                                  // 0x00B8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	struct FInstancedPropertyBag                  EvaluatedPropertyValues;                           // 0x00C8(0x0010)(Transient, DuplicateTransient, NonTransactional, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class FName> GetTimeSourceNames() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreBase")
	}
	static class UPropertyAnimatorCoreBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreBase>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreBase;

// Class PropertyAnimatorCore.PropertyAnimatorCoreHandlerBase
// 0x0000 (0x0028 - 0x0028)
class UPropertyAnimatorCoreHandlerBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreHandlerBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreHandlerBase")
	}
	static class UPropertyAnimatorCoreHandlerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreHandlerBase>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreHandlerBase;

// Class PropertyAnimatorCore.PropertyAnimatorCoreBoolHandler
// 0x0000 (0x0028 - 0x0028)
class UPropertyAnimatorCoreBoolHandler final : public UPropertyAnimatorCoreHandlerBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreBoolHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreBoolHandler")
	}
	static class UPropertyAnimatorCoreBoolHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreBoolHandler>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreBoolHandler;

// Class PropertyAnimatorCore.PropertyAnimatorCoreComponent
// 0x0098 (0x0150 - 0x00B8)
class UPropertyAnimatorCoreComponent final : public UActorComponent
{
public:
	TArray<class UPropertyAnimatorCoreBase*>      PropertyAnimators;                                 // 0x00B8(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, NoClear, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	bool                                          bAnimatorsEnabled;                                 // 0x00C8(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimatorsMagnitude;                                // 0x00CC(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   AnimatorsTimeSourceName;                           // 0x00D0(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPropertyAnimatorCoreTimeSourceBase*    ActiveAnimatorsTimeSource;                         // 0x00D8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, DuplicateTransient, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	TSet<class UPropertyAnimatorCoreBase*>        Animators;                                         // 0x00E0(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<class UPropertyAnimatorCoreBase*>      PropertyAnimatorsInternal;                         // 0x0130(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<class UPropertyAnimatorCoreTimeSourceBase*> TimeSources;                                  // 0x0140(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	TArray<class FName> GetTimeSourceNames() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreComponent")
	}
	static class UPropertyAnimatorCoreComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreComponent>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreComponent;

// Class PropertyAnimatorCore.PropertyAnimatorCoreContext
// 0x00D8 (0x0100 - 0x0028)
class UPropertyAnimatorCoreContext : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAnimated;                                         // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEditMagnitude;                                    // 0x0031(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEditTimeOffset;                                   // 0x0032(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEditMode;                                         // 0x0033(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEditConverterRule;                                // 0x0034(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEditResolver;                                     // 0x0035(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Magnitude;                                         // 0x0038(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TimeOffset;                                        // 0x0040(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EPropertyAnimatorCoreMode                     Mode;                                              // 0x0048(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       ConverterRule;                                     // 0x0050(0x0010)(Edit, DisableEditOnTemplate, NoClear, NativeAccessSpecifierPrivate)
	class UPropertyAnimatorCoreResolver*          Resolver;                                          // 0x0060(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoClear, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	struct FInstancedPropertyBag                  OriginalPropertyValues;                            // 0x0068(0x0010)(NonTransactional, NativeAccessSpecifierPrivate)
	struct FInstancedPropertyBag                  DeltaPropertyValues;                               // 0x0078(0x0010)(NonTransactional, NativeAccessSpecifierPrivate)
	TSubclassOf<class UPropertyAnimatorCoreConverterBase> ConverterClass;                            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UPropertyAnimatorCoreHandlerBase> HandlerWeak;                              // 0x0090(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPropertyAnimatorCoreData              AnimatedProperty;                                  // 0x0098(0x0068)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreContext")
	}
	static class UPropertyAnimatorCoreContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreContext>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreContext;

// Class PropertyAnimatorCore.PropertyAnimatorCoreConverterBase
// 0x0000 (0x0028 - 0x0028)
class UPropertyAnimatorCoreConverterBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreConverterBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreConverterBase")
	}
	static class UPropertyAnimatorCoreConverterBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreConverterBase>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreConverterBase;

// Class PropertyAnimatorCore.PropertyAnimatorCoreDoubleHandler
// 0x0000 (0x0028 - 0x0028)
class UPropertyAnimatorCoreDoubleHandler final : public UPropertyAnimatorCoreHandlerBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreDoubleHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreDoubleHandler")
	}
	static class UPropertyAnimatorCoreDoubleHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreDoubleHandler>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreDoubleHandler;

// Class PropertyAnimatorCore.PropertyAnimatorCoreFloatHandler
// 0x0000 (0x0028 - 0x0028)
class UPropertyAnimatorCoreFloatHandler final : public UPropertyAnimatorCoreHandlerBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreFloatHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreFloatHandler")
	}
	static class UPropertyAnimatorCoreFloatHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreFloatHandler>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreFloatHandler;

// Class PropertyAnimatorCore.PropertyAnimatorCoreFloatToBoolConverter
// 0x0000 (0x0028 - 0x0028)
class UPropertyAnimatorCoreFloatToBoolConverter final : public UPropertyAnimatorCoreConverterBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreFloatToBoolConverter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreFloatToBoolConverter")
	}
	static class UPropertyAnimatorCoreFloatToBoolConverter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreFloatToBoolConverter>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreFloatToBoolConverter;

// Class PropertyAnimatorCore.PropertyAnimatorCoreFloatToDoubleConverter
// 0x0000 (0x0028 - 0x0028)
class UPropertyAnimatorCoreFloatToDoubleConverter final : public UPropertyAnimatorCoreConverterBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreFloatToDoubleConverter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreFloatToDoubleConverter")
	}
	static class UPropertyAnimatorCoreFloatToDoubleConverter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreFloatToDoubleConverter>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreFloatToDoubleConverter;

// Class PropertyAnimatorCore.PropertyAnimatorCoreFloatToIntConverter
// 0x0000 (0x0028 - 0x0028)
class UPropertyAnimatorCoreFloatToIntConverter final : public UPropertyAnimatorCoreConverterBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreFloatToIntConverter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreFloatToIntConverter")
	}
	static class UPropertyAnimatorCoreFloatToIntConverter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreFloatToIntConverter>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreFloatToIntConverter;

// Class PropertyAnimatorCore.PropertyAnimatorCoreIntHandler
// 0x0000 (0x0028 - 0x0028)
class UPropertyAnimatorCoreIntHandler final : public UPropertyAnimatorCoreHandlerBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreIntHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreIntHandler")
	}
	static class UPropertyAnimatorCoreIntHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreIntHandler>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreIntHandler;

// Class PropertyAnimatorCore.PropertyAnimatorCoreTimeSourceBase
// 0x0028 (0x0050 - 0x0028)
class UPropertyAnimatorCoreTimeSourceBase : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseFrameRate;                                     // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FrameRate;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   TimeSourceName;                                    // 0x0038(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreTimeSourceBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreTimeSourceBase")
	}
	static class UPropertyAnimatorCoreTimeSourceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreTimeSourceBase>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreTimeSourceBase;

// Class PropertyAnimatorCore.PropertyAnimatorCoreManualTimeSource
// 0x0010 (0x0060 - 0x0050)
class UPropertyAnimatorCoreManualTimeSource final : public UPropertyAnimatorCoreTimeSourceBase
{
public:
	double                                        CustomTime;                                        // 0x0050(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPropertyAnimatorCoreManualStatus             PlaybackState;                                     // 0x0058(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, DuplicateTransient, NoClear, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreManualTimeSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreManualTimeSource")
	}
	static class UPropertyAnimatorCoreManualTimeSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreManualTimeSource>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreManualTimeSource;

// Class PropertyAnimatorCore.PropertyAnimatorCorePresetable
// 0x0000 (0x0000 - 0x0000)
class IPropertyAnimatorCorePresetable final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCorePresetable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCorePresetable")
	}
	static class IPropertyAnimatorCorePresetable* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPropertyAnimatorCorePresetable>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IPropertyAnimatorCorePresetable;

// Class PropertyAnimatorCore.PropertyAnimatorCorePropertyPreset
// 0x0050 (0x00A0 - 0x0050)
class UPropertyAnimatorCorePropertyPreset : public UPropertyAnimatorCorePresetBase
{
public:
	uint8                                         Pad_50[0x50];                                      // 0x0050(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCorePropertyPreset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCorePropertyPreset")
	}
	static class UPropertyAnimatorCorePropertyPreset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCorePropertyPreset>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCorePropertyPreset;

// Class PropertyAnimatorCore.PropertyAnimatorCoreResolver
// 0x0010 (0x0038 - 0x0028)
class UPropertyAnimatorCoreResolver : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResolverName;                                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreResolver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreResolver")
	}
	static class UPropertyAnimatorCoreResolver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreResolver>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreResolver;

// Class PropertyAnimatorCore.PropertyAnimatorCoreRotatorHandler
// 0x0000 (0x0028 - 0x0028)
class UPropertyAnimatorCoreRotatorHandler final : public UPropertyAnimatorCoreHandlerBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreRotatorHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreRotatorHandler")
	}
	static class UPropertyAnimatorCoreRotatorHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreRotatorHandler>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreRotatorHandler;

// Class PropertyAnimatorCore.PropertyAnimatorCoreSequencerTimeSource
// 0x0018 (0x0068 - 0x0050)
class UPropertyAnimatorCoreSequencerTimeSource final : public UPropertyAnimatorCoreTimeSourceBase
{
public:
	struct FPropertyAnimatorCoreSequencerTimeSourceEvalResult EvalResult;                            // 0x0050(0x0018)(Edit, DisableEditOnTemplate, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreSequencerTimeSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreSequencerTimeSource")
	}
	static class UPropertyAnimatorCoreSequencerTimeSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreSequencerTimeSource>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreSequencerTimeSource;

// Class PropertyAnimatorCore.PropertyAnimatorCoreSettings
// 0x0008 (0x0040 - 0x0038)
class UPropertyAnimatorCoreSettings final : public UDeveloperSettings
{
public:
	class FName                                   DefaultTimeSourceName;                             // 0x0038(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	TArray<class FName> GetTimeSourceNames() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreSettings")
	}
	static class UPropertyAnimatorCoreSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreSettings>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreSettings;

// Class PropertyAnimatorCore.PropertyAnimatorCoreStringHandler
// 0x0000 (0x0028 - 0x0028)
class UPropertyAnimatorCoreStringHandler final : public UPropertyAnimatorCoreHandlerBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreStringHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreStringHandler")
	}
	static class UPropertyAnimatorCoreStringHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreStringHandler>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreStringHandler;

// Class PropertyAnimatorCore.PropertyAnimatorCoreStringToTextConverter
// 0x0000 (0x0028 - 0x0028)
class UPropertyAnimatorCoreStringToTextConverter final : public UPropertyAnimatorCoreConverterBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreStringToTextConverter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreStringToTextConverter")
	}
	static class UPropertyAnimatorCoreStringToTextConverter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreStringToTextConverter>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreStringToTextConverter;

// Class PropertyAnimatorCore.PropertyAnimatorCoreSubsystem
// 0x0288 (0x02B8 - 0x0030)
class UPropertyAnimatorCoreSubsystem final : public UEngineSubsystem
{
public:
	TSet<TWeakObjectPtr<class UPropertyAnimatorCoreTimeSourceBase>> TimeSourcesWeak;                 // 0x0030(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSet<TWeakObjectPtr<class UPropertyAnimatorCoreBase>> AnimatorsWeak;                             // 0x0080(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSet<TWeakObjectPtr<class UPropertyAnimatorCoreHandlerBase>> HandlersWeak;                       // 0x00D0(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSet<TWeakObjectPtr<class UPropertyAnimatorCoreResolver>> ResolversWeak;                         // 0x0120(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSet<TWeakObjectPtr<class UPropertyAnimatorCorePresetBase>> PresetsWeak;                         // 0x0170(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSet<TWeakObjectPtr<class UPropertyAnimatorCoreConverterBase>> ConvertersWeak;                   // 0x01C0(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_210[0xA8];                                     // 0x0210(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreSubsystem")
	}
	static class UPropertyAnimatorCoreSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreSubsystem>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreSubsystem;

// Class PropertyAnimatorCore.PropertyAnimatorCoreSystemTimeSource
// 0x0028 (0x0078 - 0x0050)
class UPropertyAnimatorCoreSystemTimeSource final : public UPropertyAnimatorCoreTimeSourceBase
{
public:
	EPropertyAnimatorCoreSystemMode               Mode;                                              // 0x0050(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseUtc;                                           // 0x0051(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPropertyAnimatorCoreSystemCountdownFormat    CountdownFormat;                                   // 0x0052(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CountdownDuration;                                 // 0x0058(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimespan                              CountdownTimeSpan;                                 // 0x0068(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDateTime                              ActivationTime;                                    // 0x0070(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreSystemTimeSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreSystemTimeSource")
	}
	static class UPropertyAnimatorCoreSystemTimeSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyAnimatorCoreSystemTimeSource>();
	}
};
DUMPER7_ASSERTS_UPropertyAnimatorCoreSystemTimeSource;

// Class PropertyAnimatorCore.PropertyAnimatorCoreTextHandler
// 0x0000 (0x0028 - 0x0028)
class UPropertyAnimatorCoreTextHandler final : public UPropertyAnimatorCoreHandlerBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyAnimatorCoreTextHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyAnimatorCoreTextHandler")
	}
