#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Radial_Wheel_WB

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Radial_Wheel_Slot_Struct_structs.hpp"
#include "UMG_classes.hpp"
#include "Radial_Wheel_Position_Enum_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass Radial_Wheel_WB.Radial_Wheel_WB_C
// 0x00A8 (0x03E8 - 0x0340)
class URadial_Wheel_WB_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               Radial_Wheel_OV;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Radial_Wheel_Current_Slot_Name_Text;               // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Radial_Wheel_Container_OV;                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_Image;                                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Background_Border;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        Background_Blur;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Popup;                                             // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URadial_Wheel_AC_C*                     Radian_Wheel_Component;                            // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class URadial_Wheel_Item_WB_C*>        Slots_Widgets;                                     // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class URadial_Wheel_Item_WB_C*                Current_Slot;                                      // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRadial_Wheel_Slot_Struct>      Preview_Slots;                                     // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Update_Selected_Slot_;                             // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        _Opened_Sound;                                     // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Wheel_Opened_;                                     // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Using_Gamepad_;                                    // 0x03C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C2[0x6];                                      // 0x03C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Gamepad_Interpolated_Axis;                         // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnMouseDown;                                       // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Center_Mouse_Position();
	void Construct();
	void CustomEvent();
	void ExecuteUbergraph_Radial_Wheel_WB(int32 EntryPoint);
	void Generate_Radial_Wheel(TArray<struct FRadial_Wheel_Slot_Struct>& Slots_);
	void Get_Gamepad_Input_Angle___Distance(double* Angle, double* Distance);
	void Get_Mouse_Input_Angle___Distance(double* Angle, double* Distance);
	void Get_Wheel_Center_Position(bool* Valid_, int32* X, int32* Y);
	void Hide_Radial_Wheel();
	void Lock_Mouse_To_Radius();
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void _Closed_Sound(bool Closed_);
	void Popup_Animation_Repeater();
	void PreConstruct(bool IsDesignTime);
	void Refresh_Radial_Wheel_Slots();
	void Refresh_Radial_Wheel_Style();
	void SequenceEvent__ENTRYPOINTRadial_Wheel_WB();
	void Set_Wheel_Position(ERadial_Wheel_Position_Enum New_Position);
	void Show_Radial_Wheel();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Update_Selected_Slot();
	void WidgetAnimationEvt_Popup_K2Node_WidgetAnimationEvent_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Radial_Wheel_WB_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Radial_Wheel_WB_C")
	}
	static class URadial_Wheel_WB_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadial_Wheel_WB_C>();
	}
};
DUMPER7_ASSERTS_URadial_Wheel_WB_C;

SDK_NAMESPACE_END
