#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RemoteControlLogic

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "RemoteControlLogic_structs.hpp"
#include "RemoteControl_classes.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// Class RemoteControlLogic.RCAction
// 0x0028 (0x0050 - 0x0028)
class URCAction : public UObject
{
public:
	struct FGuid                                  ExposedFieldId;                                    // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class URemoteControlPreset>    PresetWeakPtr;                                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCAction")
	}
	static class URCAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCAction>();
	}
};
DUMPER7_ASSERTS_URCAction;

// Class RemoteControlLogic.RCActionContainer
// 0x00C0 (0x00E8 - 0x0028)
class URCActionContainer final : public UObject
{
public:
	TSet<class URCActionContainer*>               ActionContainers;                                  // 0x0028(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	TWeakObjectPtr<class URemoteControlPreset>    PresetWeakPtr;                                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x18];                                      // 0x0080(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class URCAction*>                        Actions;                                           // 0x0098(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCActionContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCActionContainer")
	}
	static class URCActionContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCActionContainer>();
	}
};
DUMPER7_ASSERTS_URCActionContainer;

// Class RemoteControlLogic.RCBehaviour
// 0x0058 (0x0080 - 0x0028)
class URCBehaviour : public UObject
{
public:
	TSubclassOf<class URCBehaviourNode>           BehaviourNodeClass;                                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         OverrideBehaviourBlueprintClassPath;               // 0x0030(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URCActionContainer*                     ActionContainer;                                   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TWeakObjectPtr<class URCController>           ControllerWeakPtr;                                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URCBehaviourNode*                       CachedBehaviourNode;                               // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	bool                                          bIsEnabled;                                        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExecuteBehavioursDuringPreChange;                 // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCBehaviour")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCBehaviour")
	}
	static class URCBehaviour* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCBehaviour>();
	}
};
DUMPER7_ASSERTS_URCBehaviour;

// Class RemoteControlLogic.RCBehaviourBind
// 0x0008 (0x0088 - 0x0080)
class URCBehaviourBind final : public URCBehaviour
{
public:
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCBehaviourBind")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCBehaviourBind")
	}
	static class URCBehaviourBind* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCBehaviourBind>();
	}
};
DUMPER7_ASSERTS_URCBehaviourBind;

// Class RemoteControlLogic.RCBehaviourNode
// 0x0020 (0x0048 - 0x0028)
class URCBehaviourNode : public UObject
{
public:
	class FText                                   DisplayName;                                       // 0x0028(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   BehaviorDescription;                               // 0x0038(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCBehaviourNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCBehaviourNode")
	}
	static class URCBehaviourNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCBehaviourNode>();
	}
};
DUMPER7_ASSERTS_URCBehaviourNode;

// Class RemoteControlLogic.RCBehaviourBindNode
// 0x0000 (0x0048 - 0x0048)
class URCBehaviourBindNode final : public URCBehaviourNode
{
public:
	bool Execute(class URCBehaviour* InBehaviour) const;
	bool IsSupported(class URCBehaviour* InBehaviour) const;
	void OnPassed(class URCBehaviour* InBehaviour) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCBehaviourBindNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCBehaviourBindNode")
	}
	static class URCBehaviourBindNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCBehaviourBindNode>();
	}
};
DUMPER7_ASSERTS_URCBehaviourBindNode;

// Class RemoteControlLogic.RCBehaviourBlueprintNode
// 0x0000 (0x0048 - 0x0048)
class URCBehaviourBlueprintNode final : public URCBehaviourNode
{
public:
	bool Execute(class URCBehaviour* InBehaviour) const;
	bool IsSupported(class URCBehaviour* InBehaviour) const;
	void OnPassed(class URCBehaviour* InBehaviour) const;
	void PreExecute(class URCBehaviour* InBehaviour) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCBehaviourBlueprintNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCBehaviourBlueprintNode")
	}
	static class URCBehaviourBlueprintNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCBehaviourBlueprintNode>();
	}
};
DUMPER7_ASSERTS_URCBehaviourBlueprintNode;

// Class RemoteControlLogic.RCBehaviourConditional
// 0x0058 (0x00D8 - 0x0080)
class URCBehaviourConditional final : public URCBehaviour
{
public:
	TMap<class URCAction*, struct FRCBehaviourCondition> Conditions;                                 // 0x0080(0x0050)(NativeAccessSpecifierPublic)
	class URCVirtualPropertySelfContainer*        Comparand;                                         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCBehaviourConditional")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCBehaviourConditional")
	}
	static class URCBehaviourConditional* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCBehaviourConditional>();
	}
};
DUMPER7_ASSERTS_URCBehaviourConditional;

// Class RemoteControlLogic.RCBehaviourConditionalNode
// 0x0000 (0x0048 - 0x0048)
class URCBehaviourConditionalNode final : public URCBehaviourNode
{
public:
	bool Execute(class URCBehaviour* InBehaviour) const;
	bool IsSupported(class URCBehaviour* InBehaviour) const;
	void OnPassed(class URCBehaviour* InBehaviour) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCBehaviourConditionalNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCBehaviourConditionalNode")
	}
	static class URCBehaviourConditionalNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCBehaviourConditionalNode>();
	}
};
DUMPER7_ASSERTS_URCBehaviourConditionalNode;

// Class RemoteControlLogic.RCBehaviourOnValueChangedNode
// 0x0000 (0x0048 - 0x0048)
class URCBehaviourOnValueChangedNode final : public URCBehaviourNode
{
public:
	bool Execute(class URCBehaviour* InBehaviour) const;
	bool IsSupported(class URCBehaviour* InBehaviour) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCBehaviourOnValueChangedNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCBehaviourOnValueChangedNode")
	}
	static class URCBehaviourOnValueChangedNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCBehaviourOnValueChangedNode>();
	}
};
DUMPER7_ASSERTS_URCBehaviourOnValueChangedNode;

// Class RemoteControlLogic.RCBehaviourRangeMapNode
// 0x0000 (0x0048 - 0x0048)
class URCBehaviourRangeMapNode final : public URCBehaviourNode
{
public:
	bool Execute(class URCBehaviour* InBehaviour) const;
	bool IsSupported(class URCBehaviour* InBehaviour) const;
	void OnPassed(class URCBehaviour* InBehaviour) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCBehaviourRangeMapNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCBehaviourRangeMapNode")
	}
	static class URCBehaviourRangeMapNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCBehaviourRangeMapNode>();
	}
};
DUMPER7_ASSERTS_URCBehaviourRangeMapNode;

// Class RemoteControlLogic.RCBehaviourSetAssetByPathNode
// 0x0000 (0x0048 - 0x0048)
class URCBehaviourSetAssetByPathNode final : public URCBehaviourNode
{
public:
	bool Execute(class URCBehaviour* InBehaviour) const;
	bool IsSupported(class URCBehaviour* InBehaviour) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCBehaviourSetAssetByPathNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCBehaviourSetAssetByPathNode")
	}
	static class URCBehaviourSetAssetByPathNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCBehaviourSetAssetByPathNode>();
	}
};
DUMPER7_ASSERTS_URCBehaviourSetAssetByPathNode;

// Class RemoteControlLogic.RCController
// 0x0068 (0x0130 - 0x00C8)
class URCController final : public URCVirtualPropertyInContainer
{
public:
	uint8                                         Pad_C8[0x18];                                      // 0x00C8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class URCBehaviour*>                     Behaviours;                                        // 0x00E0(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCController")
	}
	static class URCController* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCController>();
	}
};
DUMPER7_ASSERTS_URCController;

// Class RemoteControlLogic.RCControllerContainer
// 0x0050 (0x0148 - 0x00F8)
class URCControllerContainer final : public URCVirtualPropertyContainerBase
{
public:
	TSet<class URCActionContainer*>               SharedActionContainers;                            // 0x00F8(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCControllerContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCControllerContainer")
	}
	static class URCControllerContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCControllerContainer>();
	}
};
DUMPER7_ASSERTS_URCControllerContainer;

// Class RemoteControlLogic.RCExternalTexture
// 0x0020 (0x0178 - 0x0158)
class URCExternalTexture final : public UTexture2DDynamic
{
public:
	class FString                                 Path;                                              // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRCExternalTextureInfo                 CachedInfo;                                        // 0x0168(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCExternalTexture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCExternalTexture")
	}
	static class URCExternalTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCExternalTexture>();
	}
};
DUMPER7_ASSERTS_URCExternalTexture;

// Class RemoteControlLogic.RCFunctionAction
// 0x0000 (0x0050 - 0x0050)
class URCFunctionAction final : public URCAction
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCFunctionAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCFunctionAction")
	}
	static class URCFunctionAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCFunctionAction>();
	}
};
DUMPER7_ASSERTS_URCFunctionAction;

// Class RemoteControlLogic.RCPropertyAction
// 0x0008 (0x0058 - 0x0050)
class URCPropertyAction : public URCAction
{
public:
	class URCVirtualPropertySelfContainer*        PropertySelfContainer;                             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCPropertyAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCPropertyAction")
	}
	static class URCPropertyAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCPropertyAction>();
	}
};
DUMPER7_ASSERTS_URCPropertyAction;

// Class RemoteControlLogic.RCPropertyBindAction
// 0x0008 (0x0060 - 0x0058)
class URCPropertyBindAction final : public URCPropertyAction
{
public:
	class URCController*                          Controller;                                        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCPropertyBindAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCPropertyBindAction")
	}
	static class URCPropertyBindAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCPropertyBindAction>();
	}
};
DUMPER7_ASSERTS_URCPropertyBindAction;

// Class RemoteControlLogic.RCPropertyIdAction
// 0x00F8 (0x0148 - 0x0050)
class URCPropertyIdAction final : public URCAction
{
public:
	class FName                                   PropertyId;                                        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FPropertyIdContainerKey, class URCVirtualPropertySelfContainer*> PropertySelfContainer; // 0x0058(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	TMap<struct FPropertyIdContainerKey, class URCVirtualPropertySelfContainer*> CachedPropertySelfContainer; // 0x00A8(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	TMap<struct FGuid, class URCVirtualPropertySelfContainer*> RealPropertySelfContainer;            // 0x00F8(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCPropertyIdAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCPropertyIdAction")
	}
	static class URCPropertyIdAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCPropertyIdAction>();
	}
};
DUMPER7_ASSERTS_URCPropertyIdAction;

// Class RemoteControlLogic.RCRangeMapBehaviour
// 0x0070 (0x00F0 - 0x0080)
class URCRangeMapBehaviour final : public URCBehaviour
{
public:
	class URCVirtualPropertyContainerBase*        PropertyContainer;                                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TMap<class URCAction*, struct FRCRangeMapInput> RangeMapActionContainer;                         // 0x0088(0x0050)(NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCRangeMapBehaviour")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCRangeMapBehaviour")
	}
	static class URCRangeMapBehaviour* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCRangeMapBehaviour>();
	}
};
DUMPER7_ASSERTS_URCRangeMapBehaviour;

// Class RemoteControlLogic.RCSetAssetByPathBehaviour
// 0x0058 (0x00D8 - 0x0080)
class URCSetAssetByPathBehaviour final : public URCBehaviour
{
public:
	class URCVirtualPropertyContainerBase*        PropertyInContainer;                               // 0x0080(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TSubclassOf<class UObject>                    AssetClass;                                        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FRCSetAssetPath                        PathStruct;                                        // 0x0090(0x0020)(NativeAccessSpecifierPublic)
	bool                                          bInternal;                                         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  TargetEntityId;                                    // 0x00B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C4[0x14];                                      // 0x00C4(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RCSetAssetByPathBehaviour")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RCSetAssetByPathBehaviour")
	}
	static class URCSetAssetByPathBehaviour* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCSetAssetByPathBehaviour>();
	}
};
DUMPER7_ASSERTS_URCSetAssetByPathBehaviour;

// Class RemoteControlLogic.RemoteControlLogicConfig
// 0x0040 (0x0068 - 0x0028)
class URemoteControlLogicConfig final : public UObject
{
public:
	TArray<EPropertyBagPropertyType>              SupportedControllerTypes;                          // 0x0028(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FName>                           SupportedControllerStructTypes;                    // 0x0038(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FName>                           SupportedControllerObjectClassPaths;               // 0x0048(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FName>                           SupportedControllerCustomTypes;                    // 0x0058(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RemoteControlLogicConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RemoteControlLogicConfig")
	}
	static class URemoteControlLogicConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemoteControlLogicConfig>();
	}
};
DUMPER7_ASSERTS_URemoteControlLogicConfig;

// Class RemoteControlLogic.RemoteControlLogicTestData
// 0x0008 (0x0030 - 0x0028)
class URemoteControlLogicTestData final : public UObject
{
public:
	struct FColor                                 Color;                                             // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TestInt;                                           // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void TestIntFunction();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RemoteControlLogicTestData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RemoteControlLogicTestData")
	}
	static class URemoteControlLogicTestData* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemoteControlLogicTestData>();
	}
};
DUMPER7_ASSERTS_URemoteControlLogicTestData;

SDK_NAMESPACE_END
