#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RemoteControlLogic

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "RemoteControl_structs.hpp"


SDK_NAMESPACE_START

// Enum RemoteControlLogic.ERCBehaviourConditionType
// NumValues: 0x0008
enum class ERCBehaviourConditionType : uint8
{
	IsEqual                                  = 0,
	IsGreaterThan                            = 1,
	IsLesserThan                             = 2,
	IsGreaterThanOrEqualTo                   = 3,
	IsLesserThanOrEqualTo                    = 4,
	Else                                     = 5,
	None                                     = 6,
	ERCBehaviourConditionType_MAX            = 7,
};

// ScriptStruct RemoteControlLogic.RCBehaviourCondition
// 0x0010 (0x0010 - 0x0000)
struct FRCBehaviourCondition final
{
public:
	ERCBehaviourConditionType                     ConditionType;                                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URCVirtualPropertySelfContainer*        Comparand;                                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FRCBehaviourCondition;

// ScriptStruct RemoteControlLogic.RCExternalTextureInfo
// 0x000C (0x000C - 0x0000)
struct FRCExternalTextureInfo final
{
public:
	int32                                         SizeX;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SizeY;                                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPixelFormat                                  Format;                                            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRCExternalTextureInfo;

// ScriptStruct RemoteControlLogic.PropertyIdContainerKey
// 0x0010 (0x0010 - 0x0000)
struct FPropertyIdContainerKey final
{
public:
	class FName                                   PropertyId;                                        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ContainerName;                                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPropertyIdContainerKey;

// ScriptStruct RemoteControlLogic.RCRangeMapInput
// 0x0010 (0x0010 - 0x0000)
struct FRCRangeMapInput final
{
public:
	class URCVirtualPropertySelfContainer*        InputProperty;                                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class URCVirtualPropertySelfContainer*        PropertyValue;                                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FRCRangeMapInput;

// ScriptStruct RemoteControlLogic.RCAssetPathElement
// 0x0018 (0x0018 - 0x0000)
struct FRCAssetPathElement final
{
public:
	bool                                          bIsInput;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Path;                                              // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRCAssetPathElement;

// ScriptStruct RemoteControlLogic.RCSetAssetPath
// 0x0020 (0x0020 - 0x0000)
struct FRCSetAssetPath final
{
public:
	TArray<struct FRCAssetPathElement>            AssetPath;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         PathArray;                                         // 0x0010(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRCSetAssetPath;

// ScriptStruct RemoteControlLogic.RCSignatureControllerAction
// 0x0010 (0x0018 - 0x0008)
struct FRCSignatureControllerAction : public FRCSignatureAction
{
public:
	class FName                                   ControllerName;                                    // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateControllerIfNotFound;                       // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRCSignatureControllerAction;

// ScriptStruct RemoteControlLogic.RCSignatureControllerBindAction
// 0x0000 (0x0018 - 0x0018)
struct FRCSignatureControllerBindAction final : public FRCSignatureControllerAction
{
};
DUMPER7_ASSERTS_FRCSignatureControllerBindAction;

SDK_NAMESPACE_END
