#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RemoteControl

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "RemoteControl_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function RemoteControl.RCVirtualPropertyBase.SetValueBool
// 0x0002 (0x0002 - 0x0000)
struct RCVirtualPropertyBase_SetValueBool final
{
public:
	bool                                          InBoolValue;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_SetValueBool;

// Function RemoteControl.RCVirtualPropertyBase.SetValueByte
// 0x0002 (0x0002 - 0x0000)
struct RCVirtualPropertyBase_SetValueByte final
{
public:
	uint8                                         InByte;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_SetValueByte;

// Function RemoteControl.RCVirtualPropertyBase.SetValueColor
// 0x0008 (0x0008 - 0x0000)
struct RCVirtualPropertyBase_SetValueColor final
{
public:
	struct FColor                                 InColor;                                           // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_SetValueColor;

// Function RemoteControl.RCVirtualPropertyBase.SetValueDouble
// 0x0010 (0x0010 - 0x0000)
struct RCVirtualPropertyBase_SetValueDouble final
{
public:
	double                                        InDouble;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_SetValueDouble;

// Function RemoteControl.RCVirtualPropertyBase.SetValueFloat
// 0x0008 (0x0008 - 0x0000)
struct RCVirtualPropertyBase_SetValueFloat final
{
public:
	float                                         InFloat;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_SetValueFloat;

// Function RemoteControl.RCVirtualPropertyBase.SetValueInt16
// 0x0004 (0x0004 - 0x0000)
struct RCVirtualPropertyBase_SetValueInt16 final
{
public:
	int16                                         InInt16;                                           // 0x0000(0x0002)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_SetValueInt16;

// Function RemoteControl.RCVirtualPropertyBase.SetValueInt32
// 0x0008 (0x0008 - 0x0000)
struct RCVirtualPropertyBase_SetValueInt32 final
{
public:
	int32                                         InInt32;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_SetValueInt32;

// Function RemoteControl.RCVirtualPropertyBase.SetValueInt64
// 0x0010 (0x0010 - 0x0000)
struct RCVirtualPropertyBase_SetValueInt64 final
{
public:
	int64                                         InInt64;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_SetValueInt64;

// Function RemoteControl.RCVirtualPropertyBase.SetValueInt8
// 0x0002 (0x0002 - 0x0000)
struct RCVirtualPropertyBase_SetValueInt8 final
{
public:
	int8                                          InInt8;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_SetValueInt8;

// Function RemoteControl.RCVirtualPropertyBase.SetValueLinearColor
// 0x0014 (0x0014 - 0x0000)
struct RCVirtualPropertyBase_SetValueLinearColor final
{
public:
	struct FLinearColor                           InLinearColor;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_SetValueLinearColor;

// Function RemoteControl.RCVirtualPropertyBase.SetValueName
// 0x000C (0x000C - 0x0000)
struct RCVirtualPropertyBase_SetValueName final
{
public:
	class FName                                   InNameValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_SetValueName;

// Function RemoteControl.RCVirtualPropertyBase.SetValueNumericInteger
// 0x0010 (0x0010 - 0x0000)
struct RCVirtualPropertyBase_SetValueNumericInteger final
{
public:
	int64                                         InInt64Value;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_SetValueNumericInteger;

// Function RemoteControl.RCVirtualPropertyBase.SetValueRotator
// 0x0020 (0x0020 - 0x0000)
struct RCVirtualPropertyBase_SetValueRotator final
{
public:
	struct FRotator                               InRotator;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_SetValueRotator;

// Function RemoteControl.RCVirtualPropertyBase.SetValueString
// 0x0018 (0x0018 - 0x0000)
struct RCVirtualPropertyBase_SetValueString final
{
public:
	class FString                                 InStringValue;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_SetValueString;

// Function RemoteControl.RCVirtualPropertyBase.SetValueText
// 0x0018 (0x0018 - 0x0000)
struct RCVirtualPropertyBase_SetValueText final
{
public:
	class FText                                   InTextValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_SetValueText;

// Function RemoteControl.RCVirtualPropertyBase.SetValueUint16
// 0x0004 (0x0004 - 0x0000)
struct RCVirtualPropertyBase_SetValueUint16 final
{
public:
	uint16                                        InUInt16;                                          // 0x0000(0x0002)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_SetValueUint16;

// Function RemoteControl.RCVirtualPropertyBase.SetValueUInt32
// 0x0008 (0x0008 - 0x0000)
struct RCVirtualPropertyBase_SetValueUInt32 final
{
public:
	uint32                                        InUInt32;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_SetValueUInt32;

// Function RemoteControl.RCVirtualPropertyBase.SetValueUint64
// 0x0010 (0x0010 - 0x0000)
struct RCVirtualPropertyBase_SetValueUint64 final
{
public:
	uint64                                        InUInt64;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_SetValueUint64;

// Function RemoteControl.RCVirtualPropertyBase.SetValueVector
// 0x0020 (0x0020 - 0x0000)
struct RCVirtualPropertyBase_SetValueVector final
{
public:
	struct FVector                                InVector;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_SetValueVector;

// Function RemoteControl.RCVirtualPropertyBase.SetValueVector2D
// 0x0018 (0x0018 - 0x0000)
struct RCVirtualPropertyBase_SetValueVector2D final
{
public:
	struct FVector2D                              InVector2D;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_SetValueVector2D;

// Function RemoteControl.RCVirtualPropertyBase.GetDisplayValueAsString
// 0x0010 (0x0010 - 0x0000)
struct RCVirtualPropertyBase_GetDisplayValueAsString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetDisplayValueAsString;

// Function RemoteControl.RCVirtualPropertyBase.GetPropertyName
// 0x0008 (0x0008 - 0x0000)
struct RCVirtualPropertyBase_GetPropertyName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetPropertyName;

// Function RemoteControl.RCVirtualPropertyBase.GetValueBool
// 0x0002 (0x0002 - 0x0000)
struct RCVirtualPropertyBase_GetValueBool final
{
public:
	bool                                          OutBoolValue;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueBool;

// Function RemoteControl.RCVirtualPropertyBase.GetValueByte
// 0x0002 (0x0002 - 0x0000)
struct RCVirtualPropertyBase_GetValueByte final
{
public:
	uint8                                         OutByte;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueByte;

// Function RemoteControl.RCVirtualPropertyBase.GetValueColor
// 0x0008 (0x0008 - 0x0000)
struct RCVirtualPropertyBase_GetValueColor final
{
public:
	struct FColor                                 OutColor;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueColor;

// Function RemoteControl.RCVirtualPropertyBase.GetValueDouble
// 0x0010 (0x0010 - 0x0000)
struct RCVirtualPropertyBase_GetValueDouble final
{
public:
	double                                        OutDouble;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueDouble;

// Function RemoteControl.RCVirtualPropertyBase.GetValueFloat
// 0x0008 (0x0008 - 0x0000)
struct RCVirtualPropertyBase_GetValueFloat final
{
public:
	float                                         OutFloat;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueFloat;

// Function RemoteControl.RCVirtualPropertyBase.GetValueInt16
// 0x0004 (0x0004 - 0x0000)
struct RCVirtualPropertyBase_GetValueInt16 final
{
public:
	int16                                         OutInt16;                                          // 0x0000(0x0002)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueInt16;

// Function RemoteControl.RCVirtualPropertyBase.GetValueInt32
// 0x0008 (0x0008 - 0x0000)
struct RCVirtualPropertyBase_GetValueInt32 final
{
public:
	int32                                         OutInt32;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueInt32;

// Function RemoteControl.RCVirtualPropertyBase.GetValueInt64
// 0x0010 (0x0010 - 0x0000)
struct RCVirtualPropertyBase_GetValueInt64 final
{
public:
	int64                                         OuyInt64;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueInt64;

// Function RemoteControl.RCVirtualPropertyBase.GetValueInt8
// 0x0002 (0x0002 - 0x0000)
struct RCVirtualPropertyBase_GetValueInt8 final
{
public:
	int8                                          OutInt8;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueInt8;

// Function RemoteControl.RCVirtualPropertyBase.GetValueLinearColor
// 0x0014 (0x0014 - 0x0000)
struct RCVirtualPropertyBase_GetValueLinearColor final
{
public:
	struct FLinearColor                           OutLinearColor;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueLinearColor;

// Function RemoteControl.RCVirtualPropertyBase.GetValueName
// 0x000C (0x000C - 0x0000)
struct RCVirtualPropertyBase_GetValueName final
{
public:
	class FName                                   OutNameValue;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueName;

// Function RemoteControl.RCVirtualPropertyBase.GetValueNumericInteger
// 0x0010 (0x0010 - 0x0000)
struct RCVirtualPropertyBase_GetValueNumericInteger final
{
public:
	int64                                         OutInt64Value;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueNumericInteger;

// Function RemoteControl.RCVirtualPropertyBase.GetValueObject
// 0x0008 (0x0008 - 0x0000)
struct RCVirtualPropertyBase_GetValueObject final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueObject;

// Function RemoteControl.RCVirtualPropertyBase.GetValueRotator
// 0x0020 (0x0020 - 0x0000)
struct RCVirtualPropertyBase_GetValueRotator final
{
public:
	struct FRotator                               OutRotator;                                        // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueRotator;

// Function RemoteControl.RCVirtualPropertyBase.GetValueString
// 0x0018 (0x0018 - 0x0000)
struct RCVirtualPropertyBase_GetValueString final
{
public:
	class FString                                 OutStringValue;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueString;

// Function RemoteControl.RCVirtualPropertyBase.GetValueText
// 0x0018 (0x0018 - 0x0000)
struct RCVirtualPropertyBase_GetValueText final
{
public:
	class FText                                   OutTextValue;                                      // 0x0000(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueText;

// Function RemoteControl.RCVirtualPropertyBase.GetValueUint16
// 0x0004 (0x0004 - 0x0000)
struct RCVirtualPropertyBase_GetValueUint16 final
{
public:
	uint16                                        OutUInt16;                                         // 0x0000(0x0002)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueUint16;

// Function RemoteControl.RCVirtualPropertyBase.GetValueUInt32
// 0x0008 (0x0008 - 0x0000)
struct RCVirtualPropertyBase_GetValueUInt32 final
{
public:
	uint32                                        OutUInt32;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueUInt32;

// Function RemoteControl.RCVirtualPropertyBase.GetValueUint64
// 0x0010 (0x0010 - 0x0000)
struct RCVirtualPropertyBase_GetValueUint64 final
{
public:
	uint64                                        OuyUInt64;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueUint64;

// Function RemoteControl.RCVirtualPropertyBase.GetValueVector
// 0x0020 (0x0020 - 0x0000)
struct RCVirtualPropertyBase_GetValueVector final
{
public:
	struct FVector                                OutVector;                                         // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueVector;

// Function RemoteControl.RCVirtualPropertyBase.GetValueVector2D
// 0x0018 (0x0018 - 0x0000)
struct RCVirtualPropertyBase_GetValueVector2D final
{
public:
	struct FVector2D                              OutVector2D;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RCVirtualPropertyBase_GetValueVector2D;

// Function RemoteControl.RemoteControlDeltaAPITestObject.GetInt32WithSetterValue
// 0x0004 (0x0004 - 0x0000)
struct RemoteControlDeltaAPITestObject_GetInt32WithSetterValue final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RemoteControlDeltaAPITestObject_GetInt32WithSetterValue;

// Function RemoteControl.RemoteControlDeltaAPITestObject.SetInt32WithSetterValue
// 0x0004 (0x0004 - 0x0000)
struct RemoteControlDeltaAPITestObject_SetInt32WithSetterValue final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RemoteControlDeltaAPITestObject_SetInt32WithSetterValue;

// Function RemoteControl.RemoteControlFunctionLibrary.ApplyColorGradingWheelDelta
// 0x0068 (0x0068 - 0x0000)
struct RemoteControlFunctionLibrary_ApplyColorGradingWheelDelta final
{
public:
	class UObject*                                TargetObject;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColorGradingWheelColor                DeltaValue;                                        // 0x0018(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FColorGradingWheelColor                ReferenceColor;                                    // 0x0038(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsInteractive;                                    // 0x0058(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinValue;                                          // 0x005C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxValue;                                          // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0064(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RemoteControlFunctionLibrary_ApplyColorGradingWheelDelta;

// Function RemoteControl.RemoteControlFunctionLibrary.ApplyColorWheelDelta
// 0x0060 (0x0060 - 0x0000)
struct RemoteControlFunctionLibrary_ApplyColorWheelDelta final
{
public:
	class UObject*                                TargetObject;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColorWheelColor                       DeltaValue;                                        // 0x0018(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FColorWheelColor                       ReferenceColor;                                    // 0x0038(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsInteractive;                                    // 0x0058(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0059(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RemoteControlFunctionLibrary_ApplyColorWheelDelta;

// Function RemoteControl.RemoteControlFunctionLibrary.ExposeActor
// 0x0038 (0x0038 - 0x0000)
struct RemoteControlFunctionLibrary_ExposeActor final
{
public:
	class URemoteControlPreset*                   Preset;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRemoteControlOptionalExposeArgs       args;                                              // 0x0010(0x0020)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RemoteControlFunctionLibrary_ExposeActor;

// Function RemoteControl.RemoteControlFunctionLibrary.ExposeFunction
// 0x0048 (0x0048 - 0x0000)
struct RemoteControlFunctionLibrary_ExposeFunction final
{
public:
	class URemoteControlPreset*                   Preset;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                SourceObject;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Function;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRemoteControlOptionalExposeArgs       args;                                              // 0x0020(0x0020)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RemoteControlFunctionLibrary_ExposeFunction;

// Function RemoteControl.RemoteControlFunctionLibrary.ExposeProperty
// 0x0048 (0x0048 - 0x0000)
struct RemoteControlFunctionLibrary_ExposeProperty final
{
public:
	class URemoteControlPreset*                   Preset;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                SourceObject;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Property;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRemoteControlOptionalExposeArgs       args;                                              // 0x0020(0x0020)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RemoteControlFunctionLibrary_ExposeProperty;

// Function RemoteControl.RemoteControlInterceptionTestObject.TestFunction
// 0x0058 (0x0058 - 0x0000)
struct RemoteControlInterceptionTestObject_TestFunction final
{
public:
	struct FRemoteControlInterceptionFunctionParamStruct InStruct;                                   // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         InTestFactor;                                      // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRemoteControlInterceptionFunctionParamStruct ReturnValue;                                // 0x0030(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RemoteControlInterceptionTestObject_TestFunction;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
