#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RemoteControl

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "RemoteControlCommon_structs.hpp"


SDK_NAMESPACE_START

// Enum RemoteControl.ERCTransactionMode
// NumValues: 0x0004
enum class ERCTransactionMode : uint8
{
	NONE                                     = 0,
	AUTOMATIC                                = 1,
	MANUAL                                   = 2,
	ERCTransactionMode_MAX                   = 3,
};

// Enum RemoteControl.ERCAccess
// NumValues: 0x0006
enum class ERCAccess : uint8
{
	NO_ACCESS                                = 0,
	READ_ACCESS                              = 1,
	WRITE_ACCESS                             = 2,
	WRITE_TRANSACTION_ACCESS                 = 3,
	WRITE_MANUAL_TRANSACTION_ACCESS          = 4,
	ERCAccess_MAX                            = 5,
};

// Enum RemoteControl.ERCModifyOperation
// NumValues: 0x0006
enum class ERCModifyOperation : uint8
{
	EQUAL                                    = 0,
	ADD                                      = 1,
	SUBTRACT                                 = 2,
	MULTIPLY                                 = 3,
	DIVIDE                                   = 4,
	ERCModifyOperation_MAX                   = 5,
};

// Enum RemoteControl.ERCWebSocketCompressionMode
// NumValues: 0x0003
enum class ERCWebSocketCompressionMode : uint8
{
	NONE                                     = 0,
	ZLIB                                     = 1,
	ERCWebSocketCompressionMode_MAX          = 2,
};

// Enum RemoteControl.ERCModifyOperationFlags
// NumValues: 0x0004
enum class ERCModifyOperationFlags : uint8
{
	None                                     = 0,
	SkipPropertyChangeEvents                 = 1,
	SkipTransactions                         = 2,
	ERCModifyOperationFlags_MAX              = 3,
};

// Enum RemoteControl.EExposedFieldType
// NumValues: 0x0004
enum class EExposedFieldType : uint8
{
	Invalid                                  = 0,
	Property                                 = 1,
	Function                                 = 2,
	EExposedFieldType_MAX                    = 3,
};

// Enum RemoteControl.ERemoteControlEnumClass
// NumValues: 0x0004
enum class ERemoteControlEnumClass : uint8
{
	E_One                                    = 0,
	E_Two                                    = 1,
	E_Three                                  = 2,
	E_MAX                                    = 3,
};

// Enum RemoteControl.ERemoteControlEnum
// NumValues: 0x0004
enum class ERemoteControlEnum : uint8
{
	E_One                                    = 0,
	E_Two                                    = 1,
	E_Three                                  = 2,
	E_MAX                                    = 3,
};

// Enum RemoteControl.ERCBindingStatus
// NumValues: 0x0004
enum class ERCBindingStatus : uint8
{
	Unassigned                               = 0,
	Awaiting                                 = 1,
	Bound                                    = 2,
	ERCBindingStatus_MAX                     = 3,
};

// ScriptStruct RemoteControl.RCFieldPathSegment
// 0x0050 (0x0050 - 0x0000)
struct FRCFieldPathSegment final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ArrayIndex;                                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ValuePropertyName;                                 // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MapKey;                                            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRCFieldPathSegment;

// ScriptStruct RemoteControl.RCFieldPathInfo
// 0x0018 (0x0018 - 0x0000)
struct FRCFieldPathInfo final
{
public:
	TArray<struct FRCFieldPathSegment>            Segments;                                          // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint32                                        PathHash;                                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRCFieldPathInfo;

// ScriptStruct RemoteControl.RCSignatureActionInstance
// 0x0010 (0x0010 - 0x0000)
struct FRCSignatureActionInstance final
{
public:
	struct FInstancedStruct                       ActionInstance;                                    // 0x0000(0x0010)(NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FRCSignatureActionInstance;

// ScriptStruct RemoteControl.RCSignatureField
// 0x00A0 (0x00A0 - 0x0000)
struct FRCSignatureField final
{
public:
	struct FRCFieldPathInfo                       FieldPath;                                         // 0x0000(0x0018)(NativeAccessSpecifierPublic)
	class FString                                 ObjectRelativePath;                                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         SupportedClass;                                    // 0x0028(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPropertyBagPropertyDesc               PropertyDesc;                                      // 0x0048(0x0040)(NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FRCSignatureActionInstance>     Actions;                                           // 0x0088(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRCSignatureField;

// ScriptStruct RemoteControl.RCSignature
// 0x0038 (0x0038 - 0x0000)
struct FRCSignature final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0010)(NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRCSignatureField>              Fields;                                            // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRCSignature;

// ScriptStruct RemoteControl.RCSignatureAction
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FRCSignatureAction
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRCSignatureAction;

// ScriptStruct RemoteControl.RemoteControlEntity
// 0x0098 (0x0098 - 0x0000)
struct FRemoteControlEntity
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FString>              UserMetadata;                                      // 0x0008(0x0050)(Protected, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class URemoteControlBinding>> Bindings;                                    // 0x0058(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class URemoteControlPreset>    Owner;                                             // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   Label;                                             // 0x0070(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  ID;                                                // 0x0078(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0x10];                                      // 0x0088(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRemoteControlEntity;

// ScriptStruct RemoteControl.RemoteControlActor
// 0x0020 (0x00B8 - 0x0098)
struct FRemoteControlActor final : public FRemoteControlEntity
{
public:
	struct FSoftObjectPath                        Path;                                              // 0x0098(0x0020)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRemoteControlActor;

// ScriptStruct RemoteControl.RemoteControlInitialBindingContext
// 0x0070 (0x0070 - 0x0000)
struct FRemoteControlInitialBindingContext final
{
public:
	TSoftClassPtr<class UClass>                   SupportedClass;                                    // 0x0000(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ComponentName;                                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SubObjectPath;                                     // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   OwnerActorClass;                                   // 0x0040(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OwnerActorName;                                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRemoteControlInitialBindingContext;

// ScriptStruct RemoteControl.RemoteControlDeltaAPITestStruct
// 0x0010 (0x0010 - 0x0000)
struct FRemoteControlDeltaAPITestStruct final
{
public:
	struct FLinearColor                           ColorValue;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRemoteControlDeltaAPITestStruct;

// ScriptStruct RemoteControl.RCEntityWrapper
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FRCEntityWrapper final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRCEntityWrapper;

// ScriptStruct RemoteControl.RemoteControlProtocolBinding
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) FRemoteControlProtocolBinding final
{
public:
	struct FGuid                                  ID;                                                // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ProtocolName;                                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  PropertyId;                                        // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   MappingPropertyName;                               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRemoteControlProtocolBinding;

// ScriptStruct RemoteControl.RemoteControlField
// 0x00A8 (0x0140 - 0x0098)
struct FRemoteControlField : public FRemoteControlEntity
{
public:
	EExposedFieldType                             FieldType;                                         // 0x0098(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   FieldName;                                         // 0x009C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyId;                                        // 0x00A4(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRCFieldPathInfo                       FieldPathInfo;                                     // 0x00B0(0x0018)(NativeAccessSpecifierPublic)
	TSet<struct FRemoteControlProtocolBinding>    ProtocolBindings;                                  // 0x00C8(0x0050)(NativeAccessSpecifierPublic)
	struct FSoftClassPath                         OwnerClass;                                        // 0x0118(0x0020)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsEditorOnly;                                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         ActiveMasks;                                       // 0x0139(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRemoteControlField;

// ScriptStruct RemoteControl.RemoteControlProperty
// 0x0008 (0x0148 - 0x0140)
struct FRemoteControlProperty : public FRemoteControlField
{
public:
	bool                                          bIsEditableInPackaged;                             // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRemoteControlProperty;

// ScriptStruct RemoteControl.RemoteControlFunction
// 0x0040 (0x0180 - 0x0140)
struct FRemoteControlFunction final : public FRemoteControlField
{
public:
	uint8                                         Pad_140[0x10];                                     // 0x0140(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsCallableInPackaged;                             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        FunctionPath;                                      // 0x0158(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRemoteControlFunction;

// ScriptStruct RemoteControl.RCFieldMetadata
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FRCFieldMetadata
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRCFieldMetadata;

// ScriptStruct RemoteControl.RCMetadata_byte
// 0x0008 (0x0010 - 0x0008)
struct FRCMetadata_byte final : public FRCFieldMetadata
{
public:
	uint8                                         Min;                                               // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Max;                                               // 0x0009(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         DefaultValue;                                      // 0x000A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRCMetadata_byte;

// ScriptStruct RemoteControl.RCMetadata_uint16
// 0x0008 (0x0010 - 0x0008)
struct FRCMetadata_uint16 final : public FRCFieldMetadata
{
public:
	uint16                                        Min;                                               // 0x0008(0x0002)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        Max;                                               // 0x000A(0x0002)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        DefaultValue;                                      // 0x000C(0x0002)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRCMetadata_uint16;

// ScriptStruct RemoteControl.RCMetadata_uint32
// 0x0010 (0x0018 - 0x0008)
struct FRCMetadata_uint32 final : public FRCFieldMetadata
{
public:
	uint32                                        Min;                                               // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Max;                                               // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        DefaultValue;                                      // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRCMetadata_uint32;

// ScriptStruct RemoteControl.RCMetadata_uint64
// 0x0018 (0x0020 - 0x0008)
struct FRCMetadata_uint64 final : public FRCFieldMetadata
{
public:
	uint64                                        Min;                                               // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Max;                                               // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        DefaultValue;                                      // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRCMetadata_uint64;

// ScriptStruct RemoteControl.RCMetadata_int8
// 0x0008 (0x0010 - 0x0008)
struct FRCMetadata_int8 final : public FRCFieldMetadata
{
public:
	int8                                          Min;                                               // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          Max;                                               // 0x0009(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          DefaultValue;                                      // 0x000A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRCMetadata_int8;

// ScriptStruct RemoteControl.RCMetadata_int16
// 0x0008 (0x0010 - 0x0008)
struct FRCMetadata_int16 final : public FRCFieldMetadata
{
public:
	int16                                         Min;                                               // 0x0008(0x0002)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         Max;                                               // 0x000A(0x0002)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         DefaultValue;                                      // 0x000C(0x0002)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRCMetadata_int16;

// ScriptStruct RemoteControl.RCMetadata_int32
// 0x0010 (0x0018 - 0x0008)
struct FRCMetadata_int32 final : public FRCFieldMetadata
{
public:
	int32                                         Min;                                               // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Max;                                               // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DefaultValue;                                      // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRCMetadata_int32;

// ScriptStruct RemoteControl.RCMetadata_int64
// 0x0018 (0x0020 - 0x0008)
struct FRCMetadata_int64 final : public FRCFieldMetadata
{
public:
	int64                                         Min;                                               // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Max;                                               // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         DefaultValue;                                      // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRCMetadata_int64;

// ScriptStruct RemoteControl.RCMetadata_float
// 0x0010 (0x0018 - 0x0008)
struct FRCMetadata_float final : public FRCFieldMetadata
{
public:
	float                                         Min;                                               // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Max;                                               // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultValue;                                      // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRCMetadata_float;

// ScriptStruct RemoteControl.RCMetadata_double
// 0x0018 (0x0020 - 0x0008)
struct FRCMetadata_double final : public FRCFieldMetadata
{
public:
	double                                        Min;                                               // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Max;                                               // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DefaultValue;                                      // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRCMetadata_double;

// ScriptStruct RemoteControl.RCMetadata_FString
// 0x0010 (0x0018 - 0x0008)
struct FRCMetadata_FString final : public FRCFieldMetadata
{
public:
	class FString                                 DefaultValue;                                      // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRCMetadata_FString;

// ScriptStruct RemoteControl.RCMetadata_FName
// 0x0008 (0x0010 - 0x0008)
struct FRCMetadata_FName final : public FRCFieldMetadata
{
public:
	class FName                                   DefaultValue;                                      // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRCMetadata_FName;

// ScriptStruct RemoteControl.RCMetadata_UObject
// 0x0028 (0x0030 - 0x0008)
struct FRCMetadata_UObject final : public FRCFieldMetadata
{
public:
	TSoftObjectPtr<class UObject>                 DefaultValue;                                      // 0x0008(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRCMetadata_UObject;

// ScriptStruct RemoteControl.RCMetadata_UClass
// 0x0028 (0x0030 - 0x0008)
struct FRCMetadata_UClass final : public FRCFieldMetadata
{
public:
	TSoftClassPtr<class UClass>                   DefaultValue;                                      // 0x0008(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRCMetadata_UClass;

// ScriptStruct RemoteControl.RCMetadata_UScriptStruct
// 0x0028 (0x0030 - 0x0008)
struct FRCMetadata_UScriptStruct final : public FRCFieldMetadata
{
public:
	TSoftObjectPtr<class UScriptStruct>           DefaultValue;                                      // 0x0008(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRCMetadata_UScriptStruct;

// ScriptStruct RemoteControl.RCMetadata_bool
// 0x0008 (0x0010 - 0x0008)
struct FRCMetadata_bool final : public FRCFieldMetadata
{
public:
	bool                                          DefaultValue;                                      // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRCMetadata_bool;

// ScriptStruct RemoteControl.RCMetadata_FVector
// 0x0048 (0x0050 - 0x0008)
struct FRCMetadata_FVector final : public FRCFieldMetadata
{
public:
	struct FVector                                DefaultValue;                                      // 0x0008(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MinimumValue;                                      // 0x0020(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MaximumValue;                                      // 0x0038(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRCMetadata_FVector;

// ScriptStruct RemoteControl.RemoteControlOptionalExposeArgs
// 0x0020 (0x0020 - 0x0000)
struct FRemoteControlOptionalExposeArgs final
{
public:
	class FString                                 DisplayName;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GroupName;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRemoteControlOptionalExposeArgs;

// ScriptStruct RemoteControl.ColorWheelColorBase
// 0x0018 (0x0018 - 0x0000)
struct FColorWheelColorBase
{
public:
	struct FVector2D                              Position;                                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Value;                                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FColorWheelColorBase;

// ScriptStruct RemoteControl.ColorWheelColor
// 0x0008 (0x0020 - 0x0018)
struct FColorWheelColor final : public FColorWheelColorBase
{
public:
	double                                        Alpha;                                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FColorWheelColor;

// ScriptStruct RemoteControl.ColorGradingWheelColor
// 0x0008 (0x0020 - 0x0018)
struct FColorGradingWheelColor final : public FColorWheelColorBase
{
public:
	double                                        Luminance;                                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FColorGradingWheelColor;

// ScriptStruct RemoteControl.RemoteControlInstanceMaterial
// 0x0050 (0x0198 - 0x0148)
struct FRemoteControlInstanceMaterial final : public FRemoteControlProperty
{
public:
	TSubclassOf<class UObject>                    OriginalClass;                                     // 0x0148(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FMaterialParameterInfo                 ParameterInfo;                                     // 0x0150(0x0010)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRCFieldPathInfo                       OriginalFieldPathInfo;                             // 0x0160(0x0018)(NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        InstancePath;                                      // 0x0178(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRemoteControlInstanceMaterial;

// ScriptStruct RemoteControl.RemoteControlInterceptionTestStruct
// 0x0004 (0x0004 - 0x0000)
struct FRemoteControlInterceptionTestStruct final
{
public:
	int32                                         Int32Value;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRemoteControlInterceptionTestStruct;

// ScriptStruct RemoteControl.RemoteControlInterceptionFunctionParamStruct
// 0x0028 (0x0028 - 0x0000)
struct FRemoteControlInterceptionFunctionParamStruct final
{
public:
	int32                                         Int32Value;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 IntArray;                                          // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 IntString;                                         // 0x0018(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRemoteControlInterceptionFunctionParamStruct;

// ScriptStruct RemoteControl.RCCachedFieldData
// 0x0018 (0x0018 - 0x0000)
struct FRCCachedFieldData final
{
public:
	struct FGuid                                  LayoutGroupId;                                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OwnerObjectAlias;                                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRCCachedFieldData;

// ScriptStruct RemoteControl.RemoteControlPresetGroup
// 0x0038 (0x0038 - 0x0000)
struct FRemoteControlPresetGroup final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TagColor;                                          // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          Fields;                                            // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FRemoteControlPresetGroup;

// ScriptStruct RemoteControl.RemoteControlPresetLayout
// 0x00D0 (0x00D0 - 0x0000)
struct FRemoteControlPresetLayout final
{
public:
	TArray<struct FGuid>                          DefaultGroupOrder;                                 // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FRemoteControlPresetGroup>      Groups;                                            // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class URemoteControlPreset>    Owner;                                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_28[0xA8];                                      // 0x0028(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRemoteControlPresetLayout;

// ScriptStruct RemoteControl.RemoteControlTestStructInnerSimple
// 0x0004 (0x0004 - 0x0000)
struct FRemoteControlTestStructInnerSimple final
{
public:
	int32                                         Int32Value;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRemoteControlTestStructInnerSimple;

// ScriptStruct RemoteControl.RemoteControlTestStructInner
// 0x001C (0x001C - 0x0000)
struct FRemoteControlTestStructInner final
{
public:
	int8                                          Int8Value;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRemoteControlTestStructInnerSimple    InnerSimple;                                       // 0x0004(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Int32Value;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x10];                                       // 0x000C(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRemoteControlTestStructInner;

// ScriptStruct RemoteControl.RemoteControlTestStructOuter
// 0x0078 (0x0078 - 0x0000)
struct FRemoteControlTestStructOuter final
{
public:
	int8                                          Int8Value;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FRemoteControlTestStructInner>    StructInnerSet;                                    // 0x0008(0x0050)(Edit, NativeAccessSpecifierPublic)
	int32                                         Int32Value;                                        // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRemoteControlTestStructInner          RemoteControlTestStructInner;                      // 0x005C(0x001C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRemoteControlTestStructOuter;

// ScriptStruct RemoteControl.RCPropertyIdWrapper
// 0x0028 (0x0028 - 0x0000)
struct FRCPropertyIdWrapper final
{
public:
	struct FGuid                                  EntityID;                                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   PropertyId;                                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   SuperType;                                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   SubType;                                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FRCPropertyIdWrapper;

// ScriptStruct RemoteControl.RemoteControlProtocolMapping
// 0x0078 (0x0078 - 0x0000)
struct FRemoteControlProtocolMapping final
{
public:
	struct FGuid                                  ID;                                                // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<uint8>                                 InterpolationRangePropertyData;                    // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<uint8>                                 InterpolationMappingPropertyData;                  // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<uint8>                                 InterpolationRangePropertyDataCache;               // 0x0030(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<uint8>                                 InterpolationMappingPropertyDataCache;             // 0x0040(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	int32                                         InterpolationMappingPropertyElementNum;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TFieldPath<class FProperty>                   BoundPropertyPath;                                 // 0x0058(0x0020)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FRemoteControlProtocolMapping;

// ScriptStruct RemoteControl.RemoteControlProtocolEntity
// 0x0088 (0x0088 - 0x0000)
struct FRemoteControlProtocolEntity final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class URemoteControlPreset>    Owner;                                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  PropertyId;                                        // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FRemoteControlProtocolMapping>    Mappings;                                          // 0x0030(0x0050)(Protected, NativeAccessSpecifierProtected)
	ERCMask                                       OverridenMasks;                                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ERCBindingStatus                              BindingStatus;                                     // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRemoteControlProtocolEntity;

// ScriptStruct RemoteControl.RemoteControlTestStruct
// 0x0048 (0x0048 - 0x0000)
struct FRemoteControlTestStruct final
{
public:
	bool                                          bSomeBool;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        SomeUInt32;                                        // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SomeFloat;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SomeVector;                                        // 0x0010(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               SomeRotator;                                       // 0x0028(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         SomeClampedInt;                                    // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SomeClampedFloat;                                  // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRemoteControlTestStruct;

// ScriptStruct RemoteControl.RemoteControlTestInnerStruct
// 0x0028 (0x0028 - 0x0000)
struct FRemoteControlTestInnerStruct final
{
public:
	struct FColor                                 Color;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 FloatArray;                                        // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        ArrayOfVectors;                                    // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRemoteControlTestInnerStruct;

SDK_NAMESPACE_END
