#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RemoteControlComponents

#include "Basic.hpp"

#include "RemoteControl_structs.hpp"


SDK_NAMESPACE_START

// ScriptStruct RemoteControlComponents.RemoteControlTrackerProperty
// 0x0038 (0x0038 - 0x0000)
struct FRemoteControlTrackerProperty final
{
public:
	struct FRCFieldPathInfo                       FieldPathInfo;                                     // 0x0000(0x0018)(NativeAccessSpecifierPrivate)
	class FName                                   PropertyId;                                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UObject>                 OwnerObject;                                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsExposed;                                        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class URemoteControlPreset>    CurrentPresetWeak;                                 // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRemoteControlTrackerProperty;

SDK_NAMESPACE_END
