#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SnapserPlugin

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "TyrSharedTypes_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function SnapserPlugin.SnapserAsyncActionApplyConsumable.ApplyConsumable
// 0x0090 (0x0090 - 0x0000)
struct SnapserAsyncActionApplyConsumable_ApplyConsumable final
{
public:
	class USnapserInventorySubsystem*             Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendUserId;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ConsumableId;                                      // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            RequestFields_0;                                   // 0x0038(0x0050)(Parm, NativeAccessSpecifierPublic)
	class USnapserAsyncActionApplyConsumable*     ReturnValue;                                       // 0x0088(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionApplyConsumable_ApplyConsumable;

// Function SnapserPlugin.SnapserAsyncActionBatchGetUserScores.BatchGetUserScores
// 0x0040 (0x0040 - 0x0000)
struct SnapserAsyncActionBatchGetUserScores_BatchGetUserScores final
{
public:
	class USnapserLeaderboardSubsystem*           Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         UserIds;                                           // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 LeaderboardName;                                   // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionBatchGetUserScores*  ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionBatchGetUserScores_BatchGetUserScores;

// Function SnapserPlugin.SnapserAsyncActionBeginMicrotransaction.BeginMicrotransaction
// 0x0040 (0x0040 - 0x0000)
struct SnapserAsyncActionBeginMicrotransaction_BeginMicrotransaction final
{
public:
	class USnapserProgressionSubsystem*           Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendUserId;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemId;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionBeginMicrotransaction* ReturnValue;                                     // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionBeginMicrotransaction_BeginMicrotransaction;

// Function SnapserPlugin.SnapserAsyncActionChangeActiveVehicleLoadout.ChangeActiveVehicleLoadout
// 0x0040 (0x0040 - 0x0000)
struct SnapserAsyncActionChangeActiveVehicleLoadout_ChangeActiveVehicleLoadout final
{
public:
	class USnapserProgressionSubsystem*           Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendUserId;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VehicleId;                                         // 0x0028(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoadoutIndex;                                      // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USnapserAsyncActionChangeActiveVehicleLoadout* ReturnValue;                                // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionChangeActiveVehicleLoadout_ChangeActiveVehicleLoadout;

// Function SnapserPlugin.SnapserAsyncActionClaimClanRewards.ClaimClanRewards
// 0x0040 (0x0040 - 0x0000)
struct SnapserAsyncActionClaimClanRewards_ClaimClanRewards final
{
public:
	class USnapserClanSubsystem*                  Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClanId;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserId;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionClaimClanRewards*    ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionClaimClanRewards_ClaimClanRewards;

// Function SnapserPlugin.SnapserAsyncActionClaimQuestReward.ClaimQuestReward
// 0x0038 (0x0038 - 0x0000)
struct SnapserAsyncActionClaimQuestReward_ClaimQuestReward final
{
public:
	class USnapserQuestsSubsystem*                Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendUserId;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           QuestTag;                                          // 0x0028(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionClaimQuestReward*    ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionClaimQuestReward_ClaimQuestReward;

// Function SnapserPlugin.SnapserAsyncActionClanAcceptInvite.ClanAcceptInvite
// 0x0040 (0x0040 - 0x0000)
struct SnapserAsyncActionClanAcceptInvite_ClanAcceptInvite final
{
public:
	class USnapserClanSubsystem*                  Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InviteId;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserId;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionClanAcceptInvite*    ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionClanAcceptInvite_ClanAcceptInvite;

// Function SnapserPlugin.SnapserAsyncActionClanGetMembers.ClanGetMembers
// 0x0030 (0x0030 - 0x0000)
struct SnapserAsyncActionClanGetMembers_ClanGetMembers final
{
public:
	class USnapserClanSubsystem*                  Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClanId;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionClanGetMembers*      ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionClanGetMembers_ClanGetMembers;

// Function SnapserPlugin.SnapserAsyncActionClanInviteMember.ClanInviteMember
// 0x0050 (0x0050 - 0x0000)
struct SnapserAsyncActionClanInviteMember_ClanInviteMember final
{
public:
	class USnapserClanSubsystem*                  Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClanId;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InviteeUserId;                                     // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LeaderUserId;                                      // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionClanInviteMember*    ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionClanInviteMember_ClanInviteMember;

// Function SnapserPlugin.SnapserAsyncActionCreateClan.CreateClan
// 0x0048 (0x0048 - 0x0000)
struct SnapserAsyncActionCreateClan_CreateClan final
{
public:
	class USnapserClanSubsystem*                  Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClanName;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPublic;                                         // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UserId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionCreateClan*          ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionCreateClan_CreateClan;

// Function SnapserPlugin.SnapserAsyncActionCreateLobby.CreateLobby
// 0x00B8 (0x00B8 - 0x0000)
struct SnapserAsyncActionCreateLobby_CreateLobby final
{
public:
	class USnapserLobbySubsystem*                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            AllocationMetadata;                                // 0x0018(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 JoinCode;                                          // 0x0068(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxMembers;                                        // 0x0078(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowPartyJoin;                                   // 0x007C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name_0;                                            // 0x0080(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0090(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Password;                                          // 0x00A0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionCreateLobby*         ReturnValue;                                       // 0x00B0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionCreateLobby_CreateLobby;

// Function SnapserPlugin.SnapserAsyncActionDeleteLobby.DeleteLobby
// 0x0040 (0x0040 - 0x0000)
struct SnapserAsyncActionDeleteLobby_DeleteLobby final
{
public:
	class USnapserLobbySubsystem*                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LobbyId;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Owner;                                             // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionDeleteLobby*         ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionDeleteLobby_DeleteLobby;

// Function SnapserPlugin.SnapserAsyncActionFinalizeMicrotransaction.FinalizeMicrotransaction
// 0x0050 (0x0050 - 0x0000)
struct SnapserAsyncActionFinalizeMicrotransaction_FinalizeMicrotransaction final
{
public:
	class USnapserProgressionSubsystem*           Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendUserId;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OrderId;                                           // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProductId;                                         // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionFinalizeMicrotransaction* ReturnValue;                                  // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionFinalizeMicrotransaction_FinalizeMicrotransaction;

// Function SnapserPlugin.SnapserAsyncActionGetActiveClans.GetActiveClans
// 0x0020 (0x0020 - 0x0000)
struct SnapserAsyncActionGetActiveClans_GetActiveClans final
{
public:
	class USnapserClanSubsystem*                  Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionGetActiveClans*      ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionGetActiveClans_GetActiveClans;

// Function SnapserPlugin.SnapserAsyncActionGetActiveQuests.GetActiveQuests
// 0x0030 (0x0030 - 0x0000)
struct SnapserAsyncActionGetActiveQuests_GetActiveQuests final
{
public:
	class USnapserQuestsSubsystem*                Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendUserId;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionGetActiveQuests*     ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionGetActiveQuests_GetActiveQuests;

// Function SnapserPlugin.SnapserAsyncActionGetAllUserStyles.GetAllUserStyles
// 0x0030 (0x0030 - 0x0000)
struct SnapserAsyncActionGetAllUserStyles_GetAllUserStyles final
{
public:
	class USnapserProgressionSubsystem*           Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendUserId;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionGetAllUserStyles*    ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionGetAllUserStyles_GetAllUserStyles;

// Function SnapserPlugin.SnapserAsyncActionGetClan.GetClan
// 0x0030 (0x0030 - 0x0000)
struct SnapserAsyncActionGetClan_GetClan final
{
public:
	class USnapserClanSubsystem*                  Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClanId;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionGetClan*             ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionGetClan_GetClan;

// Function SnapserPlugin.SnapserAsyncActionGetClanForUser.GetClanForUser
// 0x0030 (0x0030 - 0x0000)
struct SnapserAsyncActionGetClanForUser_GetClanForUser final
{
public:
	class USnapserClanSubsystem*                  Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserId;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionGetClanForUser*      ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionGetClanForUser_GetClanForUser;

// Function SnapserPlugin.SnapserAsyncActionGetPendingClanInvites.GetPendingClanInvites
// 0x0030 (0x0030 - 0x0000)
struct SnapserAsyncActionGetPendingClanInvites_GetPendingClanInvites final
{
public:
	class USnapserClanSubsystem*                  Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserId;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionGetPendingClanInvites* ReturnValue;                                     // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionGetPendingClanInvites_GetPendingClanInvites;

// Function SnapserPlugin.SnapserAsyncActionGetTierScores.GetLeaderboardScores
// 0x0060 (0x0060 - 0x0000)
struct SnapserAsyncActionGetTierScores_GetLeaderboardScores final
{
public:
	class USnapserLeaderboardSubsystem*           Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LeaderboardName;                                   // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendUserId;                                     // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Range;                                             // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeGlobal;                                    // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USnapserAsyncActionGetTierScores*       ReturnValue;                                       // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionGetTierScores_GetLeaderboardScores;

// Function SnapserPlugin.SnapserAsyncActionGetUserProgression.RequestUserProgression
// 0x0030 (0x0030 - 0x0000)
struct SnapserAsyncActionGetUserProgression_RequestUserProgression final
{
public:
	class USnapserProgressionSubsystem*           Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendUserId;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionGetUserProgression*  ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionGetUserProgression_RequestUserProgression;

// Function SnapserPlugin.SnapserAsyncActionGetUserScore.GetUserScore
// 0x0040 (0x0040 - 0x0000)
struct SnapserAsyncActionGetUserScore_GetUserScore final
{
public:
	class USnapserLeaderboardSubsystem*           Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserId;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LeaderboardName;                                   // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionGetUserScore*        ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionGetUserScore_GetUserScore;

// Function SnapserPlugin.SnapserAsyncActionGetUserStyle.GetUserStyle
// 0x0038 (0x0038 - 0x0000)
struct SnapserAsyncActionGetUserStyle_GetUserStyle final
{
public:
	class USnapserProgressionSubsystem*           Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendUserId;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VehicleTag;                                        // 0x0028(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionGetUserStyle*        ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionGetUserStyle_GetUserStyle;

// Function SnapserPlugin.SnapserAsyncActionGetUserVehicleLoadouts.GetUserVehicleLoadouts
// 0x0038 (0x0038 - 0x0000)
struct SnapserAsyncActionGetUserVehicleLoadouts_GetUserVehicleLoadouts final
{
public:
	class USnapserProgressionSubsystem*           Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendUserId;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           LoadoutTag;                                        // 0x0028(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionGetUserVehicleLoadouts* ReturnValue;                                    // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionGetUserVehicleLoadouts_GetUserVehicleLoadouts;

// Function SnapserPlugin.SnapserAsyncActionJoinClan.JoinClan
// 0x0040 (0x0040 - 0x0000)
struct SnapserAsyncActionJoinClan_JoinClan final
{
public:
	class USnapserClanSubsystem*                  Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClanId;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserId;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionJoinClan*            ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionJoinClan_JoinClan;

// Function SnapserPlugin.SnapserAsyncActionJoinClanByCode.JoinClanByCode
// 0x0040 (0x0040 - 0x0000)
struct SnapserAsyncActionJoinClanByCode_JoinClanByCode final
{
public:
	class USnapserClanSubsystem*                  Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 code;                                              // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserId;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionJoinClanByCode*      ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionJoinClanByCode_JoinClanByCode;

// Function SnapserPlugin.SnapserAsyncActionJoinLobby.JoinLobby
// 0x0050 (0x0050 - 0x0000)
struct SnapserAsyncActionJoinLobby_JoinLobby final
{
public:
	class USnapserLobbySubsystem*                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LobbyId;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserId;                                            // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Password;                                          // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionJoinLobby*           ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionJoinLobby_JoinLobby;

// Function SnapserPlugin.SnapserAsyncActionLeaveClan.LeaveClan
// 0x0040 (0x0040 - 0x0000)
struct SnapserAsyncActionLeaveClan_LeaveClan final
{
public:
	class USnapserClanSubsystem*                  Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClanId;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserId;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionLeaveClan*           ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionLeaveClan_LeaveClan;

// Function SnapserPlugin.SnapserAsyncActionLeaveLobby.LeaveLobby
// 0x0040 (0x0040 - 0x0000)
struct SnapserAsyncActionLeaveLobby_LeaveLobby final
{
public:
	class USnapserLobbySubsystem*                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LobbyId;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserId;                                            // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionLeaveLobby*          ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionLeaveLobby_LeaveLobby;

// Function SnapserPlugin.SnapserAsyncActionMatchDetails.RequestMatchDetails
// 0x0040 (0x0040 - 0x0000)
struct SnapserAsyncActionMatchDetails_RequestMatchDetails final
{
public:
	class USnapserProgressionSubsystem*           Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendUserId;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Matchdetailsid;                                    // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionMatchDetails*        ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionMatchDetails_RequestMatchDetails;

// Function SnapserPlugin.SnapserAsyncActionPurchaseAmmunition.PurchaseAmmunition
// 0x0050 (0x0050 - 0x0000)
struct SnapserAsyncActionPurchaseAmmunition_PurchaseAmmunition final
{
public:
	class USnapserProgressionSubsystem*           Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendUserId;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VehicleId;                                         // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AmmunitionId;                                      // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionPurchaseAmmunition*  ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionPurchaseAmmunition_PurchaseAmmunition;

// Function SnapserPlugin.SnapserAsyncActionPurchaseComponent.PurchaseComponent
// 0x0050 (0x0050 - 0x0000)
struct SnapserAsyncActionPurchaseComponent_PurchaseComponent final
{
public:
	class USnapserProgressionSubsystem*           Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendUserId;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VehicleId;                                         // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ComponentId;                                       // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionPurchaseComponent*   ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionPurchaseComponent_PurchaseComponent;

// Function SnapserPlugin.SnapserAsyncActionPurchaseVehicle.PurchaseVehicle
// 0x0040 (0x0040 - 0x0000)
struct SnapserAsyncActionPurchaseVehicle_PurchaseVehicle final
{
public:
	class USnapserProgressionSubsystem*           Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendUserId;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VehicleId;                                         // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionPurchaseVehicle*     ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionPurchaseVehicle_PurchaseVehicle;

// Function SnapserPlugin.SnapserAsyncActionSaveUserStyle.SaveUserStyle
// 0x0078 (0x0078 - 0x0000)
struct SnapserAsyncActionSaveUserStyle_SaveUserStyle final
{
public:
	class USnapserProgressionSubsystem*           Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendUserId;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VehicleTag;                                        // 0x0028(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStyleItemsBlob                        Style;                                             // 0x0030(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USnapserAsyncActionSaveUserStyle*       ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionSaveUserStyle_SaveUserStyle;

// Function SnapserPlugin.SnapserAsyncActionSearchClans.SearchClans
// 0x0020 (0x0020 - 0x0000)
struct SnapserAsyncActionSearchClans_SearchClans final
{
public:
	class USnapserClanSubsystem*                  Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionSearchClans*         ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionSearchClans_SearchClans;

// Function SnapserPlugin.SnapserAsyncActionSetProfileAttributeFromItem.SetProfileAttributeFromItem
// 0x0040 (0x0040 - 0x0000)
struct SnapserAsyncActionSetProfileAttributeFromItem_SetProfileAttributeFromItem final
{
public:
	class USnapserProgressionSubsystem*           Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendUserId;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemId;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionSetProfileAttributeFromItem* ReturnValue;                               // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionSetProfileAttributeFromItem_SetProfileAttributeFromItem;

// Function SnapserPlugin.SnapserAsyncActionStartMatch.StartMatch
// 0x0060 (0x0060 - 0x0000)
struct SnapserAsyncActionStartMatch_StartMatch final
{
public:
	class USnapserLobbySubsystem*                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LobbyId;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OwnerId;                                           // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Region;                                            // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FleetName;                                         // 0x0048(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionStartMatch*          ReturnValue;                                       // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionStartMatch_StartMatch;

// Function SnapserPlugin.SnapserAsyncActionSubmitVehicleLoadout.UpdateVehicleLoadout
// 0x00A8 (0x00A8 - 0x0000)
struct SnapserAsyncActionSubmitVehicleLoadout_UpdateVehicleLoadout final
{
public:
	class USnapserProgressionSubsystem*           Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendUserId;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCompleteVehicleLoadout                Vehicleloadout;                                    // 0x0028(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         LoadoutIndex;                                      // 0x0098(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USnapserAsyncActionSubmitVehicleLoadout* ReturnValue;                                      // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionSubmitVehicleLoadout_UpdateVehicleLoadout;

// Function SnapserPlugin.SnapserAsyncActionUserHistory.RequestUserMatchHistory
// 0x0030 (0x0030 - 0x0000)
struct SnapserAsyncActionUserHistory_RequestUserMatchHistory final
{
public:
	class USnapserProgressionSubsystem*           Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendUserId;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendSessionToken;                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapserAsyncActionUserHistory*         ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserAsyncActionUserHistory_RequestUserMatchHistory;

// Function SnapserPlugin.SnapserLeaderboardBlueprintLibrary.ConvertLeaderboardStringToTag
// 0x0018 (0x0018 - 0x0000)
struct SnapserLeaderboardBlueprintLibrary_ConvertLeaderboardStringToTag final
{
public:
	class FString                                 LeaderboardString;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserLeaderboardBlueprintLibrary_ConvertLeaderboardStringToTag;

// Function SnapserPlugin.SnapserLeaderboardBlueprintLibrary.ConvertTagToLeaderboardString
// 0x0018 (0x0018 - 0x0000)
struct SnapserLeaderboardBlueprintLibrary_ConvertTagToLeaderboardString final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserLeaderboardBlueprintLibrary_ConvertTagToLeaderboardString;

// Function SnapserPlugin.SnapserLeaderboardBlueprintLibrary.ConvertTierNameToTag
// 0x0018 (0x0018 - 0x0000)
struct SnapserLeaderboardBlueprintLibrary_ConvertTierNameToTag final
{
public:
	class FString                                 TierName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserLeaderboardBlueprintLibrary_ConvertTierNameToTag;

// Function SnapserPlugin.SnapserLeaderboardBlueprintLibrary.GetTierNameFromTag
// 0x0018 (0x0018 - 0x0000)
struct SnapserLeaderboardBlueprintLibrary_GetTierNameFromTag final
{
public:
	struct FGameplayTag                           TierTag;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserLeaderboardBlueprintLibrary_GetTierNameFromTag;

// Function SnapserPlugin.SnapserProfilesFunctionLibrary.ConvertItemTagToTitleTag
// 0x0010 (0x0010 - 0x0000)
struct SnapserProfilesFunctionLibrary_ConvertItemTagToTitleTag final
{
public:
	struct FGameplayTag                           ItemTag;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserProfilesFunctionLibrary_ConvertItemTagToTitleTag;

// Function SnapserPlugin.SnapserProfilesFunctionLibrary.ConvertTitleTagToItemTag
// 0x0010 (0x0010 - 0x0000)
struct SnapserProfilesFunctionLibrary_ConvertTitleTagToItemTag final
{
public:
	struct FGameplayTag                           TitleTag;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SnapserProfilesFunctionLibrary_ConvertTitleTagToItemTag;

// Function SnapserPlugin.SnapserProgressionHelperLibrary.BreakGameplayItemName
// 0x0038 (0x0038 - 0x0000)
struct SnapserProgressionHelperLibrary_BreakGameplayItemName final
{
public:
	class FString                                 ItemName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutN_Part;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutY_Part;                                         // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SnapserProgressionHelperLibrary_BreakGameplayItemName;

// Function SnapserPlugin.SnapserProgressionHelperLibrary.BreakGameplayItemNameAll
// 0x0028 (0x0028 - 0x0000)
struct SnapserProgressionHelperLibrary_BreakGameplayItemNameAll final
{
public:
	class FString                                 ItemName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         OutParts;                                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SnapserProgressionHelperLibrary_BreakGameplayItemNameAll;

// Function SnapserPlugin.SnapserProgressionHelperLibrary.BreakGameplayItemTag
// 0x0030 (0x0030 - 0x0000)
struct SnapserProgressionHelperLibrary_BreakGameplayItemTag final
{
public:
	struct FGameplayTag                           ItemTag;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutN_Part;                                         // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutY_Part;                                         // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SnapserProgressionHelperLibrary_BreakGameplayItemTag;

// Function SnapserPlugin.SnapserProgressionHelperLibrary.BreakGameplayItemTagAll
// 0x0020 (0x0020 - 0x0000)
struct SnapserProgressionHelperLibrary_BreakGameplayItemTagAll final
{
public:
