#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SVGImporter

#include "Basic.hpp"

#include "GeometryFramework_classes.hpp"
#include "SVGImporter_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


SDK_NAMESPACE_START

// Class SVGImporter.SVGBaseDynamicMeshComponent
// 0x0010 (0x0920 - 0x0910)
#pragma pack(push, 0x1)
class SDK_ALIGN(0x10) USVGBaseDynamicMeshComponent : public UDynamicMeshComponent
{
public:
	uint8                                         Pad_910[0x8];                                      // 0x0910(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SVGBaseDynamicMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SVGBaseDynamicMeshComponent")
	}
	static class USVGBaseDynamicMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USVGBaseDynamicMeshComponent>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_USVGBaseDynamicMeshComponent;

// Class SVGImporter.JoinedSVGDynamicMeshComponent
// 0x0090 (0x09B0 - 0x0920)
class UJoinedSVGDynamicMeshComponent final : public USVGBaseDynamicMeshComponent
{
public:
	class UDynamicMesh*                           SVGStoredMesh;                                     // 0x0918(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	EJoinedSVGMeshColoring                        Coloring;                                          // 0x0920(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_921[0x3];                                      // 0x0921(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           MainColor;                                         // 0x0924(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_934[0x4];                                      // 0x0934(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FSVGShapeParameters>              ShapeParametersList;                               // 0x0938(0x0050)(Edit, EditFixedSize, Protected, NativeAccessSpecifierProtected)
	TArray<class UMaterialInstanceDynamic*>       ShapesMaterials;                                   // 0x0988(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	class UMaterial*                              MeshMaterial_Lit;                                  // 0x0998(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UMaterial*                              MeshMaterial_Unlit;                                // 0x09A0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	bool                                          bSVGIsUnlit;                                       // 0x09A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9A9[0x7];                                      // 0x09A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JoinedSVGDynamicMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JoinedSVGDynamicMeshComponent")
	}
	static class UJoinedSVGDynamicMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJoinedSVGDynamicMeshComponent>();
	}
};
DUMPER7_ASSERTS_UJoinedSVGDynamicMeshComponent;

// Class SVGImporter.SVGDynamicMeshesContainerActor
// 0x0000 (0x02A8 - 0x02A8)
class ASVGDynamicMeshesContainerActor : public AActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SVGDynamicMeshesContainerActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SVGDynamicMeshesContainerActor")
	}
	static class ASVGDynamicMeshesContainerActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASVGDynamicMeshesContainerActor>();
	}
};
DUMPER7_ASSERTS_ASVGDynamicMeshesContainerActor;

// Class SVGImporter.SVGActor
// 0x0178 (0x0420 - 0x02A8)
class ASVGActor final : public ASVGDynamicMeshesContainerActor
{
public:
	uint8                                         Pad_2A8[0x78];                                     // 0x02A8(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class USVGData*                               SVGData;                                           // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	ESVGRenderMode                                RenderMode;                                        // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Scale;                                             // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESVGExtrudeType                               ExtrudeType;                                       // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FillsExtrude;                                      // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StrokesExtrude;                                    // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShapesOffset;                                      // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BevelDistance;                                     // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShapesOffsetScale;                                 // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSmoothFillShapes;                                 // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SmoothingOffset;                                   // 0x034C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreStrokes;                                    // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StrokesWidth;                                      // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPolygonOffsetJoinType                        StrokeJoinStyle;                                   // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSVGIsUnlit;                                       // 0x0359(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSVGCastsShadow;                                   // 0x035A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisible;                                          // 0x035B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSVGHasStrokes;                                    // 0x035C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSVGHasFills;                                      // 0x035D(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_35E[0x2];                                      // 0x035E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        FillShapesRoot;                                    // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class USceneComponent*                        StrokeShapesRoot;                                  // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<class USVGDynamicMeshComponent*>       ShapeComponents;                                   // 0x0370(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	class UStaticMeshComponent*                   SVGPlane;                                          // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UStaticMesh*                            PlaneStaticMesh;                                   // 0x0388(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UMaterial*                              PlaneMaterial;                                     // 0x0390(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UMaterial*                              PlaneMaterial_Unlit;                               // 0x0398(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UMaterialInstanceDynamic*               PlaneMaterialInstance;                             // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	bool                                          bMeshesShouldBeGenerated;                          // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SVGName;                                           // 0x03B0(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C0[0x40];                                     // 0x03C0(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OffsetToCenterSVGMeshes;                           // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SVGActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SVGActor")
	}
	static class ASVGActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASVGActor>();
	}
};
DUMPER7_ASSERTS_ASVGActor;

// Class SVGImporter.SVGActorEditorComponent
// 0x0000 (0x0240 - 0x0240)
class USVGActorEditorComponent final : public USceneComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SVGActorEditorComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SVGActorEditorComponent")
	}
	static class USVGActorEditorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USVGActorEditorComponent>();
	}
};
DUMPER7_ASSERTS_USVGActorEditorComponent;

// Class SVGImporter.SVGBakedActor
// 0x0010 (0x02B8 - 0x02A8)
class ASVGBakedActor final : public AActor
{
public:
	TArray<struct FSVGBakeElement>                SVGBakeElements;                                   // 0x02A8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SVGBakedActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SVGBakedActor")
	}
	static class ASVGBakedActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASVGBakedActor>();
	}
};
DUMPER7_ASSERTS_ASVGBakedActor;

// Class SVGImporter.SVGData
// 0x0028 (0x0050 - 0x0028)
class USVGData final : public UObject
{
public:
	class UTexture2D*                             SVGTexture;                                        // 0x0028(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class FString                                 SVGFileContent;                                    // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSVGShape>                      Shapes;                                            // 0x0040(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SVGData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SVGData")
	}
	static class USVGData* GetDefaultObj()
	{
		return GetDefaultObjImpl<USVGData>();
	}
};
DUMPER7_ASSERTS_USVGData;

// Class SVGImporter.SVGDynamicMeshComponent
// 0x00C0 (0x09E0 - 0x0920)
class USVGDynamicMeshComponent : public USVGBaseDynamicMeshComponent
{
public:
	struct FColor                                 Color;                                             // 0x0918(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESVGExtrudeType                               ExtrudeType;                                       // 0x091C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91D[0x3];                                      // 0x091D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Extrude;                                           // 0x0920(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Bevel;                                             // 0x0924(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                              MeshMaterial;                                      // 0x0928(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UMaterial*                              MeshMaterial_Unlit;                                // 0x0930(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UMaterialInstanceDynamic*               MeshMaterialInstance;                              // 0x0938(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UMaterialInterface*                     AssignedMaterial;                                  // 0x0940(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	struct FColor                                 SVGColor;                                          // 0x0948(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DefaultExtrude;                                    // 0x094C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinExtrudeValue;                                   // 0x0950(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_954[0x4];                                      // 0x0954(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ExtrudeDirection;                                  // 0x0958(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSVGIsUnlit;                                       // 0x0970(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_971[0x3];                                      // 0x0971(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Scale;                                             // 0x0974(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_978[0x8];                                      // 0x0978(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InternalCenter;                                    // 0x0980(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_998[0x38];                                     // 0x0998(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	ESVGMaterialType                              MaterialType;                                      // 0x09D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9D1[0x7];                                      // 0x09D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicMesh*                           SVGStoredMesh;                                     // 0x09D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	void SetColor(const struct FColor& InColor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SVGDynamicMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SVGDynamicMeshComponent")
	}
	static class USVGDynamicMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USVGDynamicMeshComponent>();
	}
};
DUMPER7_ASSERTS_USVGDynamicMeshComponent;

// Class SVGImporter.SVGEngineSubsystem
// 0x0010 (0x0040 - 0x0030)
class USVGEngineSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SVGEngineSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SVGEngineSubsystem")
	}
	static class USVGEngineSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USVGEngineSubsystem>();
	}
};
DUMPER7_ASSERTS_USVGEngineSubsystem;

// Class SVGImporter.SVGFillComponent
// 0x0470 (0x0E50 - 0x09E0)
class USVGFillComponent final : public USVGDynamicMeshComponent
{
public:
	uint8                                         Pad_9E0[0x450];                                    // 0x09E0(0x0450)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSimplify;                                         // 0x0E30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBypassClipper;                                    // 0x0E31(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E32[0x2];                                      // 0x0E32(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SmoothingOffset;                                   // 0x0E34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSVGFillMeshData                       FillMeshData;                                      // 0x0E38(0x0010)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_E48[0x8];                                      // 0x0E48(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SVGFillComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SVGFillComponent")
	}
	static class USVGFillComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USVGFillComponent>();
	}
};
DUMPER7_ASSERTS_USVGFillComponent;

// Class SVGImporter.SVGImporterSettings
// 0x0008 (0x0040 - 0x0038)
class USVGImporterSettings final : public UDeveloperSettings
{
public:
	ESVGSplineConversionQuality                   SplineConversionQuality;                           // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SVGImporterSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SVGImporterSettings")
	}
	static class USVGImporterSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USVGImporterSettings>();
	}
};
DUMPER7_ASSERTS_USVGImporterSettings;

// Class SVGImporter.SVGJoinedShapesActor
// 0x0008 (0x02B0 - 0x02A8)
class ASVGJoinedShapesActor final : public ASVGDynamicMeshesContainerActor
{
public:
	class UJoinedSVGDynamicMeshComponent*         JointDynamicMeshComponent;                         // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SVGJoinedShapesActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SVGJoinedShapesActor")
	}
	static class ASVGJoinedShapesActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASVGJoinedShapesActor>();
	}
};
DUMPER7_ASSERTS_ASVGJoinedShapesActor;

// Class SVGImporter.SVGShapeActor
// 0x0008 (0x02B0 - 0x02A8)
class ASVGShapeActor final : public ASVGDynamicMeshesContainerActor
{
public:
	class USVGDynamicMeshComponent*               SVGShape;                                          // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SVGShapeActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SVGShapeActor")
	}
	static class ASVGShapeActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASVGShapeActor>();
	}
};
DUMPER7_ASSERTS_ASVGShapeActor;

// Class SVGImporter.SVGShapesParentActor
// 0x0000 (0x02A8 - 0x02A8)
class ASVGShapesParentActor final : public ASVGDynamicMeshesContainerActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SVGShapesParentActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SVGShapesParentActor")
	}
	static class ASVGShapesParentActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASVGShapesParentActor>();
	}
};
DUMPER7_ASSERTS_ASVGShapesParentActor;

// Class SVGImporter.SVGStrokeComponent
// 0x0020 (0x0A00 - 0x09E0)
class USVGStrokeComponent final : public USVGDynamicMeshComponent
{
public:
	TArray<struct FVector>                        StrokePoints;                                      // 0x09E0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                         StrokeThickness;                                   // 0x09F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bStrokeIsClosed;                                   // 0x09F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bStrokeIsClockwise;                                // 0x09F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPolygonOffsetJoinType                        JoinStyle;                                         // 0x09F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9F7[0x9];                                      // 0x09F7(0x0009)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SVGStrokeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SVGStrokeComponent")
	}
	static class USVGStrokeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USVGStrokeComponent>();
	}
};
DUMPER7_ASSERTS_USVGStrokeComponent;

SDK_NAMESPACE_END
