#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SVGImporter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// Enum SVGImporter.EJoinedSVGMeshColoring
// NumValues: 0x0003
enum class EJoinedSVGMeshColoring : uint8
{
	SeparateColors                           = 0,
	SingleColor                              = 1,
	EJoinedSVGMeshColoring_MAX               = 2,
};

// Enum SVGImporter.ESVGRenderMode
// NumValues: 0x0003
enum class ESVGRenderMode : uint8
{
	DynamicMesh3D                            = 0,
	Texture2D                                = 1,
	ESVGRenderMode_MAX                       = 2,
};

// Enum SVGImporter.ESVGSplineConversionQuality
// NumValues: 0x0008
enum class ESVGSplineConversionQuality : uint8
{
	None                                     = 0,
	VeryLow                                  = 1,
	Low                                      = 2,
	Normal                                   = 3,
	Increased                                = 4,
	High                                     = 5,
	VeryHigh                                 = 6,
	ESVGSplineConversionQuality_MAX          = 7,
};

// Enum SVGImporter.ESVGExtrudeType
// NumValues: 0x0004
enum class ESVGExtrudeType : uint8
{
	None                                     = 0,
	FrontFaceOnly                            = 1,
	FrontBackMirror                          = 2,
	ESVGExtrudeType_MAX                      = 3,
};

// Enum SVGImporter.ESVGEditMode
// NumValues: 0x0003
enum class ESVGEditMode : uint8
{
	Interactive                              = 0,
	ValueSet                                 = 1,
	ESVGEditMode_MAX                         = 2,
};

// Enum SVGImporter.ESVGMaterialType
// NumValues: 0x0003
enum class ESVGMaterialType : uint8
{
	Default                                  = 0,
	Custom                                   = 1,
	ESVGMaterialType_MAX                     = 2,
};

// Enum SVGImporter.EPolygonOffsetJoinType
// NumValues: 0x0004
enum class EPolygonOffsetJoinType : uint8
{
	Square                                   = 0,
	Round                                    = 1,
	Miter                                    = 2,
	EPolygonOffsetJoinType_MAX               = 3,
};

// ScriptStruct SVGImporter.SVGShapeParameters
// 0x0028 (0x0028 - 0x0000)
struct FSVGShapeParameters final
{
public:
	class FString                                 ShapeName;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaterialID;                                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSVGShapeParameters;

// ScriptStruct SVGImporter.JoinedSVGMeshParameters
// 0x0058 (0x0058 - 0x0000)
struct FJoinedSVGMeshParameters final
{
public:
	bool                                          bIsUnlit;                                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FSVGShapeParameters>              ShapesParameters;                                  // 0x0008(0x0050)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJoinedSVGMeshParameters;

// ScriptStruct SVGImporter.SVGBakeElement
// 0x0080 (0x0080 - 0x0000)
struct FSVGBakeElement final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(Edit, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0070(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSVGBakeElement;

// ScriptStruct SVGImporter.SVGFillShape
// 0x0018 (0x0018 - 0x0000)
struct FSVGFillShape final
{
public:
	TArray<struct FVector2D>                      ShapeVertices;                                     // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bShouldBeDrawn;                                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSVGFillShape;

// ScriptStruct SVGImporter.SVGFillMeshData
// 0x0010 (0x0010 - 0x0000)
struct FSVGFillMeshData final
{
public:
	TArray<struct FSVGFillShape>                  ShapesToDraw;                                      // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSVGFillMeshData;

// ScriptStruct SVGImporter.SVGStyle
// 0x0038 (0x0038 - 0x0000)
struct FSVGStyle final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasFill;                                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 FillColor;                                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasStroke;                                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 StrokeColor;                                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         StrokeWidth;                                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Display;                                           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FSVGStyle;

// ScriptStruct SVGImporter.SVGGradientStop
// 0x000C (0x000C - 0x0000)
struct FSVGGradientStop final
{
public:
	float                                         Offset;                                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StopOpacity;                                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 StopColor;                                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSVGGradientStop;

// ScriptStruct SVGImporter.SVGGradient
// 0x0048 (0x0048 - 0x0000)
struct FSVGGradient final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x28];                                      // 0x0010(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSVGGradientStop>               StopNodes;                                         // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSVGGradient;

// ScriptStruct SVGImporter.SVGPathPolygon
// 0x0038 (0x0038 - 0x0000)
struct FSVGPathPolygon final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      Vertices2D;                                        // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FVector>                        Vertices;                                          // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          bShouldBeDrawn;                                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSVGPathPolygon;

// ScriptStruct SVGImporter.SVGShape
// 0x0100 (0x0100 - 0x0000)
struct FSVGShape final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FSVGPathPolygon>                Polygons;                                          // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class USplineComponent*>               PolygonSplines;                                    // 0x0020(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	struct FSVGStyle                              Style;                                             // 0x0030(0x0038)(NativeAccessSpecifierPrivate)
	struct FSVGGradient                           FillGradient;                                      // 0x0068(0x0048)(NativeAccessSpecifierPrivate)
	struct FSVGGradient                           StrokeGradient;                                    // 0x00B0(0x0048)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSVGShape;

SDK_NAMESPACE_END
