#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Text3D

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Text3D_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function Text3D.Text3DCharacterBase.SetRelativeLocation
// 0x0018 (0x0018 - 0x0000)
struct Text3DCharacterBase_SetRelativeLocation final
{
public:
	struct FVector                                InLocation;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterBase_SetRelativeLocation;

// Function Text3D.Text3DCharacterBase.SetRelativeRotation
// 0x0018 (0x0018 - 0x0000)
struct Text3DCharacterBase_SetRelativeRotation final
{
public:
	struct FRotator                               InRotation;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterBase_SetRelativeRotation;

// Function Text3D.Text3DCharacterBase.SetRelativeScale
// 0x0018 (0x0018 - 0x0000)
struct Text3DCharacterBase_SetRelativeScale final
{
public:
	struct FVector                                InScale;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterBase_SetRelativeScale;

// Function Text3D.Text3DCharacterBase.SetVisibility
// 0x0001 (0x0001 - 0x0000)
struct Text3DCharacterBase_SetVisibility final
{
public:
	bool                                          bInVisibility;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterBase_SetVisibility;

// Function Text3D.Text3DCharacterTransform.SetLocationDistance
// 0x0018 (0x0018 - 0x0000)
struct Text3DCharacterTransform_SetLocationDistance final
{
public:
	struct FVector                                Distance;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetLocationDistance;

// Function Text3D.Text3DCharacterTransform.SetLocationEnabled
// 0x0001 (0x0001 - 0x0000)
struct Text3DCharacterTransform_SetLocationEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetLocationEnabled;

// Function Text3D.Text3DCharacterTransform.SetLocationOrder
// 0x0001 (0x0001 - 0x0000)
struct Text3DCharacterTransform_SetLocationOrder final
{
public:
	EText3DCharacterEffectOrder                   Order;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetLocationOrder;

// Function Text3D.Text3DCharacterTransform.SetLocationProgress
// 0x0004 (0x0004 - 0x0000)
struct Text3DCharacterTransform_SetLocationProgress final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetLocationProgress;

// Function Text3D.Text3DCharacterTransform.SetLocationRange
// 0x0004 (0x0004 - 0x0000)
struct Text3DCharacterTransform_SetLocationRange final
{
public:
	float                                         Range;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetLocationRange;

// Function Text3D.Text3DCharacterTransform.SetRotateBegin
// 0x0018 (0x0018 - 0x0000)
struct Text3DCharacterTransform_SetRotateBegin final
{
public:
	struct FRotator                               Value;                                             // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetRotateBegin;

// Function Text3D.Text3DCharacterTransform.SetRotateEnabled
// 0x0001 (0x0001 - 0x0000)
struct Text3DCharacterTransform_SetRotateEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetRotateEnabled;

// Function Text3D.Text3DCharacterTransform.SetRotateEnd
// 0x0018 (0x0018 - 0x0000)
struct Text3DCharacterTransform_SetRotateEnd final
{
public:
	struct FRotator                               Value;                                             // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetRotateEnd;

// Function Text3D.Text3DCharacterTransform.SetRotateOrder
// 0x0001 (0x0001 - 0x0000)
struct Text3DCharacterTransform_SetRotateOrder final
{
public:
	EText3DCharacterEffectOrder                   Order;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetRotateOrder;

// Function Text3D.Text3DCharacterTransform.SetRotateProgress
// 0x0004 (0x0004 - 0x0000)
struct Text3DCharacterTransform_SetRotateProgress final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetRotateProgress;

// Function Text3D.Text3DCharacterTransform.SetRotateRange
// 0x0004 (0x0004 - 0x0000)
struct Text3DCharacterTransform_SetRotateRange final
{
public:
	float                                         Range;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetRotateRange;

// Function Text3D.Text3DCharacterTransform.SetScaleBegin
// 0x0018 (0x0018 - 0x0000)
struct Text3DCharacterTransform_SetScaleBegin final
{
public:
	struct FVector                                Value;                                             // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetScaleBegin;

// Function Text3D.Text3DCharacterTransform.SetScaleEnabled
// 0x0001 (0x0001 - 0x0000)
struct Text3DCharacterTransform_SetScaleEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetScaleEnabled;

// Function Text3D.Text3DCharacterTransform.SetScaleEnd
// 0x0018 (0x0018 - 0x0000)
struct Text3DCharacterTransform_SetScaleEnd final
{
public:
	struct FVector                                Value;                                             // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetScaleEnd;

// Function Text3D.Text3DCharacterTransform.SetScaleOrder
// 0x0001 (0x0001 - 0x0000)
struct Text3DCharacterTransform_SetScaleOrder final
{
public:
	EText3DCharacterEffectOrder                   Order;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetScaleOrder;

// Function Text3D.Text3DCharacterTransform.SetScaleProgress
// 0x0004 (0x0004 - 0x0000)
struct Text3DCharacterTransform_SetScaleProgress final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetScaleProgress;

// Function Text3D.Text3DCharacterTransform.SetScaleRange
// 0x0004 (0x0004 - 0x0000)
struct Text3DCharacterTransform_SetScaleRange final
{
public:
	float                                         Range;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetScaleRange;

// Function Text3D.Text3DComponent.GetGeometryExtension
// 0x0010 (0x0010 - 0x0000)
struct Text3DComponent_GetGeometryExtension final
{
public:
	TSubclassOf<class UText3DGeometryExtensionBase> InExtensionClass;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UText3DGeometryExtensionBase*           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_GetGeometryExtension;

// Function Text3D.Text3DComponent.GetLayoutEffects
// 0x0018 (0x0018 - 0x0000)
struct Text3DComponent_GetLayoutEffects final
{
public:
	TSubclassOf<class UText3DLayoutEffectBase>    InEffectClass;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UText3DLayoutEffectBase*>        ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_GetLayoutEffects;

// Function Text3D.Text3DComponent.GetLayoutExtension
// 0x0010 (0x0010 - 0x0000)
struct Text3DComponent_GetLayoutExtension final
{
public:
	TSubclassOf<class UText3DLayoutExtensionBase> InExtensionClass;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UText3DLayoutExtensionBase*             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_GetLayoutExtension;

// Function Text3D.Text3DComponent.GetMaterialExtension
// 0x0010 (0x0010 - 0x0000)
struct Text3DComponent_GetMaterialExtension final
{
public:
	TSubclassOf<class UText3DMaterialExtensionBase> InExtensionClass;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UText3DMaterialExtensionBase*           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_GetMaterialExtension;

// Function Text3D.Text3DComponent.GetRenderingExtension
// 0x0010 (0x0010 - 0x0000)
struct Text3DComponent_GetRenderingExtension final
{
public:
	TSubclassOf<class UText3DRenderingExtensionBase> InExtensionClass;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UText3DRenderingExtensionBase*          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_GetRenderingExtension;

// Function Text3D.Text3DComponent.SetBackMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DComponent_SetBackMaterial final
{
public:
	class UMaterialInterface*                     Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetBackMaterial;

// Function Text3D.Text3DComponent.SetBevel
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetBevel final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetBevel;

// Function Text3D.Text3DComponent.SetBevelMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DComponent_SetBevelMaterial final
{
public:
	class UMaterialInterface*                     Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetBevelMaterial;

// Function Text3D.Text3DComponent.SetBevelSegments
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetBevelSegments final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetBevelSegments;

// Function Text3D.Text3DComponent.SetBevelType
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetBevelType final
{
public:
	EText3DBevelType                              Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetBevelType;

// Function Text3D.Text3DComponent.SetCastShadow
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetCastShadow final
{
public:
	bool                                          NewCastShadow;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetCastShadow;

// Function Text3D.Text3DComponent.SetEnforceUpperCase
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetEnforceUpperCase final
{
public:
	bool                                          bInEnforceUpperCase;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetEnforceUpperCase;

// Function Text3D.Text3DComponent.SetExtrude
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetExtrude final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetExtrude;

// Function Text3D.Text3DComponent.SetExtrudeMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DComponent_SetExtrudeMaterial final
{
public:
	class UMaterialInterface*                     Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetExtrudeMaterial;

// Function Text3D.Text3DComponent.SetFont
// 0x0008 (0x0008 - 0x0000)
struct Text3DComponent_SetFont final
{
public:
	class UFont*                                  InFont;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetFont;

// Function Text3D.Text3DComponent.SetFrontMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DComponent_SetFrontMaterial final
{
public:
	class UMaterialInterface*                     Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetFrontMaterial;

// Function Text3D.Text3DComponent.SetHasMaxHeight
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetHasMaxHeight final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetHasMaxHeight;

// Function Text3D.Text3DComponent.SetHasMaxWidth
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetHasMaxWidth final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetHasMaxWidth;

// Function Text3D.Text3DComponent.SetHasOutline
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetHasOutline final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetHasOutline;

// Function Text3D.Text3DComponent.SetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetHorizontalAlignment final
{
public:
	EText3DHorizontalTextAlignment                Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetHorizontalAlignment;

// Function Text3D.Text3DComponent.SetKerning
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetKerning final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetKerning;

// Function Text3D.Text3DComponent.SetLineSpacing
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetLineSpacing final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetLineSpacing;

// Function Text3D.Text3DComponent.SetMaxHeight
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetMaxHeight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetMaxHeight;

// Function Text3D.Text3DComponent.SetMaxWidth
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetMaxWidth final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetMaxWidth;

// Function Text3D.Text3DComponent.SetMaxWidthHandling
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetMaxWidthHandling final
{
public:
	EText3DMaxWidthHandling                       Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetMaxWidthHandling;

// Function Text3D.Text3DComponent.SetOutlineExpand
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetOutlineExpand final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetOutlineExpand;

// Function Text3D.Text3DComponent.SetScaleProportionally
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetScaleProportionally final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetScaleProportionally;

// Function Text3D.Text3DComponent.SetText
// 0x0010 (0x0010 - 0x0000)
struct Text3DComponent_SetText final
{
public:
	class FText                                   Value;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetText;

// Function Text3D.Text3DComponent.SetTextRendererClass
// 0x0008 (0x0008 - 0x0000)
struct Text3DComponent_SetTextRendererClass final
{
public:
	TSubclassOf<class UText3DRendererBase>        InClass;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetTextRendererClass;

// Function Text3D.Text3DComponent.SetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetVerticalAlignment final
{
public:
	EText3DVerticalTextAlignment                  Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetVerticalAlignment;

// Function Text3D.Text3DComponent.SetWordSpacing
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetWordSpacing final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetWordSpacing;

// Function Text3D.Text3DComponent.GetBounds
// 0x0030 (0x0030 - 0x0000)
struct Text3DComponent_GetBounds final
{
public:
	struct FVector                                Origin;                                            // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BoxExtent;                                         // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_GetBounds;

// Function Text3D.Text3DComponent.GetFormattedText
// 0x0010 (0x0010 - 0x0000)
struct Text3DComponent_GetFormattedText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_GetFormattedText;

// Function Text3D.Text3DComponent.GetTextRendererClass
// 0x0008 (0x0008 - 0x0000)
struct Text3DComponent_GetTextRendererClass final
{
public:
	TSubclassOf<class UText3DRendererBase>        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_GetTextRendererClass;

// Function Text3D.Text3DComponent.GetTypefaceNames
// 0x0010 (0x0010 - 0x0000)
struct Text3DComponent_GetTypefaceNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_GetTypefaceNames;

// Function Text3D.Text3DDefaultGeometryExtension.SetBevel
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultGeometryExtension_SetBevel final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultGeometryExtension_SetBevel;

// Function Text3D.Text3DDefaultGeometryExtension.SetBevelSegments
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultGeometryExtension_SetBevelSegments final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultGeometryExtension_SetBevelSegments;

// Function Text3D.Text3DDefaultGeometryExtension.SetBevelType
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultGeometryExtension_SetBevelType final
{
public:
	EText3DBevelType                              Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultGeometryExtension_SetBevelType;

// Function Text3D.Text3DDefaultGeometryExtension.SetExtrude
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultGeometryExtension_SetExtrude final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultGeometryExtension_SetExtrude;

// Function Text3D.Text3DDefaultGeometryExtension.SetOutline
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultGeometryExtension_SetOutline final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultGeometryExtension_SetOutline;

// Function Text3D.Text3DDefaultGeometryExtension.SetPivotHAlignment
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultGeometryExtension_SetPivotHAlignment final
{
public:
	EText3DHorizontalTextAlignment                InPivot;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultGeometryExtension_SetPivotHAlignment;

// Function Text3D.Text3DDefaultGeometryExtension.SetPivotVAlignment
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultGeometryExtension_SetPivotVAlignment final
{
public:
	EText3DVerticalTextAlignment                  InPivot;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultGeometryExtension_SetPivotVAlignment;

// Function Text3D.Text3DDefaultGeometryExtension.SetUseOutline
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultGeometryExtension_SetUseOutline final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultGeometryExtension_SetUseOutline;

// Function Text3D.Text3DDefaultGeometryExtension.GetBevel
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultGeometryExtension_GetBevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultGeometryExtension_GetBevel;

// Function Text3D.Text3DDefaultGeometryExtension.GetBevelSegments
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultGeometryExtension_GetBevelSegments final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultGeometryExtension_GetBevelSegments;

// Function Text3D.Text3DDefaultGeometryExtension.GetBevelType
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultGeometryExtension_GetBevelType final
{
public:
	EText3DBevelType                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultGeometryExtension_GetBevelType;

// Function Text3D.Text3DDefaultGeometryExtension.GetExtrude
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultGeometryExtension_GetExtrude final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultGeometryExtension_GetExtrude;

// Function Text3D.Text3DDefaultGeometryExtension.GetOutline
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultGeometryExtension_GetOutline final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultGeometryExtension_GetOutline;

// Function Text3D.Text3DDefaultGeometryExtension.GetUseOutline
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultGeometryExtension_GetUseOutline final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultGeometryExtension_GetUseOutline;

// Function Text3D.Text3DDefaultLayoutExtension.SetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultLayoutExtension_SetHorizontalAlignment final
{
public:
	EText3DHorizontalTextAlignment                Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_SetHorizontalAlignment;

// Function Text3D.Text3DDefaultLayoutExtension.SetLineSpacing
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultLayoutExtension_SetLineSpacing final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_SetLineSpacing;

// Function Text3D.Text3DDefaultLayoutExtension.SetMaxHeight
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultLayoutExtension_SetMaxHeight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_SetMaxHeight;

// Function Text3D.Text3DDefaultLayoutExtension.SetMaxWidth
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultLayoutExtension_SetMaxWidth final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_SetMaxWidth;

// Function Text3D.Text3DDefaultLayoutExtension.SetMaxWidthBehavior
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultLayoutExtension_SetMaxWidthBehavior final
{
public:
	EText3DMaxWidthHandling                       Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_SetMaxWidthBehavior;

// Function Text3D.Text3DDefaultLayoutExtension.SetScaleProportionally
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultLayoutExtension_SetScaleProportionally final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_SetScaleProportionally;

// Function Text3D.Text3DDefaultLayoutExtension.SetTracking
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultLayoutExtension_SetTracking final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_SetTracking;

// Function Text3D.Text3DDefaultLayoutExtension.SetUseMaxHeight
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultLayoutExtension_SetUseMaxHeight final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_SetUseMaxHeight;

// Function Text3D.Text3DDefaultLayoutExtension.SetUseMaxWidth
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultLayoutExtension_SetUseMaxWidth final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_SetUseMaxWidth;

// Function Text3D.Text3DDefaultLayoutExtension.SetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultLayoutExtension_SetVerticalAlignment final
{
public:
	EText3DVerticalTextAlignment                  Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_SetVerticalAlignment;

// Function Text3D.Text3DDefaultLayoutExtension.SetWordSpacing
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultLayoutExtension_SetWordSpacing final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_SetWordSpacing;

// Function Text3D.Text3DDefaultLayoutExtension.GetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultLayoutExtension_GetHorizontalAlignment final
{
public:
	EText3DHorizontalTextAlignment                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_GetHorizontalAlignment;

// Function Text3D.Text3DDefaultLayoutExtension.GetLineSpacing
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultLayoutExtension_GetLineSpacing final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_GetLineSpacing;

// Function Text3D.Text3DDefaultLayoutExtension.GetMaxHeight
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultLayoutExtension_GetMaxHeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_GetMaxHeight;

// Function Text3D.Text3DDefaultLayoutExtension.GetMaxWidth
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultLayoutExtension_GetMaxWidth final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_GetMaxWidth;

// Function Text3D.Text3DDefaultLayoutExtension.GetMaxWidthBehavior
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultLayoutExtension_GetMaxWidthBehavior final
{
public:
	EText3DMaxWidthHandling                       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_GetMaxWidthBehavior;

// Function Text3D.Text3DDefaultLayoutExtension.GetScalesProportionally
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultLayoutExtension_GetScalesProportionally final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_GetScalesProportionally;

// Function Text3D.Text3DDefaultLayoutExtension.GetTracking
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultLayoutExtension_GetTracking final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_GetTracking;

// Function Text3D.Text3DDefaultLayoutExtension.GetUseMaxHeight
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultLayoutExtension_GetUseMaxHeight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_GetUseMaxHeight;

// Function Text3D.Text3DDefaultLayoutExtension.GetUseMaxWidth
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultLayoutExtension_GetUseMaxWidth final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_GetUseMaxWidth;

// Function Text3D.Text3DDefaultLayoutExtension.GetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultLayoutExtension_GetVerticalAlignment final
{
public:
	EText3DVerticalTextAlignment                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_GetVerticalAlignment;

// Function Text3D.Text3DDefaultLayoutExtension.GetWordSpacing
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultLayoutExtension_GetWordSpacing final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultLayoutExtension_GetWordSpacing;

// Function Text3D.Text3DDefaultMaterialExtension.SetBackColor
// 0x0010 (0x0010 - 0x0000)
struct Text3DDefaultMaterialExtension_SetBackColor final
{
public:
	struct FLinearColor                           InColor;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetBackColor;

// Function Text3D.Text3DDefaultMaterialExtension.SetBackMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DDefaultMaterialExtension_SetBackMaterial final
{
public:
	class UMaterialInterface*                     InMaterial;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetBackMaterial;

// Function Text3D.Text3DDefaultMaterialExtension.SetBevelColor
// 0x0010 (0x0010 - 0x0000)
struct Text3DDefaultMaterialExtension_SetBevelColor final
{
public:
	struct FLinearColor                           InColor;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetBevelColor;

// Function Text3D.Text3DDefaultMaterialExtension.SetBevelMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DDefaultMaterialExtension_SetBevelMaterial final
{
public:
	class UMaterialInterface*                     InMaterial;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetBevelMaterial;

// Function Text3D.Text3DDefaultMaterialExtension.SetBlendMode
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultMaterialExtension_SetBlendMode final
{
public:
	EText3DMaterialBlendMode                      InBlendMode;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetBlendMode;

// Function Text3D.Text3DDefaultMaterialExtension.SetExtrudeColor
// 0x0010 (0x0010 - 0x0000)
struct Text3DDefaultMaterialExtension_SetExtrudeColor final
{
public:
	struct FLinearColor                           InColor;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetExtrudeColor;

// Function Text3D.Text3DDefaultMaterialExtension.SetExtrudeMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DDefaultMaterialExtension_SetExtrudeMaterial final
{
public:
	class UMaterialInterface*                     InMaterial;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetExtrudeMaterial;

// Function Text3D.Text3DDefaultMaterialExtension.SetFrontColor
// 0x0010 (0x0010 - 0x0000)
struct Text3DDefaultMaterialExtension_SetFrontColor final
{
public:
	struct FLinearColor                           InColor;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetFrontColor;

// Function Text3D.Text3DDefaultMaterialExtension.SetFrontMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DDefaultMaterialExtension_SetFrontMaterial final
{
public:
	class UMaterialInterface*                     InMaterial;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetFrontMaterial;

// Function Text3D.Text3DDefaultMaterialExtension.SetGradientColorA
// 0x0010 (0x0010 - 0x0000)
struct Text3DDefaultMaterialExtension_SetGradientColorA final
{
public:
	struct FLinearColor                           InColor;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetGradientColorA;

// Function Text3D.Text3DDefaultMaterialExtension.SetGradientColorB
// 0x0010 (0x0010 - 0x0000)
struct Text3DDefaultMaterialExtension_SetGradientColorB final
{
public:
	struct FLinearColor                           InColor;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetGradientColorB;

// Function Text3D.Text3DDefaultMaterialExtension.SetGradientOffset
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultMaterialExtension_SetGradientOffset final
{
public:
	float                                         InGradientOffset;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetGradientOffset;

// Function Text3D.Text3DDefaultMaterialExtension.SetGradientRotation
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultMaterialExtension_SetGradientRotation final
{
public:
	float                                         InGradientRotation;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetGradientRotation;

// Function Text3D.Text3DDefaultMaterialExtension.SetGradientSmoothness
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultMaterialExtension_SetGradientSmoothness final
{
public:
	float                                         InGradientSmoothness;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetGradientSmoothness;

// Function Text3D.Text3DDefaultMaterialExtension.SetIsUnlit
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultMaterialExtension_SetIsUnlit final
{
public:
	bool                                          bInIsUnlit;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetIsUnlit;

// Function Text3D.Text3DDefaultMaterialExtension.SetMaskOffset
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultMaterialExtension_SetMaskOffset final
{
public:
	float                                         InMaskOffset;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetMaskOffset;

// Function Text3D.Text3DDefaultMaterialExtension.SetMaskRotation
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultMaterialExtension_SetMaskRotation final
{
public:
	float                                         InMaskRotation;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetMaskRotation;

// Function Text3D.Text3DDefaultMaterialExtension.SetMaskSmoothness
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultMaterialExtension_SetMaskSmoothness final
{
public:
	float                                         InMaskSmoothness;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetMaskSmoothness;

// Function Text3D.Text3DDefaultMaterialExtension.SetOpacity
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultMaterialExtension_SetOpacity final
{
public:
	float                                         InOpacity;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetOpacity;

// Function Text3D.Text3DDefaultMaterialExtension.SetStyle
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultMaterialExtension_SetStyle final
{
public:
	EText3DMaterialStyle                          InStyle;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetStyle;

// Function Text3D.Text3DDefaultMaterialExtension.SetTextureAsset
// 0x0008 (0x0008 - 0x0000)
struct Text3DDefaultMaterialExtension_SetTextureAsset final
{
public:
	class UTexture2D*                             InTextureAsset;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetTextureAsset;

// Function Text3D.Text3DDefaultMaterialExtension.SetTextureTiling
// 0x0010 (0x0010 - 0x0000)
struct Text3DDefaultMaterialExtension_SetTextureTiling final
{
public:
	struct FVector2D                              InTextureTiling;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetTextureTiling;

// Function Text3D.Text3DDefaultMaterialExtension.SetUseMask
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultMaterialExtension_SetUseMask final
{
public:
	bool                                          bInUseMask;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetUseMask;

// Function Text3D.Text3DDefaultMaterialExtension.SetUseSingleMaterial
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultMaterialExtension_SetUseSingleMaterial final
{
public:
	bool                                          bInUse;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_SetUseSingleMaterial;

// Function Text3D.Text3DDefaultMaterialExtension.GetBackColor
// 0x0010 (0x0010 - 0x0000)
struct Text3DDefaultMaterialExtension_GetBackColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_GetBackColor;

// Function Text3D.Text3DDefaultMaterialExtension.GetBackMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DDefaultMaterialExtension_GetBackMaterial final
{
public:
	class UMaterialInterface*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_GetBackMaterial;

// Function Text3D.Text3DDefaultMaterialExtension.GetBevelColor
// 0x0010 (0x0010 - 0x0000)
struct Text3DDefaultMaterialExtension_GetBevelColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_GetBevelColor;

// Function Text3D.Text3DDefaultMaterialExtension.GetBevelMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DDefaultMaterialExtension_GetBevelMaterial final
{
public:
	class UMaterialInterface*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_GetBevelMaterial;

// Function Text3D.Text3DDefaultMaterialExtension.GetBlendMode
// 0x0001 (0x0001 - 0x0000)
struct Text3DDefaultMaterialExtension_GetBlendMode final
{
public:
	EText3DMaterialBlendMode                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_GetBlendMode;

// Function Text3D.Text3DDefaultMaterialExtension.GetExtrudeColor
// 0x0010 (0x0010 - 0x0000)
struct Text3DDefaultMaterialExtension_GetExtrudeColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_GetExtrudeColor;

// Function Text3D.Text3DDefaultMaterialExtension.GetExtrudeMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DDefaultMaterialExtension_GetExtrudeMaterial final
{
public:
	class UMaterialInterface*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_GetExtrudeMaterial;

// Function Text3D.Text3DDefaultMaterialExtension.GetFrontColor
// 0x0010 (0x0010 - 0x0000)
struct Text3DDefaultMaterialExtension_GetFrontColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_GetFrontColor;

// Function Text3D.Text3DDefaultMaterialExtension.GetFrontMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DDefaultMaterialExtension_GetFrontMaterial final
{
public:
	class UMaterialInterface*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_GetFrontMaterial;

// Function Text3D.Text3DDefaultMaterialExtension.GetGradientColorA
// 0x0010 (0x0010 - 0x0000)
struct Text3DDefaultMaterialExtension_GetGradientColorA final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_GetGradientColorA;

// Function Text3D.Text3DDefaultMaterialExtension.GetGradientColorB
// 0x0010 (0x0010 - 0x0000)
struct Text3DDefaultMaterialExtension_GetGradientColorB final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_GetGradientColorB;

// Function Text3D.Text3DDefaultMaterialExtension.GetGradientOffset
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultMaterialExtension_GetGradientOffset final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_GetGradientOffset;

// Function Text3D.Text3DDefaultMaterialExtension.GetGradientRotation
// 0x0004 (0x0004 - 0x0000)
struct Text3DDefaultMaterialExtension_GetGradientRotation final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DDefaultMaterialExtension_GetGradientRotation;

