#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Text3D

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// Enum Text3D.EText3DBevelType
// NumValues: 0x0008
enum class EText3DBevelType : uint8
{
	Linear                                   = 0,
	HalfCircle                               = 1,
	Convex                                   = 2,
	Concave                                  = 3,
	OneStep                                  = 4,
	TwoSteps                                 = 5,
	Engraved                                 = 6,
	EText3DBevelType_MAX                     = 7,
};

// Enum Text3D.EText3DHorizontalTextAlignment
// NumValues: 0x0004
enum class EText3DHorizontalTextAlignment : uint8
{
	Left                                     = 0,
	Center                                   = 1,
	Right                                    = 2,
	EText3DHorizontalTextAlignment_MAX       = 3,
};

// Enum Text3D.EText3DMaxWidthHandling
// NumValues: 0x0003
enum class EText3DMaxWidthHandling : uint8
{
	Scale                                    = 0,
	WrapAndScale                             = 1,
	EText3DMaxWidthHandling_MAX              = 2,
};

// Enum Text3D.EText3DVerticalTextAlignment
// NumValues: 0x0005
enum class EText3DVerticalTextAlignment : uint8
{
	FirstLine                                = 0,
	Top                                      = 1,
	Center                                   = 2,
	Bottom                                   = 3,
	EText3DVerticalTextAlignment_MAX         = 4,
};

// Enum Text3D.EText3DMaterialStyle
// NumValues: 0x0006
enum class EText3DMaterialStyle : uint8
{
	Invalid                                  = 0,
	Solid                                    = 1,
	Gradient                                 = 2,
	Texture                                  = 3,
	Custom                                   = 4,
	EText3DMaterialStyle_MAX                 = 5,
};

// Enum Text3D.EText3DMaterialBlendMode
// NumValues: 0x0004
enum class EText3DMaterialBlendMode : uint8
{
	Invalid                                  = 0,
	Opaque                                   = 1,
	Translucent                              = 2,
	EText3DMaterialBlendMode_MAX             = 3,
};

// Enum Text3D.EText3DFontStyleFlags
// NumValues: 0x0005
enum class EText3DFontStyleFlags : uint8
{
	None                                     = 0,
	Monospace                                = 1,
	Bold                                     = 2,
	Italic                                   = 4,
	EText3DFontStyleFlags_MAX                = 5,
};

// Enum Text3D.EText3DCharacterEffectOrder
// NumValues: 0x0005
enum class EText3DCharacterEffectOrder : uint8
{
	Normal                                   = 0,
	FromCenter                               = 1,
	ToCenter                                 = 2,
	Opposite                                 = 3,
	EText3DCharacterEffectOrder_MAX          = 4,
};

// ScriptStruct Text3D.GlyphMeshParameters
// 0x0038 (0x0038 - 0x0000)
struct FGlyphMeshParameters final
{
public:
	float                                         Extrude;                                           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Bevel;                                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EText3DBevelType                              BevelType;                                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BevelSegments;                                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutline;                                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OutlineExpand;                                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        TypefaceIndex;                                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PivotOffset;                                       // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGlyphMeshParameters;

// ScriptStruct Text3D.Text3DCachedMesh
// 0x0058 (0x0058 - 0x0000)
struct FText3DCachedMesh final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FBox                                   MeshBounds;                                        // 0x0008(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MeshOffset;                                        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FText3DCachedMesh;

// ScriptStruct Text3D.CachedFontMeshes
// 0x0060 (0x0060 - 0x0000)
struct FCachedFontMeshes final
{
public:
	TMap<uint32, struct FText3DCachedMesh>        Glyphs;                                            // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCachedFontMeshes;

// ScriptStruct Text3D.TypefaceFontData
// 0x0088 (0x0088 - 0x0000)
struct FTypefaceFontData final
{
public:
	TMap<uint32, struct FCachedFontMeshes>        Meshes;                                            // 0x0000(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0x38];                                      // 0x0050(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTypefaceFontData;

// ScriptStruct Text3D.CachedFontData
// 0x0058 (0x0058 - 0x0000)
struct FCachedFontData final
{
public:
	class UFont*                                  Font;                                              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	TMap<uint32, struct FTypefaceFontData>        TypefaceFontDataMap;                               // 0x0008(0x0050)(NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FCachedFontData;

// ScriptStruct Text3D.Text3DMaterialKey
// 0x0002 (0x0002 - 0x0000)
struct FText3DMaterialKey final
{
public:
	EText3DMaterialBlendMode                      BlendMode;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUnlit;                                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FText3DMaterialKey;

// ScriptStruct Text3D.Text3DMaterialGroupKey
// 0x0004 (0x0004 - 0x0000)
struct FText3DMaterialGroupKey final
{
public:
	struct FText3DMaterialKey                     Key;                                               // 0x0000(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x1];                                        // 0x0002(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EText3DMaterialStyle                          Style;                                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FText3DMaterialGroupKey;

SDK_NAMESPACE_END
