#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayCameras_structs.hpp"


SDK_NAMESPACE_START

// PropertyBag Transient.PropertyBag_f4b5107a745239f4
// 0x0060 (0x0060 - 0x0000)
struct FPropertyBag_f4b5107a745239f4 final
{
public:
	struct FVector3dCameraParameter               Location;                                          // 0x0000(0x0028)(Edit, NoDestructor)
	struct FRotator3dCameraParameter              Rotation;                                          // 0x0028(0x0028)(Edit, NoDestructor)
	struct FFloatCameraParameter                  TargetArmLength;                                   // 0x0050(0x0010)(Edit, NoDestructor)
};
DUMPER7_ASSERTS_FPropertyBag_f4b5107a745239f4;

// PropertyBag Transient.PropertyBag_ae267b1d5e677685
// 0x0070 (0x0070 - 0x0000)
struct FPropertyBag_ae267b1d5e677685 final
{
public:
	struct FVector3dCameraParameter               Location;                                          // 0x0000(0x0028)(Edit, NoDestructor)
	struct FRotator3dCameraParameter              Rotation;                                          // 0x0028(0x0028)(Edit, NoDestructor)
	struct FFloatCameraParameter                  TargetArmLength;                                   // 0x0050(0x0010)(Edit, NoDestructor)
	struct FFloatCameraParameter                  FieldOfView;                                       // 0x0060(0x0010)(Edit, NoDestructor)
};
DUMPER7_ASSERTS_FPropertyBag_ae267b1d5e677685;

// PropertyBag Transient.PropertyBag_0
// 0x0000 (0x0000 - 0x0000)
struct FPropertyBag_0 final
{
};
DUMPER7_ASSERTS_FPropertyBag_0;

// PropertyBag Transient.PropertyBag_bda5bfe32da40c11
// 0x0098 (0x0098 - 0x0000)
struct FPropertyBag_bda5bfe32da40c11 final
{
public:
	struct FFloatCameraParameter                  ForwardDampingFactor;                              // 0x0000(0x0010)(Edit, NoDestructor)
	struct FFloatCameraParameter                  LateralDampingFactor;                              // 0x0010(0x0010)(Edit, NoDestructor)
	struct FFloatCameraParameter                  VerticalDampingFactor;                             // 0x0020(0x0010)(Edit, NoDestructor)
	struct FFloatCameraParameter                  FieldOfView;                                       // 0x0030(0x0010)(Edit, NoDestructor)
	struct FRotator3dCameraParameter              Rotation;                                          // 0x0040(0x0028)(Edit, NoDestructor)
	struct FFloatCameraParameter                  TargetArmLength;                                   // 0x0068(0x0010)(Edit, NoDestructor)
	struct FCameraActorAttachmentInfo             Attachment;                                        // 0x0078(0x0020)(Edit, NoDestructor)
};
DUMPER7_ASSERTS_FPropertyBag_bda5bfe32da40c11;

// ScriptStruct Transient.ChaosDestructionEvent_SWC
// 0x0044 (0x0044 - 0x0000)
struct FChaosDestructionEvent_SWC final
{
public:
	struct FVector3f                              Position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Velocity;                                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              AngularVelocity;                                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtentMin;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentMax;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticleID;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChaosDestructionEvent_SWC;

// PropertyBag Transient.PropertyBag_d91c839127a8a123
// 0x0040 (0x0040 - 0x0000)
struct FPropertyBag_d91c839127a8a123 final
{
public:
	struct FFloatCameraParameter                  FieldOfView;                                       // 0x0000(0x0010)(Edit, NoDestructor)
	struct FFloatCameraParameter                  YawDampingFactor;                                  // 0x0010(0x0010)(Edit, NoDestructor)
	struct FFloatCameraParameter                  PitchDampingFactor;                                // 0x0020(0x0010)(Edit, NoDestructor)
	struct FFloatCameraParameter                  RollDampingFactor;                                 // 0x0030(0x0010)(Edit, NoDestructor)
};
DUMPER7_ASSERTS_FPropertyBag_d91c839127a8a123;

// PropertyBag Transient.PropertyBag_c13d61325ee51f90
// 0x0010 (0x0010 - 0x0000)
struct FPropertyBag_c13d61325ee51f90 final
{
public:
	struct FFloatCameraParameter                  FieldOfView;                                       // 0x0000(0x0010)(Edit, NoDestructor)
};
DUMPER7_ASSERTS_FPropertyBag_c13d61325ee51f90;

// PropertyBag Transient.PropertyBag_95f232480993a18
// 0x0050 (0x0050 - 0x0000)
struct FPropertyBag_95f232480993a18 final
{
public:
	struct FVector3dCameraParameter               Location;                                          // 0x0000(0x0028)(Edit, NoDestructor)
	struct FRotator3dCameraParameter              Rotation;                                          // 0x0028(0x0028)(Edit, NoDestructor)
};
DUMPER7_ASSERTS_FPropertyBag_95f232480993a18;

// PropertyBag Transient.PropertyBag_60b362f1cb0d65ad
// 0x0060 (0x0060 - 0x0000)
struct FPropertyBag_60b362f1cb0d65ad final
{
public:
	struct FVector3dCameraParameter               Location;                                          // 0x0000(0x0028)(Edit, NoDestructor)
	struct FRotator3dCameraParameter              Rotation;                                          // 0x0028(0x0028)(Edit, NoDestructor)
	struct FFloatCameraParameter                  TargetArmLength;                                   // 0x0050(0x0010)(Edit, NoDestructor)
};
DUMPER7_ASSERTS_FPropertyBag_60b362f1cb0d65ad;

// PropertyBag Transient.PropertyBag_f105b1add99edcfb
// 0x0078 (0x0078 - 0x0000)
struct FPropertyBag_f105b1add99edcfb final
{
public:
	struct FFloatCameraParameter                  ForwardDampingFactor;                              // 0x0000(0x0010)(Edit, NoDestructor)
	struct FFloatCameraParameter                  LateralDampingFactor;                              // 0x0010(0x0010)(Edit, NoDestructor)
	struct FFloatCameraParameter                  VerticalDampingFactor;                             // 0x0020(0x0010)(Edit, NoDestructor)
	struct FVector3dCameraParameter               AdditionalOffset;                                  // 0x0030(0x0028)(Edit, NoDestructor)
	struct FCameraActorAttachmentInfo             Attachment;                                        // 0x0058(0x0020)(Edit, NoDestructor)
};
DUMPER7_ASSERTS_FPropertyBag_f105b1add99edcfb;

// PropertyBag Transient.PropertyBag_2de5589f7c10baf5
// 0x0190 (0x0190 - 0x0000)
struct FPropertyBag_2de5589f7c10baf5 final
{
public:
	struct FFloatCameraParameter                  ForwardDampingFactor;                              // 0x0000(0x0010)(Edit, NoDestructor)
	struct FFloatCameraParameter                  LateralDampingFactor;                              // 0x0010(0x0010)(Edit, NoDestructor)
	struct FFloatCameraParameter                  VerticalDampingFactor;                             // 0x0020(0x0010)(Edit, NoDestructor)
	struct FVector3dCameraParameter               AdditionalOffset;                                  // 0x0030(0x0028)(Edit, NoDestructor)
	struct FCameraActorAttachmentInfo             CR_ThirdPersonCameraAttach_Attachment;             // 0x0058(0x0020)(Edit, NoDestructor)
	struct FFloatCameraParameter                  CR_SniperCamera_FieldOfView;                       // 0x0078(0x0010)(Edit, NoDestructor)
	struct FFloatCameraParameter                  TargetArmLength;                                   // 0x0088(0x0010)(Edit, NoDestructor)
	struct FVector3dCameraParameter               OverheadOffset;                                    // 0x0098(0x0028)(Edit, NoDestructor)
	struct FFloatCameraParameter                  CR_ThirdPersonCamera_FieldOfView;                  // 0x00C0(0x0010)(Edit, NoDestructor)
	struct FCameraActorAttachmentInfo             CR_ThirdPersonCamera_Attachment;                   // 0x00D0(0x0020)(Edit, NoDestructor)
	struct FVector3dCameraParameter               Location;                                          // 0x00F0(0x0028)(Edit, NoDestructor)
	struct FRotator3dCameraParameter              Rotation;                                          // 0x0118(0x0028)(Edit, NoDestructor)
	struct FFloatCameraParameter                  CR_IntroSequenceCamera_FieldOfView;                // 0x0140(0x0010)(Edit, NoDestructor)
	struct FFloatCameraParameter                  CR_FreeCamera_FieldOfView;                         // 0x0150(0x0010)(Edit, NoDestructor)
	struct FFloatCameraParameter                  YawDampingFactor;                                  // 0x0160(0x0010)(Edit, NoDestructor)
	struct FFloatCameraParameter                  PitchDampingFactor;                                // 0x0170(0x0010)(Edit, NoDestructor)
	struct FFloatCameraParameter                  RollDampingFactor;                                 // 0x0180(0x0010)(Edit, NoDestructor)
};
DUMPER7_ASSERTS_FPropertyBag_2de5589f7c10baf5;

// PropertyBag Transient.PropertyBag_d8ee9927dceda2d
// 0x0140 (0x0140 - 0x0000)
struct FPropertyBag_d8ee9927dceda2d final
{
public:
	struct FFloatCameraParameter                  ForwardDampingFactor;                              // 0x0000(0x0010)(Edit, NoDestructor)
	struct FFloatCameraParameter                  LateralDampingFactor;                              // 0x0010(0x0010)(Edit, NoDestructor)
	struct FFloatCameraParameter                  VerticalDampingFactor;                             // 0x0020(0x0010)(Edit, NoDestructor)
	struct FVector3dCameraParameter               AdditionalOffset;                                  // 0x0030(0x0028)(Edit, NoDestructor)
	struct FCameraActorAttachmentInfo             CR_ThirdPersonCameraAttach_Attachment;             // 0x0058(0x0020)(Edit, NoDestructor)
	struct FFloatCameraParameter                  CR_SniperCamera_FieldOfView;                       // 0x0078(0x0010)(Edit, NoDestructor)
	struct FFloatCameraParameter                  TargetArmLength;                                   // 0x0088(0x0010)(Edit, NoDestructor)
	struct FVector3dCameraParameter               OverheadOffset;                                    // 0x0098(0x0028)(Edit, NoDestructor)
	struct FFloatCameraParameter                  CR_ThirdPersonCamera_FieldOfView;                  // 0x00C0(0x0010)(Edit, NoDestructor)
	struct FCameraActorAttachmentInfo             CR_ThirdPersonCamera_Attachment;                   // 0x00D0(0x0020)(Edit, NoDestructor)
	struct FVector3dCameraParameter               Location;                                          // 0x00F0(0x0028)(Edit, NoDestructor)
	struct FRotator3dCameraParameter              Rotation;                                          // 0x0118(0x0028)(Edit, NoDestructor)
};
DUMPER7_ASSERTS_FPropertyBag_d8ee9927dceda2d;

// PropertyBag Transient.PropertyBag_6b67369452e9e6c6
// 0x0038 (0x0038 - 0x0000)
struct FPropertyBag_6b67369452e9e6c6 final
{
public:
	struct FInteger32CameraParameter              CameraZoom;                                        // 0x0000(0x0010)(Edit, NoDestructor)
	struct FVector3dCameraParameter               BoomOffset;                                        // 0x0010(0x0028)(Edit, NoDestructor)
};
DUMPER7_ASSERTS_FPropertyBag_6b67369452e9e6c6;

// PropertyBag Transient.PropertyBag_34625a35411e3692
// 0x0068 (0x0068 - 0x0000)
struct FPropertyBag_34625a35411e3692 final
{
public:
	struct FFloatCameraParameter                  TargetArmLength;                                   // 0x0000(0x0010)(Edit, NoDestructor)
	struct FVector3dCameraParameter               OverheadOffset;                                    // 0x0010(0x0028)(Edit, NoDestructor)
	struct FFloatCameraParameter                  FieldOfView;                                       // 0x0038(0x0010)(Edit, NoDestructor)
	struct FCameraActorAttachmentInfo             Attachment;                                        // 0x0048(0x0020)(Edit, NoDestructor)
};
DUMPER7_ASSERTS_FPropertyBag_34625a35411e3692;

// PropertyBag Transient.PropertyBag_10f691c8226a20a3
// 0x0010 (0x0010 - 0x0000)
struct FPropertyBag_10f691c8226a20a3 final
{
public:
	struct FFloatCameraParameter                  FieldOfView;                                       // 0x0000(0x0010)(Edit, NoDestructor)
};
DUMPER7_ASSERTS_FPropertyBag_10f691c8226a20a3;

SDK_NAMESPACE_END
