#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tyr

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "TyrSharedTypes_structs.hpp"
#include "Tyr_structs.hpp"
#include "UMG_structs.hpp"
#include "Agones_structs.hpp"
#include "PsRealVehiclePlugin_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "GameplayCameras_structs.hpp"
#include "DataRegistry_structs.hpp"
#include "NetCore_structs.hpp"
#include "DiscordPartnerSDK_structs.hpp"
#include "InputCore_structs.hpp"
#include "AIModule_structs.hpp"
#include "AudioMixer_structs.hpp"
#include "GameplayMessageRuntime_structs.hpp"
#include "StateTreeModule_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function Tyr.TyrActivatableWidget.ExecuteWhenActivated
// 0x0010 (0x0010 - 0x0000)
struct TyrActivatableWidget_ExecuteWhenActivated final
{
public:
	TDelegate<void()>                             InDelegate;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrActivatableWidget_ExecuteWhenActivated;

// Function Tyr.TyrActivatableWidget.ExecuteWhenDeactivated
// 0x0010 (0x0010 - 0x0000)
struct TyrActivatableWidget_ExecuteWhenDeactivated final
{
public:
	TDelegate<void()>                             InDelegate;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrActivatableWidget_ExecuteWhenDeactivated;

// Function Tyr.TyrActivatableWidget.HandleInputAction
// 0x0018 (0x0018 - 0x0000)
struct TyrActivatableWidget_HandleInputAction final
{
public:
	struct FTyrInputActionRowHandle               ActionHandle;                                      // 0x0000(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrActivatableWidget_HandleInputAction;

// Function Tyr.TyrActivatableWidget.K2_OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct TyrActivatableWidget_K2_OnInputMethodChanged final
{
public:
	ECommonInputType                              CommonInput;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrActivatableWidget_K2_OnInputMethodChanged;

// Function Tyr.TyrActivatableWidget.OnActionButtonAdded
// 0x0010 (0x0010 - 0x0000)
struct TyrActivatableWidget_OnActionButtonAdded final
{
public:
	class UTyrBoundActionButton*                  ActionButton;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InputAction;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrActivatableWidget_OnActionButtonAdded;

// Function Tyr.TyrActivatableWidget.OnActionButtonRemoved
// 0x0010 (0x0010 - 0x0000)
struct TyrActivatableWidget_OnActionButtonRemoved final
{
public:
	class UTyrBoundActionButton*                  ActionButton;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InputAction;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrActivatableWidget_OnActionButtonRemoved;

// Function Tyr.TyrActivatableWidget.OverrideActionDomain
// 0x0008 (0x0008 - 0x0000)
struct TyrActivatableWidget_OverrideActionDomain final
{
public:
	class UCommonInputActionDomain*               ActionDomain;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrActivatableWidget_OverrideActionDomain;

// Function Tyr.TyrActivatableWidget.SetBackActionLabel
// 0x0010 (0x0010 - 0x0000)
struct TyrActivatableWidget_SetBackActionLabel final
{
public:
	class FText                                   Label;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrActivatableWidget_SetBackActionLabel;

// Function Tyr.TyrActivatableWidget.SetInputActionBreadcrumb
// 0x0020 (0x0020 - 0x0000)
struct TyrActivatableWidget_SetInputActionBreadcrumb final
{
public:
	struct FTyrInputActionBreadcrumbParam         BreadcrumbInfo;                                    // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrActivatableWidget_SetInputActionBreadcrumb;

// Function Tyr.TyrActivatableWidget.SetInputActionEnabled
// 0x0020 (0x0020 - 0x0000)
struct TyrActivatableWidget_SetInputActionEnabled final
{
public:
	struct FTyrInputActionEnableParam             EnableInfo;                                        // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrActivatableWidget_SetInputActionEnabled;

// Function Tyr.TyrActivatableWidget.SetInputActionLabel
// 0x0028 (0x0028 - 0x0000)
struct TyrActivatableWidget_SetInputActionLabel final
{
public:
	struct FTyrInputActionLabelParam              LabelInfo;                                         // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrActivatableWidget_SetInputActionLabel;

// Function Tyr.TyrActivatableWidget.SetListeningForInputAction
// 0x0020 (0x0020 - 0x0000)
struct TyrActivatableWidget_SetListeningForInputAction final
{
public:
	struct FTyrInputActionListenParam             ListenInfo;                                        // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrActivatableWidget_SetListeningForInputAction;

// Function Tyr.TyrActivatableWidget.GetInputActionNames
// 0x0010 (0x0010 - 0x0000)
struct TyrActivatableWidget_GetInputActionNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrActivatableWidget_GetInputActionNames;

// Function Tyr.TyrActivatableWidget.ToInputActionBreadcrumbParam
// 0x0030 (0x0030 - 0x0000)
struct TyrActivatableWidget_ToInputActionBreadcrumbParam final
{
public:
	struct FGameplayTag                           CategoryBreadcrumb;                                // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ActionName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTyrInputActionBreadcrumbParam         ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrActivatableWidget_ToInputActionBreadcrumbParam;

// Function Tyr.TyrActivatableWidget.ToInputActionEnableParam
// 0x0030 (0x0030 - 0x0000)
struct TyrActivatableWidget_ToInputActionEnableParam final
{
public:
	bool                                          bShouldEnable;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActionName;                                        // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrInputActionEnableParam             ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrActivatableWidget_ToInputActionEnableParam;

// Function Tyr.TyrActivatableWidget.ToInputActionLabelParam
// 0x0040 (0x0040 - 0x0000)
struct TyrActivatableWidget_ToInputActionLabelParam final
{
public:
	class FText                                   Label;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ActionName;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTyrInputActionLabelParam              ReturnValue;                                       // 0x0018(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrActivatableWidget_ToInputActionLabelParam;

// Function Tyr.TyrActivatableWidget.ToInputActionListenParam
// 0x0030 (0x0030 - 0x0000)
struct TyrActivatableWidget_ToInputActionListenParam final
{
public:
	bool                                          bShouldListen;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActionName;                                        // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrInputActionListenParam             ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrActivatableWidget_ToInputActionListenParam;

// Function Tyr.TyrContextMenuWidget.AddOption
// 0x0028 (0x0028 - 0x0000)
struct TyrContextMenuWidget_AddOption final
{
public:
	class FText                                   Label;                                             // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	class UTexture2D*                             Icon;                                              // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnClicked;                                         // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrContextMenuWidget_AddOption;

// Function Tyr.TyrContextMenuWidget.SetTitle
// 0x0010 (0x0010 - 0x0000)
struct TyrContextMenuWidget_SetTitle final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrContextMenuWidget_SetTitle;

// Function Tyr.AsyncAction_ObserveTeam.ObserveTeam
// 0x0010 (0x0010 - 0x0000)
struct AsyncAction_ObserveTeam_ObserveTeam final
{
public:
	class UObject*                                TeamAgent;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncAction_ObserveTeam*               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncAction_ObserveTeam_ObserveTeam;

// Function Tyr.AsyncAction_ObserveTeam.OnWatchedAgentChangedTeam
// 0x0010 (0x0010 - 0x0000)
struct AsyncAction_ObserveTeam_OnWatchedAgentChangedTeam final
{
public:
	class UObject*                                TeamAgent;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OldTeam;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewTeam;                                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncAction_ObserveTeam_OnWatchedAgentChangedTeam;

// Function Tyr.AsyncTaskAttributeChanged.ListenForAttributeChange
// 0x0048 (0x0048 - 0x0000)
struct AsyncTaskAttributeChanged_ListenForAttributeChange final
{
public:
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAttribute                     Attribute;                                         // 0x0008(0x0038)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncTaskAttributeChanged*             ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncTaskAttributeChanged_ListenForAttributeChange;

// Function Tyr.AsyncTaskAttributeChanged.ListenForAttributesChange
// 0x0020 (0x0020 - 0x0000)
struct AsyncTaskAttributeChanged_ListenForAttributesChange final
{
public:
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameplayAttribute>             Attributes;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAsyncTaskAttributeChanged*             ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncTaskAttributeChanged_ListenForAttributesChange;

// Function Tyr.AsyncTaskCooldownChanged.ListenForCooldownChange
// 0x0038 (0x0038 - 0x0000)
struct AsyncTaskCooldownChanged_ListenForCooldownChange final
{
public:
	class UTyrAbilitySystemComponent*             AbilitySystemComponent;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  InCooldownTags;                                    // 0x0008(0x0020)(Parm, NativeAccessSpecifierPublic)
	bool                                          InUseServerCooldown;                               // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InPredictedServerCooldown;                         // 0x0029(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncTaskCooldownChanged*              ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncTaskCooldownChanged_ListenForCooldownChange;

// Function Tyr.AsyncTaskCooldownChanged.OnCooldownChange
// 0x0028 (0x0028 - 0x0000)
struct AsyncTaskCooldownChanged_OnCooldownChange final
{
public:
	struct FGameplayTag                           CooldownTag;                                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCooldownInfo                          CooldownInfo;                                      // 0x0008(0x0020)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncTaskCooldownChanged_OnCooldownChange;

// Function Tyr.AsyncTaskGameplayTagAddedRemoved.ListenForGameplayTagAddedOrRemoved
// 0x0030 (0x0030 - 0x0000)
struct AsyncTaskGameplayTagAddedRemoved_ListenForGameplayTagAddedOrRemoved final
{
public:
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  Tags;                                              // 0x0008(0x0020)(Parm, NativeAccessSpecifierPublic)
	class UAsyncTaskGameplayTagAddedRemoved*      ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncTaskGameplayTagAddedRemoved_ListenForGameplayTagAddedOrRemoved;

// Function Tyr.FoliageActorRenderUpdater.UpdateMeshRenderForSniperMode
// 0x0001 (0x0001 - 0x0000)
struct FoliageActorRenderUpdater_UpdateMeshRenderForSniperMode final
{
public:
	bool                                          bSniperModeActive;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FoliageActorRenderUpdater_UpdateMeshRenderForSniperMode;

// Function Tyr.TyrAbilityAvatarActorInterface.GetAnimatedMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct TyrAbilityAvatarActorInterface_GetAnimatedMeshComponent final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilityAvatarActorInterface_GetAnimatedMeshComponent;

// Function Tyr.TyrAbilityComponentInterface.InitializeAbilitySystem
// 0x0008 (0x0008 - 0x0000)
struct TyrAbilityComponentInterface_InitializeAbilitySystem final
{
public:
	class UAbilitySystemComponent*                AbilitySystem;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilityComponentInterface_InitializeAbilitySystem;

// Function Tyr.TyrAbilityComponentInterface.PostPlayerStateInitializeAbilitySystem
// 0x0008 (0x0008 - 0x0000)
struct TyrAbilityComponentInterface_PostPlayerStateInitializeAbilitySystem final
{
public:
	class UAbilitySystemComponent*                AbilitySystem;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilityComponentInterface_PostPlayerStateInitializeAbilitySystem;

// Function Tyr.TyrDataRegistryFunctionLibrary.GetAllCachedColumnsAsString
// 0x0030 (0x0030 - 0x0000)
struct TyrDataRegistryFunctionLibrary_GetAllCachedColumnsAsString final
{
public:
	struct FDataRegistryType                      RegistryType;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           WantedRows;                                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrDataRegistryFunctionLibrary_GetAllCachedColumnsAsString;

// Function Tyr.TyrDataRegistryFunctionLibrary.GetAllCachedItemNames
// 0x0018 (0x0018 - 0x0000)
struct TyrDataRegistryFunctionLibrary_GetAllCachedItemNames final
{
public:
	struct FDataRegistryType                      RegistryType;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrDataRegistryFunctionLibrary_GetAllCachedItemNames;

// Function Tyr.TyrAbilityFunctionLibrary.CalculateBlinkAbilityTargetLocation
// 0x00E0 (0x00E0 - 0x0000)
struct TyrAbilityFunctionLibrary_CalculateBlinkAbilityTargetLocation final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlinkTargetingData                    TargetingData;                                     // 0x0008(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTransform                             OutTransform;                                      // 0x0070(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00D0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0xF];                                       // 0x00D1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TyrAbilityFunctionLibrary_CalculateBlinkAbilityTargetLocation;

// Function Tyr.TyrAbilityFunctionLibrary.CalculateValidRecallTeleportSpot
// 0x0160 (0x0160 - 0x0000)
struct TyrAbilityFunctionLibrary_CalculateValidRecallTeleportSpot final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRecallTargetingData                   TargetingData;                                     // 0x0010(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTransform                             OutTransform;                                      // 0x00F0(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0150(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0xF];                                      // 0x0151(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TyrAbilityFunctionLibrary_CalculateValidRecallTeleportSpot;

// Function Tyr.TyrAbilityFunctionLibrary.K2_FindTeleportSpot
// 0x0058 (0x0058 - 0x0000)
struct TyrAbilityFunctionLibrary_K2_FindTeleportSpot final
{
public:
	const class AActor*                           TestActor;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TestLocation;                                      // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               TestRotation;                                      // 0x0020(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                OutLocation;                                       // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TyrAbilityFunctionLibrary_K2_FindTeleportSpot;

// Function Tyr.TyrAbilityFunctionLibrary.K2_GetStableNavigationData
// 0x0010 (0x0010 - 0x0000)
struct TyrAbilityFunctionLibrary_K2_GetStableNavigationData final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ANavigationData*                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilityFunctionLibrary_K2_GetStableNavigationData;

// Function Tyr.TyrAbilityFunctionLibrary.K2_GetUnstableNavigationData
// 0x0010 (0x0010 - 0x0000)
struct TyrAbilityFunctionLibrary_K2_GetUnstableNavigationData final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ANavigationData*                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilityFunctionLibrary_K2_GetUnstableNavigationData;

// Function Tyr.TyrAbilityResourceComponent.FindAbilityResourceComponent
// 0x0010 (0x0010 - 0x0000)
struct TyrAbilityResourceComponent_FindAbilityResourceComponent final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTyrAbilityResourceComponent*           ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilityResourceComponent_FindAbilityResourceComponent;

// Function Tyr.TyrAbilityResourceComponent.InitializeAbilitySystem_Implementation
// 0x0008 (0x0008 - 0x0000)
struct TyrAbilityResourceComponent_InitializeAbilitySystem_Implementation final
{
public:
	class UAbilitySystemComponent*                InASC;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilityResourceComponent_InitializeAbilitySystem_Implementation;

// Function Tyr.TyrAbilityResourceComponent.GetAbilityResource
// 0x0004 (0x0004 - 0x0000)
struct TyrAbilityResourceComponent_GetAbilityResource final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilityResourceComponent_GetAbilityResource;

// Function Tyr.TyrAbilityResourceComponent.GetDamageBlockedModifier
// 0x0004 (0x0004 - 0x0000)
struct TyrAbilityResourceComponent_GetDamageBlockedModifier final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilityResourceComponent_GetDamageBlockedModifier;

// Function Tyr.TyrAbilityResourceComponent.GetDamageDealtModifier
// 0x0004 (0x0004 - 0x0000)
struct TyrAbilityResourceComponent_GetDamageDealtModifier final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilityResourceComponent_GetDamageDealtModifier;

// Function Tyr.TyrAbilityResourceComponent.GetDamageTakenModifier
// 0x0004 (0x0004 - 0x0000)
struct TyrAbilityResourceComponent_GetDamageTakenModifier final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilityResourceComponent_GetDamageTakenModifier;

// Function Tyr.TyrAbilityResourceComponent.GetMaxAbilityResource
// 0x0004 (0x0004 - 0x0000)
struct TyrAbilityResourceComponent_GetMaxAbilityResource final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilityResourceComponent_GetMaxAbilityResource;

// Function Tyr.TyrAbilityResourceComponent.GetSpottingModifier
// 0x0004 (0x0004 - 0x0000)
struct TyrAbilityResourceComponent_GetSpottingModifier final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilityResourceComponent_GetSpottingModifier;

// Function Tyr.TyrCosmeticsFunctionLibrary.ClearMaterialOverrides
// 0x0008 (0x0008 - 0x0000)
struct TyrCosmeticsFunctionLibrary_ClearMaterialOverrides final
{
public:
	class USkeletalMeshComponent*                 MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrCosmeticsFunctionLibrary_ClearMaterialOverrides;

// Function Tyr.TyrCosmeticsFunctionLibrary.EqualStyleItemsBlob
// 0x0088 (0x0088 - 0x0000)
struct TyrCosmeticsFunctionLibrary_EqualStyleItemsBlob final
{
public:
	struct FStyleItemsBlob                        A;                                                 // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FStyleItemsBlob                        B;                                                 // 0x0040(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TyrCosmeticsFunctionLibrary_EqualStyleItemsBlob;

// Function Tyr.TyrCosmeticsFunctionLibrary.GetAllCosmeticsByVehicle
// 0x0018 (0x0018 - 0x0000)
struct TyrCosmeticsFunctionLibrary_GetAllCosmeticsByVehicle final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTyrVehicleCosmetics>           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrCosmeticsFunctionLibrary_GetAllCosmeticsByVehicle;

// Function Tyr.TyrCosmeticsFunctionLibrary.GetSkinParametersWithOverride
// 0x0198 (0x0198 - 0x0000)
struct TyrCosmeticsFunctionLibrary_GetSkinParametersWithOverride final
{
public:
	struct FDataRegistryId                        DefaultVehicleSkin;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataRegistryId                        OverrideVehicleSkin;                               // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTyrVehicleSkinDataTableStruct         OutSkinParameters;                                 // 0x0020(0x0170)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0190(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TyrCosmeticsFunctionLibrary_GetSkinParametersWithOverride;

// Function Tyr.TyrCosmeticsFunctionLibrary.LoadDeathVFXPerformanceClass
// 0x0010 (0x0010 - 0x0000)
struct TyrCosmeticsFunctionLibrary_LoadDeathVFXPerformanceClass final
{
public:
	struct FGameplayTag                           DeathVFXTag;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ATyrCosmeticDeathVFX>       ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrCosmeticsFunctionLibrary_LoadDeathVFXPerformanceClass;

// Function Tyr.TyrCosmeticsFunctionLibrary.LoadMaterialOverridesSynchronous
// 0x0020 (0x0020 - 0x0000)
struct TyrCosmeticsFunctionLibrary_LoadMaterialOverridesSynchronous final
{
public:
	TArray<struct FTyrMaterialOverride>           MaterialOverrides;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FTyrLoadedMaterialOverride>     ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrCosmeticsFunctionLibrary_LoadMaterialOverridesSynchronous;

// Function Tyr.TyrCosmeticsFunctionLibrary.MakeSkinItemArrayForStyleBlob
// 0x0018 (0x0018 - 0x0000)
struct TyrCosmeticsFunctionLibrary_MakeSkinItemArrayForStyleBlob final
{
public:
	struct FGameplayTag                           SkinTag;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrCosmeticsFunctionLibrary_MakeSkinItemArrayForStyleBlob;

// Function Tyr.TyrCosmeticsFunctionLibrary.NotEqualStyleItemsBlob
// 0x0088 (0x0088 - 0x0000)
struct TyrCosmeticsFunctionLibrary_NotEqualStyleItemsBlob final
{
public:
	struct FStyleItemsBlob                        A;                                                 // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FStyleItemsBlob                        B;                                                 // 0x0040(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TyrCosmeticsFunctionLibrary_NotEqualStyleItemsBlob;

// Function Tyr.TyrAbilitySystemComponent.AddGameplayCueLocal
// 0x00E8 (0x00E8 - 0x0000)
struct TyrAbilitySystemComponent_AddGameplayCueLocal final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 GameplayCueParameters;                             // 0x0008(0x00D8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bUseAvatarActorAsOwner;                            // 0x00E0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TyrAbilitySystemComponent_AddGameplayCueLocal;

// Function Tyr.TyrAbilitySystemComponent.ClientAddGameplayCueLocal
// 0x0008 (0x0008 - 0x0000)
struct TyrAbilitySystemComponent_ClientAddGameplayCueLocal final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilitySystemComponent_ClientAddGameplayCueLocal;

// Function Tyr.TyrAbilitySystemComponent.ClientExecuteGameplayCueLocal
// 0x0008 (0x0008 - 0x0000)
struct TyrAbilitySystemComponent_ClientExecuteGameplayCueLocal final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilitySystemComponent_ClientExecuteGameplayCueLocal;

// Function Tyr.TyrAbilitySystemComponent.ClientRemoveGameplayCueLocal
// 0x0008 (0x0008 - 0x0000)
struct TyrAbilitySystemComponent_ClientRemoveGameplayCueLocal final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilitySystemComponent_ClientRemoveGameplayCueLocal;

// Function Tyr.TyrAbilitySystemComponent.ExecuteGameplayCueLocal
// 0x00E8 (0x00E8 - 0x0000)
struct TyrAbilitySystemComponent_ExecuteGameplayCueLocal final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 GameplayCueParameters;                             // 0x0008(0x00D8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bUseAvatarActorAsOwner;                            // 0x00E0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TyrAbilitySystemComponent_ExecuteGameplayCueLocal;

// Function Tyr.TyrAbilitySystemComponent.FindAbilitiesFromSpecHandle
// 0x0018 (0x0018 - 0x0000)
struct TyrAbilitySystemComponent_FindAbilitiesFromSpecHandle final
{
public:
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGameplayAbility*>               ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilitySystemComponent_FindAbilitiesFromSpecHandle;

// Function Tyr.TyrAbilitySystemComponent.FindAbilitySpecHandleForClass
// 0x0018 (0x0018 - 0x0000)
struct TyrAbilitySystemComponent_FindAbilitySpecHandleForClass final
{
public:
	TSubclassOf<class UGameplayAbility>           AbilityClass;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                OptionalSourceObject;                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilitySpecHandle             ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TyrAbilitySystemComponent_FindAbilitySpecHandleForClass;

// Function Tyr.TyrAbilitySystemComponent.GetCooldownInfo
// 0x0028 (0x0028 - 0x0000)
struct TyrAbilitySystemComponent_GetCooldownInfo final
{
public:
	struct FGameplayTag                           CooldownTag;                                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCooldownInfo                          OutCooldownInfo;                                   // 0x0008(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilitySystemComponent_GetCooldownInfo;

// Function Tyr.TyrAbilitySystemComponent.ReduceActiveReloadCooldownRemaining
// 0x000C (0x000C - 0x0000)
struct TyrAbilitySystemComponent_ReduceActiveReloadCooldownRemaining final
{
public:
	float                                         ReductionSeconds;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinRemainingSeconds;                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TyrAbilitySystemComponent_ReduceActiveReloadCooldownRemaining;

// Function Tyr.TyrAbilitySystemComponent.RemoveGameplayCueLocal
// 0x00E8 (0x00E8 - 0x0000)
struct TyrAbilitySystemComponent_RemoveGameplayCueLocal final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 GameplayCueParameters;                             // 0x0008(0x00D8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bUseAvatarActorAsOwner;                            // 0x00E0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TyrAbilitySystemComponent_RemoveGameplayCueLocal;

// Function Tyr.TyrTempStateSubsystem.HandleWorldChanged
// 0x0018 (0x0018 - 0x0000)
struct TyrTempStateSubsystem_HandleWorldChanged final
{
public:
	class UGameInstance*                          GameInstance;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorld*                                 OldWorld;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorld*                                 NewWorld;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrTempStateSubsystem_HandleWorldChanged;

// Function Tyr.TyrTempStateSubsystem.SetCurrentGameMode
// 0x0001 (0x0001 - 0x0000)
struct TyrTempStateSubsystem_SetCurrentGameMode final
{
public:
	ETyrGameMode                                  NewGameMode;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrTempStateSubsystem_SetCurrentGameMode;

// Function Tyr.TyrTempStateSubsystem.GetCurrentGameMode
// 0x0001 (0x0001 - 0x0000)
struct TyrTempStateSubsystem_GetCurrentGameMode final
{
public:
	ETyrGameMode                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrTempStateSubsystem_GetCurrentGameMode;

// Function Tyr.TyrTempStateSubsystem.GetCurrentGameModeType
// 0x0001 (0x0001 - 0x0000)
struct TyrTempStateSubsystem_GetCurrentGameModeType final
{
public:
	ETyrGameModeType                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrTempStateSubsystem_GetCurrentGameModeType;

// Function Tyr.TyrConsoleVariablesFunctionLibrary.ClearConsoleVariableListener
// 0x0018 (0x0018 - 0x0000)
struct TyrConsoleVariablesFunctionLibrary_ClearConsoleVariableListener final
{
public:
	struct FTyrConsoleVariableListenerHandle      ListenerHandle;                                    // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrConsoleVariablesFunctionLibrary_ClearConsoleVariableListener;

// Function Tyr.TyrConsoleVariablesFunctionLibrary.ListenForConsoleVariableChanged_Bool
// 0x0038 (0x0038 - 0x0000)
struct TyrConsoleVariablesFunctionLibrary_ListenForConsoleVariableChanged_Bool final
{
public:
	class FString                                 VariableName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool NewValue)>                OnChanged;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTyrConsoleVariableListenerHandle      ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrConsoleVariablesFunctionLibrary_ListenForConsoleVariableChanged_Bool;

// Function Tyr.TyrConsoleVariablesFunctionLibrary.ListenForConsoleVariableChanged_Float
// 0x0038 (0x0038 - 0x0000)
struct TyrConsoleVariablesFunctionLibrary_ListenForConsoleVariableChanged_Float final
{
public:
	class FString                                 VariableName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(float NewValue)>               OnChanged;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTyrConsoleVariableListenerHandle      ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrConsoleVariablesFunctionLibrary_ListenForConsoleVariableChanged_Float;

// Function Tyr.TyrConsoleVariablesFunctionLibrary.ListenForConsoleVariableChanged_Int
// 0x0038 (0x0038 - 0x0000)
struct TyrConsoleVariablesFunctionLibrary_ListenForConsoleVariableChanged_Int final
{
public:
	class FString                                 VariableName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 NewValue)>               OnChanged;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTyrConsoleVariableListenerHandle      ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrConsoleVariablesFunctionLibrary_ListenForConsoleVariableChanged_Int;

// Function Tyr.TyrConsoleVariablesFunctionLibrary.ListenForConsoleVariableChanged_String
// 0x0038 (0x0038 - 0x0000)
struct TyrConsoleVariablesFunctionLibrary_ListenForConsoleVariableChanged_String final
{
public:
	class FString                                 VariableName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& NewValue)> OnChanged;                                        // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTyrConsoleVariableListenerHandle      ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrConsoleVariablesFunctionLibrary_ListenForConsoleVariableChanged_String;

// Function Tyr.TyrAbilitySystemStatics.AppendGameplayTag
// 0x001C (0x001C - 0x0000)
struct TyrAbilitySystemStatics_AppendGameplayTag final
{
public:
	struct FGameplayTag                           BaseTag;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TagSuffix;                                         // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ReturnValue;                                       // 0x0014(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilitySystemStatics_AppendGameplayTag;

// Function Tyr.TyrAbilitySystemStatics.CalculateAbilityClassesList
// 0x0010 (0x0010 - 0x0000)
struct TyrAbilitySystemStatics_CalculateAbilityClassesList final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilitySystemStatics_CalculateAbilityClassesList;

// Function Tyr.TyrAbilitySystemStatics.CalculateEffectClassesList
// 0x0010 (0x0010 - 0x0000)
struct TyrAbilitySystemStatics_CalculateEffectClassesList final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilitySystemStatics_CalculateEffectClassesList;

// Function Tyr.TyrAbilitySystemStatics.CalculateGameplayCueTagsList
// 0x0010 (0x0010 - 0x0000)
struct TyrAbilitySystemStatics_CalculateGameplayCueTagsList final
{
public:
	TArray<struct FGameplayTag>                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilitySystemStatics_CalculateGameplayCueTagsList;

// Function Tyr.TyrAbilitySystemStatics.ExtractGameplayEffectContext
// 0x0020 (0x0020 - 0x0000)
struct TyrAbilitySystemStatics_ExtractGameplayEffectContext final
{
public:
	struct FGameplayEffectContextHandle           InHandle;                                          // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         OutPayload;                                        // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TyrAbilitySystemStatics_ExtractGameplayEffectContext;

// Function Tyr.TyrAbilitySystemStatics.GetAmmunitionPenetrationOverride
// 0x0030 (0x0030 - 0x0000)
struct TyrAbilitySystemStatics_GetAmmunitionPenetrationOverride final
{
public:
	TSoftClassPtr<class UClass>                   AmmunitionClass;                                   // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutPenetrationOverride;                            // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x002C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TyrAbilitySystemStatics_GetAmmunitionPenetrationOverride;

// Function Tyr.TyrAbilitySystemStatics.GetHitImpactTagFromPhysicalMaterial
// 0x0010 (0x0010 - 0x0000)
struct TyrAbilitySystemStatics_GetHitImpactTagFromPhysicalMaterial final
{
public:
	class UPhysicalMaterial*                      InPhysicalMaterial;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilitySystemStatics_GetHitImpactTagFromPhysicalMaterial;

// Function Tyr.TyrAbilitySystemStatics.GetLeafSubTag
// 0x0014 (0x0014 - 0x0000)
struct TyrAbilitySystemStatics_GetLeafSubTag final
{
public:
	struct FGameplayTag                           BaseTag;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ReturnValue;                                       // 0x000C(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrAbilitySystemStatics_GetLeafSubTag;

// Function Tyr.TyrAbilitySystemStatics.GetTimeRemainingAndDurationForActiveEffect
// 0x0038 (0x0038 - 0x0000)
struct TyrAbilitySystemStatics_GetTimeRemainingAndDurationForActiveEffect final
{
public:
