#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tyr

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "GameplayCameras_structs.hpp"
#include "GameplayCameras_classes.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Tyr_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "CommonInput_classes.hpp"
#include "AudioMixer_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "EnhancedInput_structs.hpp"
#include "EnhancedInput_classes.hpp"
#include "TyrSharedTypes_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "ModelViewViewModel_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "GameFeatures_classes.hpp"
#include "InputCore_structs.hpp"
#include "NetCore_structs.hpp"
#include "DiscordPartnerSDK_structs.hpp"
#include "GameSettings_classes.hpp"
#include "GameplayMessageRuntime_structs.hpp"
#include "OnlineSubsystemUtils_classes.hpp"


SDK_NAMESPACE_START

// Class Tyr.TyrActivatableWidget
// 0x0080 (0x0528 - 0x04A8)
class UTyrActivatableWidget : public UCommonActivatableWidget
{
public:
	ETyrWidgetInputMode                           InputConfig;                                       // 0x04A8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMouseCaptureMode                             GameMouseCaptureMode;                              // 0x04A9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMouseLockMode                                GameMouseLockMode;                                 // 0x04AA(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4AB[0x5];                                      // 0x04AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTyrInputActionRowHandle>       InputActions;                                      // 0x04B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FTyrInputActionRowHandle>       InputHints;                                        // 0x04C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bShowMouseCursor;                                  // 0x04D0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4D1[0x57];                                     // 0x04D1(0x0057)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ExecuteWhenActivated(const TDelegate<void()>& InDelegate);
	void ExecuteWhenDeactivated(const TDelegate<void()>& InDelegate);
	void HandleInputAction(const struct FTyrInputActionRowHandle& ActionHandle);
	void K2_OnInputMethodChanged(ECommonInputType CommonInput);
	void OnActionButtonAdded(class UTyrBoundActionButton* ActionButton, const class FName& InputAction);
	void OnActionButtonRemoved(class UTyrBoundActionButton* ActionButton, const class FName& InputAction);
	void OverrideActionDomain(class UCommonInputActionDomain* ActionDomain);
	void RemoveFromLayer();
	void SetBackActionLabel(const class FText& Label);
	void SetInputActionBreadcrumb(const struct FTyrInputActionBreadcrumbParam& BreadcrumbInfo);
	void SetInputActionEnabled(const struct FTyrInputActionEnableParam& EnableInfo);
	void SetInputActionLabel(const struct FTyrInputActionLabelParam& LabelInfo);
	void SetListeningForInputAction(const struct FTyrInputActionListenParam& ListenInfo);

	TArray<class FName> GetInputActionNames() const;
	struct FTyrInputActionBreadcrumbParam ToInputActionBreadcrumbParam(const struct FGameplayTag& CategoryBreadcrumb, class FName ActionName) const;
	struct FTyrInputActionEnableParam ToInputActionEnableParam(bool bShouldEnable, class FName ActionName) const;
	struct FTyrInputActionLabelParam ToInputActionLabelParam(const class FText& Label, class FName ActionName) const;
	struct FTyrInputActionListenParam ToInputActionListenParam(bool bShouldListen, class FName ActionName) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrActivatableWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrActivatableWidget")
	}
	static class UTyrActivatableWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrActivatableWidget>();
	}
};
DUMPER7_ASSERTS_UTyrActivatableWidget;

// Class Tyr.TyrContextMenuWidget
// 0x0020 (0x0548 - 0x0528)
class UTyrContextMenuWidget : public UTyrActivatableWidget
{
public:
	class UDynamicEntryBox*                       ActionsBox;                                        // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UCommonTextBlock*                       TitleTextBlock;                                    // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	TSubclassOf<class UTyrButtonBase>             ActionButtonClass;                                 // 0x0538(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_540[0x8];                                      // 0x0540(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddOption(const class FText& Label, class UTexture2D* Icon, const TDelegate<void()>& OnClicked);
	void ClearOptions();
	void SetTitle(const class FText& Title);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrContextMenuWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrContextMenuWidget")
	}
	static class UTyrContextMenuWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrContextMenuWidget>();
	}
};
DUMPER7_ASSERTS_UTyrContextMenuWidget;

// Class Tyr.AsyncAction_ObserveTeam
// 0x0020 (0x0050 - 0x0030)
class UAsyncAction_ObserveTeam final : public UCancellableAsyncAction
{
public:
	TMulticastInlineDelegate<void(bool bTeamSet, int32 TeamId)> OnTeamChanged;                       // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_ObserveTeam* ObserveTeam(class UObject* TeamAgent);

	void OnWatchedAgentChangedTeam(class UObject* TeamAgent, int32 OldTeam, int32 NewTeam);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncAction_ObserveTeam")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncAction_ObserveTeam")
	}
	static class UAsyncAction_ObserveTeam* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_ObserveTeam>();
	}
};
DUMPER7_ASSERTS_UAsyncAction_ObserveTeam;

// Class Tyr.AsyncTaskAttributeChanged
// 0x0060 (0x0090 - 0x0030)
class UAsyncTaskAttributeChanged final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue)> OnAttributeChanged; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                ASC;                                               // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_48[0x48];                                      // 0x0048(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncTaskAttributeChanged* ListenForAttributeChange(class UAbilitySystemComponent* AbilitySystemComponent, const struct FGameplayAttribute& Attribute);
	static class UAsyncTaskAttributeChanged* ListenForAttributesChange(class UAbilitySystemComponent* AbilitySystemComponent, const TArray<struct FGameplayAttribute>& Attributes);

	void EndTask();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTaskAttributeChanged")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTaskAttributeChanged")
	}
	static class UAsyncTaskAttributeChanged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTaskAttributeChanged>();
	}
};
DUMPER7_ASSERTS_UAsyncTaskAttributeChanged;

// Class Tyr.AsyncTaskCooldownChanged
// 0x0050 (0x0080 - 0x0030)
class UAsyncTaskCooldownChanged final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayTag& CooldownTag, float TimeRemaining, float Duration)> OnCooldownBegin; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& CooldownTag, float TimeRemaining, float Duration)> OnCooldownEnd; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UTyrAbilitySystemComponent*             ASC;                                               // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_58[0x28];                                      // 0x0058(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncTaskCooldownChanged* ListenForCooldownChange(class UTyrAbilitySystemComponent* AbilitySystemComponent, const struct FGameplayTagContainer& InCooldownTags, bool InUseServerCooldown, bool InPredictedServerCooldown);

	void EndTask();
	void OnCooldownChange(const struct FGameplayTag& CooldownTag, const struct FCooldownInfo& CooldownInfo);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTaskCooldownChanged")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTaskCooldownChanged")
	}
	static class UAsyncTaskCooldownChanged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTaskCooldownChanged>();
	}
};
DUMPER7_ASSERTS_UAsyncTaskCooldownChanged;

// Class Tyr.AsyncTaskGameplayTagAddedRemoved
// 0x0048 (0x0078 - 0x0030)
class UAsyncTaskGameplayTagAddedRemoved final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayTag& Tag)> OnTagAdded;                       // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& Tag)> OnTagRemoved;                     // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                ASC;                                               // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_58[0x20];                                      // 0x0058(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncTaskGameplayTagAddedRemoved* ListenForGameplayTagAddedOrRemoved(class UAbilitySystemComponent* AbilitySystemComponent, const struct FGameplayTagContainer& Tags);

	void EndTask();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTaskGameplayTagAddedRemoved")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTaskGameplayTagAddedRemoved")
	}
	static class UAsyncTaskGameplayTagAddedRemoved* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTaskGameplayTagAddedRemoved>();
	}
};
DUMPER7_ASSERTS_UAsyncTaskGameplayTagAddedRemoved;

// Class Tyr.FoliageActorRenderUpdater
// 0x0000 (0x0000 - 0x0000)
class IFoliageActorRenderUpdater final
{
public:
	void UpdateMeshRenderForSniperMode(bool bSniperModeActive);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FoliageActorRenderUpdater")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FoliageActorRenderUpdater")
	}
	static class IFoliageActorRenderUpdater* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFoliageActorRenderUpdater>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFoliageActorRenderUpdater;

// Class Tyr.SyncSceneCaptureCameraNode
// 0x0010 (0x0048 - 0x0038)
class USyncSceneCaptureCameraNode final : public UCameraNode
{
public:
	class USceneCaptureComponent2D*               SceneCaptureComponent;                             // 0x0038(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SyncSceneCaptureCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SyncSceneCaptureCameraNode")
	}
	static class USyncSceneCaptureCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<USyncSceneCaptureCameraNode>();
	}
};
DUMPER7_ASSERTS_USyncSceneCaptureCameraNode;

// Class Tyr.TyrContextMenuAnchorSlot
// 0x0000 (0x0038 - 0x0038)
class UTyrContextMenuAnchorSlot final : public UPanelSlot
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrContextMenuAnchorSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrContextMenuAnchorSlot")
	}
	static class UTyrContextMenuAnchorSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrContextMenuAnchorSlot>();
	}
};
DUMPER7_ASSERTS_UTyrContextMenuAnchorSlot;

// Class Tyr.TyrAbilityAvatarActorInterface
// 0x0000 (0x0000 - 0x0000)
class ITyrAbilityAvatarActorInterface final
{
public:
	class USkeletalMeshComponent* GetAnimatedMeshComponent();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrAbilityAvatarActorInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrAbilityAvatarActorInterface")
	}
	static class ITyrAbilityAvatarActorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ITyrAbilityAvatarActorInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ITyrAbilityAvatarActorInterface;

// Class Tyr.TyrSplinePathCameraNode
// 0x0098 (0x00D0 - 0x0038)
class UTyrSplinePathCameraNode final : public UCameraNode
{
public:
	struct FTyrCameraSplineReference              SplineReference;                                   // 0x0038(0x0008)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class FName                                   SplineComponentTag;                                // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatCameraParameter                  StartDelay;                                        // 0x0048(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FFloatCameraParameter                  SplineInput;                                       // 0x0058(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FFloatCameraParameter                  TravelSpeed;                                       // 0x0068(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bTreatInputAsDistance;                             // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTreatInputAsSplineKey;                            // 0x0079(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTreatSpeedAsEaseTime;                             // 0x007A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClampInputToSpline;                               // 0x007B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetCameraLocation;                                // 0x007C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetCameraRotation;                                // 0x007D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOffsetInSplineSpace;                              // 0x007E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector3dCameraParameter               LocationOffset;                                    // 0x0080(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator3dCameraParameter              RotationOffset;                                    // 0x00A8(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrSplinePathCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrSplinePathCameraNode")
	}
	static class UTyrSplinePathCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrSplinePathCameraNode>();
	}
};
DUMPER7_ASSERTS_UTyrSplinePathCameraNode;

// Class Tyr.TyrAbilityComponentInterface
// 0x0000 (0x0000 - 0x0000)
class ITyrAbilityComponentInterface final
{
public:
	void InitializeAbilitySystem(class UAbilitySystemComponent* AbilitySystem);
	void PostPlayerStateInitializeAbilitySystem(class UAbilitySystemComponent* AbilitySystem);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrAbilityComponentInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrAbilityComponentInterface")
	}
	static class ITyrAbilityComponentInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ITyrAbilityComponentInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ITyrAbilityComponentInterface;

// Class Tyr.TyrDataRegistryFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UTyrDataRegistryFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static TArray<class FString> GetAllCachedColumnsAsString(const struct FDataRegistryType& RegistryType, const TArray<class FName>& WantedRows, class FName PropertyName);
	static TArray<class FName> GetAllCachedItemNames(const struct FDataRegistryType& RegistryType);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrDataRegistryFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrDataRegistryFunctionLibrary")
	}
	static class UTyrDataRegistryFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrDataRegistryFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UTyrDataRegistryFunctionLibrary;

// Class Tyr.TyrAbilityFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UTyrAbilityFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool CalculateBlinkAbilityTargetLocation(const class UObject* WorldContextObject, const struct FBlinkTargetingData& TargetingData, struct FTransform* OutTransform);
	static bool CalculateValidRecallTeleportSpot(const class UObject* WorldContextObject, const struct FRecallTargetingData& TargetingData, struct FTransform* OutTransform);
	static bool K2_FindTeleportSpot(const class AActor* TestActor, const struct FVector& TestLocation, const struct FRotator& TestRotation, struct FVector* OutLocation);
	static class ANavigationData* K2_GetStableNavigationData(const class UObject* WorldContextObject);
	static class ANavigationData* K2_GetUnstableNavigationData(const class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrAbilityFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrAbilityFunctionLibrary")
	}
	static class UTyrAbilityFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrAbilityFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UTyrAbilityFunctionLibrary;

// Class Tyr.TyrAbilityResourceComponent
// 0x0038 (0x00F0 - 0x00B8)
class UTyrAbilityResourceComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UTyrAbilityResourceComponent* AbilityResourceComponent, float OldValue, float NewValue, class AActor* Instigator)> OnAbilityResourceChanged; // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTyrAbilityResourceComponent* AbilityResourceComponent, float OldValue, float NewValue, class AActor* Instigator)> OnMaxAbilityResourceChanged; // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UTyrAttributeSetAbilityResource*        AbilityResourceSet;                                // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UTyrAbilityResourceComponent* FindAbilityResourceComponent(const class AActor* Actor);

	void InitializeAbilitySystem_Implementation(class UAbilitySystemComponent* InASC);
	void UninitializeFromAbilitySystem();

	float GetAbilityResource() const;
	float GetDamageBlockedModifier() const;
	float GetDamageDealtModifier() const;
	float GetDamageTakenModifier() const;
	float GetMaxAbilityResource() const;
	float GetSpottingModifier() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrAbilityResourceComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrAbilityResourceComponent")
	}
	static class UTyrAbilityResourceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrAbilityResourceComponent>();
	}
};
DUMPER7_ASSERTS_UTyrAbilityResourceComponent;

// Class Tyr.TyrCosmeticsFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UTyrCosmeticsFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ClearMaterialOverrides(class USkeletalMeshComponent* MeshComponent);
	static bool EqualStyleItemsBlob(const struct FStyleItemsBlob& A, const struct FStyleItemsBlob& B);
	static TArray<struct FTyrVehicleCosmetics> GetAllCosmeticsByVehicle(const class UObject* WorldContextObject);
	static bool GetSkinParametersWithOverride(const struct FDataRegistryId& DefaultVehicleSkin, const struct FDataRegistryId& OverrideVehicleSkin, struct FTyrVehicleSkinDataTableStruct* OutSkinParameters);
	static TSubclassOf<class ATyrCosmeticDeathVFX> LoadDeathVFXPerformanceClass(const struct FGameplayTag& DeathVFXTag);
	static TArray<struct FTyrLoadedMaterialOverride> LoadMaterialOverridesSynchronous(const TArray<struct FTyrMaterialOverride>& MaterialOverrides);
	static TArray<struct FGameplayTag> MakeSkinItemArrayForStyleBlob(const struct FGameplayTag& SkinTag);
	static bool NotEqualStyleItemsBlob(const struct FStyleItemsBlob& A, const struct FStyleItemsBlob& B);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrCosmeticsFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrCosmeticsFunctionLibrary")
	}
	static class UTyrCosmeticsFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrCosmeticsFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UTyrCosmeticsFunctionLibrary;

// Class Tyr.TyrAbilitySystemComponent
// 0x0158 (0x13B8 - 0x1260)
class UTyrAbilitySystemComponent final : public UAbilitySystemComponent
{
public:
	TArray<struct FGameplayTag>                   CooldownListenerTags;                              // 0x1260(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_1270[0x10];                                    // 0x1270(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class ATyrGASDebuggerActor*                   GASDebuggerActor;                                  // 0x1280(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_1288[0x10];                                    // 0x1288(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCooldownContainer                     CooldownInfos;                                     // 0x1298(0x0120)(Net, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	void AddGameplayCueLocal(const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& GameplayCueParameters, bool bUseAvatarActorAsOwner);
	void ClientAddGameplayCueLocal(const struct FGameplayTag& GameplayCueTag);
	void ClientExecuteGameplayCueLocal(const struct FGameplayTag& GameplayCueTag);
	void ClientRemoveGameplayCueLocal(const struct FGameplayTag& GameplayCueTag);
	void ExecuteGameplayCueLocal(const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& GameplayCueParameters, bool bUseAvatarActorAsOwner);
	TArray<class UGameplayAbility*> FindAbilitiesFromSpecHandle(const struct FGameplayAbilitySpecHandle& Handle);
	struct FGameplayAbilitySpecHandle FindAbilitySpecHandleForClass(TSubclassOf<class UGameplayAbility> AbilityClass, class UObject* OptionalSourceObject);
	void GetCooldownInfo(const struct FGameplayTag& CooldownTag, struct FCooldownInfo* OutCooldownInfo);
	bool ReduceActiveReloadCooldownRemaining(float ReductionSeconds, float MinRemainingSeconds);
	void RemoveGameplayCueLocal(const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& GameplayCueParameters, bool bUseAvatarActorAsOwner);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrAbilitySystemComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrAbilitySystemComponent")
	}
	static class UTyrAbilitySystemComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrAbilitySystemComponent>();
	}
};
DUMPER7_ASSERTS_UTyrAbilitySystemComponent;

// Class Tyr.TyrAbilitySystemGlobals
// 0x0010 (0x0308 - 0x02F8)
class UTyrAbilitySystemGlobals final : public UAbilitySystemGlobals
{
public:
	uint8                                         Pad_2F8[0x10];                                     // 0x02F8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrAbilitySystemGlobals")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrAbilitySystemGlobals")
	}
	static class UTyrAbilitySystemGlobals* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrAbilitySystemGlobals>();
	}
};
DUMPER7_ASSERTS_UTyrAbilitySystemGlobals;

// Class Tyr.TyrTempStateSubsystem
// 0x0010 (0x0040 - 0x0030)
class UTyrTempStateSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleWorldChanged(class UGameInstance* GameInstance, class UWorld* OldWorld, class UWorld* NewWorld);
	void SetCurrentGameMode(ETyrGameMode NewGameMode);

	ETyrGameMode GetCurrentGameMode() const;
	ETyrGameModeType GetCurrentGameModeType() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrTempStateSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrTempStateSubsystem")
	}
	static class UTyrTempStateSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrTempStateSubsystem>();
	}
};
DUMPER7_ASSERTS_UTyrTempStateSubsystem;

// Class Tyr.TyrConsoleVariablesFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UTyrConsoleVariablesFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ClearConsoleVariableListener(struct FTyrConsoleVariableListenerHandle& ListenerHandle);
	static struct FTyrConsoleVariableListenerHandle ListenForConsoleVariableChanged_Bool(const class FString& VariableName, const TDelegate<void(bool NewValue)>& OnChanged);
	static struct FTyrConsoleVariableListenerHandle ListenForConsoleVariableChanged_Float(const class FString& VariableName, const TDelegate<void(float NewValue)>& OnChanged);
	static struct FTyrConsoleVariableListenerHandle ListenForConsoleVariableChanged_Int(const class FString& VariableName, const TDelegate<void(int32 NewValue)>& OnChanged);
	static struct FTyrConsoleVariableListenerHandle ListenForConsoleVariableChanged_String(const class FString& VariableName, const TDelegate<void(const class FString& NewValue)>& OnChanged);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrConsoleVariablesFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrConsoleVariablesFunctionLibrary")
	}
	static class UTyrConsoleVariablesFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrConsoleVariablesFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UTyrConsoleVariablesFunctionLibrary;

// Class Tyr.TyrAbilitySystemStatics
// 0x0000 (0x0028 - 0x0028)
class UTyrAbilitySystemStatics final : public UBlueprintFunctionLibrary
{
public:
	static struct FGameplayTag AppendGameplayTag(const struct FGameplayTag& BaseTag, const class FName& TagSuffix, bool* bSuccess);
	static TArray<class FString> CalculateAbilityClassesList();
	static TArray<class FString> CalculateEffectClassesList();
	static TArray<struct FGameplayTag> CalculateGameplayCueTagsList();
	static bool ExtractGameplayEffectContext(struct FGameplayEffectContextHandle& InHandle, int32* OutPayload);
	static bool GetAmmunitionPenetrationOverride(const TSoftClassPtr<class UClass>& AmmunitionClass, float* OutPenetrationOverride);
	static struct FGameplayTag GetHitImpactTagFromPhysicalMaterial(class UPhysicalMaterial* InPhysicalMaterial);
	static class FName GetLeafSubTag(const struct FGameplayTag& BaseTag, bool* bSuccess);
	static bool GetTimeRemainingAndDurationForActiveEffect(class UAbilitySystemComponent* ASC, const struct FGameplayTagContainer& InTags, float* TimeRemaining, float* CooldownDuration);
	static void InjectGameplayEffectContext(struct FGameplayEffectContextHandle& InHandle, int32& InPayload);
	static struct FGameplayTag PrependGameplayTag(const struct FGameplayTag& BaseTag, const class FName& TagPrefix, bool* bSuccess);
	static class FName RemoveTagPrefix(const struct FGameplayTag& BaseTag, const struct FGameplayTag& TagPrefix, bool* bSuccess);
	static bool RequestGameplayTag(const class FName TagName, struct FGameplayTag* OutTag);
	static void RequestGameplayTagChildren(struct FGameplayTagContainer* OutTags, const struct FGameplayTag& ParentTag);
	static void RequestMatchingGameplayTags(const struct FGameplayTagQuery& TagQuery, struct FGameplayTagContainer* OutTags, const struct FGameplayTag& ParentTag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrAbilitySystemStatics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrAbilitySystemStatics")
	}
	static class UTyrAbilitySystemStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrAbilitySystemStatics>();
	}
};
DUMPER7_ASSERTS_UTyrAbilitySystemStatics;

// Class Tyr.TyrAbilitySystemUtils
// 0x0000 (0x0028 - 0x0028)
class UTyrAbilitySystemUtils final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrAbilitySystemUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrAbilitySystemUtils")
	}
	static class UTyrAbilitySystemUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrAbilitySystemUtils>();
	}
};
DUMPER7_ASSERTS_UTyrAbilitySystemUtils;

// Class Tyr.TyrLookAtSocketCameraNode
// 0x0040 (0x0078 - 0x0038)
class UTyrLookAtSocketCameraNode final : public UCameraNode
{
public:
	class FName                                   TargetComponentTag;                                // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetSocketName;                                  // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3dCameraParameter               TargetOffset;                                      // 0x0048(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bPreserveRoll;                                     // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrLookAtSocketCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrLookAtSocketCameraNode")
	}
	static class UTyrLookAtSocketCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrLookAtSocketCameraNode>();
	}
};
DUMPER7_ASSERTS_UTyrLookAtSocketCameraNode;

// Class Tyr.TyrDamageContextSubsystem
// 0x0068 (0x0098 - 0x0030)
class UTyrDamageContextSubsystem final : public UWorldSubsystem
{
public:
	struct FGameplayTag                           DamagedModuleIdentifierTag;                        // 0x0030(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           DamageModuleType;                                  // 0x0038(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0040(0x0020)(Protected, NativeAccessSpecifierProtected)
	float                                         DamageAmount;                                      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BonusDamageAmount;                                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                DamageLocation;                                    // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                DamageOrigin;                                      // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	float GetBonusDamageAmount();
	float GetDamageAmount();
	struct FGameplayTag GetDamagedModuleIdentifierTag();
	struct FVector GetDamageLocation();
	struct FGameplayTag GetDamageModuleTypeTag();
	struct FVector GetDamageOrigin();
	void Reset();
	void SetBonusDamageAmount(float InAmount);
	void SetDamageAmount(float InAmount);
	void SetDamagedModuleIdentifierTag(const struct FGameplayTag& InTag);
	void SetDamageLocation(const struct FVector& InLocations);
	void SetDamageModuleTypeTag(const struct FGameplayTag& InTag);
	void SetDamageOrigin(const struct FVector& InLocation);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrDamageContextSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrDamageContextSubsystem")
	}
	static class UTyrDamageContextSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrDamageContextSubsystem>();
	}
};
DUMPER7_ASSERTS_UTyrDamageContextSubsystem;

// Class Tyr.TyrAbilityTaskWaitForMinimap
// 0x0110 (0x0190 - 0x0080)
class alignas(0x10) UTyrAbilityTaskWaitForMinimap final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> ValidData;   // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> Cancelled;   // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x70];                                      // 0x00A0(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bContinuousMode;                                   // 0x0110(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           HoldAction;                                        // 0x0118(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_120[0x70];                                     // 0x0120(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UTyrAbilityTaskWaitForMinimap* WaitForMinimap(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, EGameplayTargetingConfirmation ConfirmationType, const struct FTransform& Offset, bool bInContinuousMode, class UInputAction* InHoldAction);

	void OnMinimapGameplayMessageCallback(const struct FGameplayTag& Tag, const struct FMinimapGameplayMessage& Message);
	void OnTargetDataCancelledCallback(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnTargetDataReadyCallback(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnTargetDataReplicatedCallback(const struct FGameplayAbilityTargetDataHandle& Data, const struct FGameplayTag& ActivationTag);
	void OnTargetDataReplicatedCancelledCallback();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrAbilityTaskWaitForMinimap")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrAbilityTaskWaitForMinimap")
	}
	static class UTyrAbilityTaskWaitForMinimap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrAbilityTaskWaitForMinimap>();
	}
};
DUMPER7_ASSERTS_UTyrAbilityTaskWaitForMinimap;

// Class Tyr.TyrAbilityTask_PlayMontageAndWait
// 0x00D8 (0x0158 - 0x0080)
class UTyrAbilityTask_PlayMontageAndWait final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void()>              OnStarted;                                         // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCompleted;                                       // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnBlendedIn;                                       // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnBlendOut;                                        // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnInterrupted;                                     // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCancelled;                                       // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName NotifyName)> OnNotifyBegin;                            // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName NotifyName)> OnNotifyEnd;                              // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_100[0x38];                                     // 0x0100(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           MontageToPlay;                                     // 0x0138(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	float                                         Rate;                                              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   StartSection;                                      // 0x0144(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         StartTimeSeconds;                                  // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bStopWhenAbilityEnds;                              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAllowInterruptAfterBlendOut;                      // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UTyrAbilityTask_PlayMontageAndWait* CreatePlayMontageAndWaitProxy(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, class UAnimMontage* MontageToPlay_0, float Rate_0, class FName StartSection_0, bool bStopWhenAbilityEnds_0, float StartTimeSeconds_0, bool bAllowInterruptAfterBlendOut_0);

	void OnGameplayAbilityCancelled();
	void OnMontageBlendedIn(class UAnimMontage* Montage);
	void OnMontageBlendingOut(class UAnimMontage* Montage, bool bInterrupted);
	void OnMontageEnded(class UAnimMontage* Montage, bool bInterrupted);
	void OnNotifyBeginReceived(class FName NotifyName, const struct FBranchingPointNotifyPayload& BranchingPointNotifyPayload);
	void OnNotifyEndReceived(class FName NotifyName, const struct FBranchingPointNotifyPayload& BranchingPointNotifyPayload);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrAbilityTask_PlayMontageAndWait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrAbilityTask_PlayMontageAndWait")
	}
	static class UTyrAbilityTask_PlayMontageAndWait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrAbilityTask_PlayMontageAndWait>();
	}
};
DUMPER7_ASSERTS_UTyrAbilityTask_PlayMontageAndWait;

// Class Tyr.TyrDevDebugToolConfigDataAsset
// 0x0050 (0x0080 - 0x0030)
class UTyrDevDebugToolConfigDataAsset final : public UDataAsset
{
public:
	TMap<struct FGameplayAttribute, struct FTyrAttributeDebugInfo> AttributeDebugInfo;               // 0x0030(0x0050)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrDevDebugToolConfigDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrDevDebugToolConfigDataAsset")
	}
	static class UTyrDevDebugToolConfigDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrDevDebugToolConfigDataAsset>();
	}
};
DUMPER7_ASSERTS_UTyrDevDebugToolConfigDataAsset;

// Class Tyr.TyrAbilityTask_WaitForReloadCooldown
// 0x0030 (0x00B0 - 0x0080)
class UTyrAbilityTask_WaitForReloadCooldown final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void()>              OnCooldownCleared;                                 // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x20];                                      // 0x0090(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UTyrAbilityTask_WaitForReloadCooldown* WaitForReloadCooldown(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, const struct FActiveGameplayEffectHandle& InitialCooldownHandle);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrAbilityTask_WaitForReloadCooldown")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrAbilityTask_WaitForReloadCooldown")
	}
	static class UTyrAbilityTask_WaitForReloadCooldown* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrAbilityTask_WaitForReloadCooldown>();
	}
};
DUMPER7_ASSERTS_UTyrAbilityTask_WaitForReloadCooldown;

// Class Tyr.TyrActionBarSubsystem
// 0x0020 (0x0050 - 0x0030)
class UTyrActionBarSubsystem final : public ULocalPlayerSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTyrActionBarTrayContent>       TrayContents;                                      // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrActionBarSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrActionBarSubsystem")
	}
	static class UTyrActionBarSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrActionBarSubsystem>();
	}
};
DUMPER7_ASSERTS_UTyrActionBarSubsystem;

// Class Tyr.TyrDebugCameraController
// 0x0048 (0x0918 - 0x08D0)
class ATyrDebugCameraController final : public ADebugCameraController
{
public:
	uint8                                         Pad_8D0[0x8];                                      // 0x08D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class ATyrDebugCameraPawn*                    TyrDebugCameraPawn;                                // 0x08D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_8E0[0x38];                                     // 0x08E0(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class ATyrDebugCameraPawn* GetTyrDebugCameraPawn() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrDebugCameraController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrDebugCameraController")
	}
	static class ATyrDebugCameraController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATyrDebugCameraController>();
	}
};
DUMPER7_ASSERTS_ATyrDebugCameraController;

// Class Tyr.TyrActivatableWidgetStack
// 0x0010 (0x02B0 - 0x02A0)
class UTyrActivatableWidgetStack final : public UCommonActivatableWidgetStack
{
public:
	bool                                          bOverrideActionDomain;                             // 0x02A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputActionDomain*               ActionDomainOverride;                              // 0x02A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrActivatableWidgetStack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrActivatableWidgetStack")
	}
	static class UTyrActivatableWidgetStack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrActivatableWidgetStack>();
	}
};
DUMPER7_ASSERTS_UTyrActivatableWidgetStack;

// Class Tyr.TyrCosmeticVFXGameFeatureData
// 0x0000 (0x0050 - 0x0050)
class UTyrCosmeticVFXGameFeatureData final : public UGameFeatureData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrCosmeticVFXGameFeatureData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrCosmeticVFXGameFeatureData")
	}
	static class UTyrCosmeticVFXGameFeatureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrCosmeticVFXGameFeatureData>();
	}
};
DUMPER7_ASSERTS_UTyrCosmeticVFXGameFeatureData;

// Class Tyr.TyrActivatableWidgetQueue
// 0x0030 (0x02C0 - 0x0290)
class UTyrActivatableWidgetQueue final : public UCommonActivatableWidgetQueue
{
public:
	bool                                          bOverrideActionDomain;                             // 0x0290(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCommonInputActionDomain> ActionDomainOverride;                             // 0x0298(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrActivatableWidgetQueue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrActivatableWidgetQueue")
	}
	static class UTyrActivatableWidgetQueue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrActivatableWidgetQueue>();
	}
};
DUMPER7_ASSERTS_UTyrActivatableWidgetQueue;

// Class Tyr.TyrActivateAbilitiesGameplayEffectComponent
// 0x0000 (0x0038 - 0x0038)
class UTyrActivateAbilitiesGameplayEffectComponent final : public UAbilitiesGameplayEffectComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrActivateAbilitiesGameplayEffectComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrActivateAbilitiesGameplayEffectComponent")
	}
	static class UTyrActivateAbilitiesGameplayEffectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrActivateAbilitiesGameplayEffectComponent>();
	}
};
DUMPER7_ASSERTS_UTyrActivateAbilitiesGameplayEffectComponent;

// Class Tyr.TyrDeterministicAction
// 0x0008 (0x0030 - 0x0028)
class UTyrDeterministicAction final : public UObject
{
public:
	class AActor*                                 TargetActor;                                       // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, Protected, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	void Activated();
	void Deactivated();
	void EndAction();
	void QueueAction();
	void Tick();

	class AActor* GetOwner() const;
	class AActor* GetTargetActor() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrDeterministicAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrDeterministicAction")
	}
	static class UTyrDeterministicAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrDeterministicAction>();
	}
};
DUMPER7_ASSERTS_UTyrDeterministicAction;

// Class Tyr.TyrActiveReloadReductionExecution
// 0x0008 (0x0048 - 0x0040)
class UTyrActiveReloadReductionExecution final : public UGameplayEffectExecutionCalculation
{
public:
	float                                         MinRemainingSeconds;                               // 0x0040(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrActiveReloadReductionExecution")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrActiveReloadReductionExecution")
	}
	static class UTyrActiveReloadReductionExecution* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrActiveReloadReductionExecution>();
	}
};
DUMPER7_ASSERTS_UTyrActiveReloadReductionExecution;

// Class Tyr.TyrActorComponent
// 0x0000 (0x00B8 - 0x00B8)
class UTyrActorComponent : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrActorComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrActorComponent")
	}
	static class UTyrActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrActorComponent>();
	}
};
DUMPER7_ASSERTS_UTyrActorComponent;

// Class Tyr.TyrWorldHealthBarWidget
// 0x0008 (0x0348 - 0x0340)
class UTyrWorldHealthBarWidget : public UUserWidget
{
public:
	class AActor*                                 OwningCharacter;                                   // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	void InitializeWidget();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrWorldHealthBarWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrWorldHealthBarWidget")
	}
	static class UTyrWorldHealthBarWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrWorldHealthBarWidget>();
	}
};
DUMPER7_ASSERTS_UTyrWorldHealthBarWidget;

// Class Tyr.TyrEntryHoverHost
// 0x0000 (0x0000 - 0x0000)
class ITyrEntryHoverHost final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrEntryHoverHost")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrEntryHoverHost")
	}
	static class ITyrEntryHoverHost* GetDefaultObj()
	{
		return GetDefaultObjImpl<ITyrEntryHoverHost>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ITyrEntryHoverHost;

// Class Tyr.TyrActorTagRegistrySubsystem
// 0x0078 (0x00A8 - 0x0030)
class UTyrActorTagRegistrySubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x78];                                      // 0x0030(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UTyrActorTagRegistrySubsystem* Get(const class UObject* WorldContextObject);

	TArray<class AActor*> GetActorsForGameplayTag(const struct FGameplayTag& RegistryTag);
	void RegisterActor(class AActor* Actor, const struct FGameplayTag& RegistryTag);
	void UnregisterActor(class AActor* Actor, const struct FGameplayTag& RegistryTag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrActorTagRegistrySubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrActorTagRegistrySubsystem")
	}
	static class UTyrActorTagRegistrySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrActorTagRegistrySubsystem>();
	}
};
DUMPER7_ASSERTS_UTyrActorTagRegistrySubsystem;

// Class Tyr.TyrViewModelFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UTyrViewModelFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool FindIndexByIntegerPredicate(const TArray<class UTyrViewModel*>& ViewModelArray, int32 TargetInteger, const TDelegate<void(const class UTyrViewModel* Element, int32 SearchInteger)>& Predicate, int32* OutIndex);
	static class UTyrGameStateViewModel* GetGameStateViewModel(const class UObject* WorldContextObject, TSubclassOf<class UTyrGameStateViewModel> ViewModelClass);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TyrViewModelFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TyrViewModelFunctionLibrary")
	}
	static class UTyrViewModelFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTyrViewModelFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UTyrViewModelFunctionLibrary;

// Class Tyr.TyrAdditionalEffectsNoCopyGameplayEffectComponent
// 0x0000 (0x0070 - 0x0070)
