#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TyrBushRendering

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function TyrBushRendering.TyrBushMeshComponent.GetTyrBushesBuffer
// 0x0008 (0x0008 - 0x0000)
struct TyrBushMeshComponent_GetTyrBushesBuffer final
{
public:
	class UTexture*                               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrBushMeshComponent_GetTyrBushesBuffer;

// Function TyrBushRendering.TyrBushRenderingBPLibrary.GetTyrBushesBuffer
// 0x0008 (0x0008 - 0x0000)
struct TyrBushRenderingBPLibrary_GetTyrBushesBuffer final
{
public:
	class UTexture*                               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrBushRenderingBPLibrary_GetTyrBushesBuffer;

// Function TyrBushRendering.TyrImpostorUtility.SetMeshNormalsAndTangents
// 0x0010 (0x0010 - 0x0000)
struct TyrImpostorUtility_SetMeshNormalsAndTangents final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TyrImpostorUtility_SetMeshNormalsAndTangents;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
