#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TyrNameModeration

#include "Basic.hpp"

#include "TyrNameModeration_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function TyrNameModeration.TyrNameModerationFunctionLibrary.FilterNameForDisplay
// 0x0020 (0x0020 - 0x0000)
struct TyrNameModerationFunctionLibrary_FilterNameForDisplay final
{
public:
	class FString                                 RawName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TyrNameModerationFunctionLibrary_FilterNameForDisplay;

// Function TyrNameModeration.TyrNameModerationFunctionLibrary.TryFilterNameForDisplay
// 0x0058 (0x0058 - 0x0000)
struct TyrNameModerationFunctionLibrary_TryFilterNameForDisplay final
{
public:
	class FString                                 RawName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutFilteredName;                                   // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTyrNameModerationReport               OutReport;                                         // 0x0020(0x0030)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TyrNameModerationFunctionLibrary_TryFilterNameForDisplay;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
