#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TyrNameModeration

#include "Basic.hpp"


SDK_NAMESPACE_START

// Enum TyrNameModeration.ETyrNameModerationResult
// NumValues: 0x0003
enum class ETyrNameModerationResult : uint8
{
	Allowed                                  = 0,
	Filtered                                 = 1,
	ETyrNameModerationResult_MAX             = 2,
};

// Enum TyrNameModeration.ETyrNameModerationRuleClass
// NumValues: 0x0006
enum class ETyrNameModerationRuleClass : uint8
{
	Embedded                                 = 0,
	StandaloneOnly                           = 1,
	ExactOnly                                = 2,
	EmbeddedAcrossWhitespace                 = 3,
	StandaloneAcrossWhitespace               = 4,
	ETyrNameModerationRuleClass_MAX          = 5,
};

// ScriptStruct TyrNameModeration.TyrNameModerationMatch
// 0x0020 (0x0020 - 0x0000)
struct FTyrNameModerationMatch final
{
public:
	class FString                                 Pattern;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETyrNameModerationRuleClass                   RuleClass;                                         // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bObfuscated;                                       // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StartIndex;                                        // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndIndex;                                          // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTyrNameModerationMatch;

// ScriptStruct TyrNameModeration.TyrNameModerationReport
// 0x0030 (0x0030 - 0x0000)
struct FTyrNameModerationReport final
{
public:
	ETyrNameModerationResult                      Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RulesetVersion;                                    // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoadedExternalRuleset;                            // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTyrNameModerationMatch>        Matches;                                           // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTyrNameModerationReport;

SDK_NAMESPACE_END
