#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_ArmorViewer_Shell

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_ArmorViewer_Shell.VM_ArmorViewer_Shell_C
// 0x0068 (0x00D8 - 0x0070)
class UVM_ArmorViewer_Shell_C final : public UTyrViewModel
{
public:
	struct FGameplayTag                           AmmoTag;                                           // 0x0070(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0078(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Description;                                       // 0x0088(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0098(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        Penetration;                                       // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShellPenetrationModifier;                          // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PenetrationOverride;                               // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateAmmunitionData(const struct FGameplayTag& InAmmunitionTag, const struct FTyrAmmunitionUIDataTableStruct& InAmmunitionData);
	void UpdateBasePenetration(double InPenetration);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_ArmorViewer_Shell_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_ArmorViewer_Shell_C")
	}
	static class UVM_ArmorViewer_Shell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_ArmorViewer_Shell_C>();
	}
};
DUMPER7_ASSERTS_UVM_ArmorViewer_Shell_C;

SDK_NAMESPACE_END
