#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_ArmorViewer

#include "Basic.hpp"

#include "DataRegistry_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_ArmorViewer.VM_ArmorViewer_C
// 0x0198 (0x0210 - 0x0078)
class UVM_ArmorViewer_C final : public UTyrGlobalViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_BaseTank_C*                         SpawnedVehicle;                                    // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_C*                          TargetVehicle;                                     // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_C*                          ShooterVehicle;                                    // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UVM_Vehicle_C*>                  Vehicles;                                          // 0x0098(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, double>             VehicleBasePenetration;                            // 0x00A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        ShooterPenetration;                                // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVM_ArmorViewer_Shell_C*                ShellViewModel;                                    // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UVM_ArmorViewer_Shell_C*>        Shells;                                            // 0x0108(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                CameraTargetOffset;                                // 0x0118(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CameraRestingPitch;                                // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CameraRestingYaw;                                  // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVM_ArmorViewer_HitResult_C*            HitResult;                                         // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanDisplayHitResult;                              // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDisplayingHitResult;                            // 0x0149(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasRestrictedTurretYaw;                           // 0x014A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TurretYawMin;                                      // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TurretYawMax;                                      // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 VehicleRotator;                                    // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDisplayingArmor;                                // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsScreenshotMode;                                 // 0x0169(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ZoomLevel;                                         // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumZoomSteps;                                      // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CameraFieldOfViewMin;                              // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CameraFieldOfViewMax;                              // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CameraDistanceMin;                                 // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CameraDistanceMax;                                 // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ZoomMinAngularSize;                                // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ZoomMaxAngularSize;                                // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VehicleSizeForZoom;                                // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                  PendingSublevel;                                   // 0x01B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                  ActiveSublevel;                                    // 0x01E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	bool                                          bCanUnloadActiveSublevel;                          // 0x0208(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ClearHitOnTarget();
	void DisplayHitOnTarget(const struct FHitResult& InHit, const struct FVector& InHitVector);
	void ExecuteUbergraph_VM_ArmorViewer(int32 EntryPoint);
	void InitializeShellViewModels();
	void InitializeVehicleViewModels();
	void OnInitialized();
	void SetCanDisplayHitOnTarget(bool bInCanDisplay);
	void SetLastSelectedPenetrationScenario();
	void SetShell(const struct FGameplayTag& InAmmoTag);
	void SetShooterVehicle(const struct FGameplayTag& InVehicleTag);
	void SetTargetVehicle(const struct FGameplayTag& InVehicleTag);
	void UpdateShellViewModels(class UVM_Vehicle_C* InVehicleViewModel);
	void UpdateShooterPenetration();

	class UVM_ArmorViewer_Shell_C* GetLastSelectedShell() const;
	class UVM_Vehicle_C* GetLastSelectedShooter() const;
	class UVM_Vehicle_C* GetLastSelectedTarget() const;
	class FText GetPenetrationScenarioText() const;
	class UVM_ArmorViewer_Shell_C* GetShellFromTag(const struct FGameplayTag& InAmmoTag) const;
	double GetShellPenValue() const;
	struct FGameplayTag GetShooterVehicleTag() const;
	struct FGameplayTag GetTargetVehicleTag() const;
	class UVM_Vehicle_C* GetVehicleFromTag(const struct FGameplayTag& InVehicleTag) const;
	bool IsValidModuleHit(class FName InModuleName, struct FGameplayTag* Module_Type_Tag) const;
	void ShouldCreateNewShellViewModel(double InPenetrationModifier, bool* bShouldCreateNew) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_ArmorViewer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_ArmorViewer_C")
	}
	static class UVM_ArmorViewer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_ArmorViewer_C>();
	}
};
DUMPER7_ASSERTS_UVM_ArmorViewer_C;

SDK_NAMESPACE_END
