#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_ArmorViewer_HitResult

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "E_ArmorHit_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_ArmorViewer_HitResult.VM_ArmorViewer_HitResult_C
// 0x00A8 (0x0118 - 0x0070)
class UVM_ArmorViewer_HitResult_C final : public UTyrViewModel
{
public:
	E_ArmorHit                                    ArmorHit;                                          // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Result;                                            // 0x0078(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Description;                                       // 0x0088(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        EffectiveArmor;                                    // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ArmorImpactDetail;                                 // 0x00A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsOvermatch;                                      // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ModuleTypeName;                                    // 0x00B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, class FText>        ModuleTypeMap;                                     // 0x00C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetArmorImpactDetail(double InAngle, int32 InThickness, double InEffectiveArmor);
	void SetBlockedShot();
	void SetIsOvermatch(bool bInIsOvermatch);
	void SetModuleShot(bool bInIsTreadsModule, const struct FGameplayTag& ModuleTypeTag);
	void SetPartialPenetratingShot();
	void SetPenetratingShot();

	class FText GetEffectiveArmorText() const;
	struct FLinearColor GetResultColor() const;
	struct FSlateColor GetResultSlateColor() const;
	class FText GetResultText() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_ArmorViewer_HitResult_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_ArmorViewer_HitResult_C")
	}
	static class UVM_ArmorViewer_HitResult_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_ArmorViewer_HitResult_C>();
	}
};
DUMPER7_ASSERTS_UVM_ArmorViewer_HitResult_C;

SDK_NAMESPACE_END
