#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Ammunition

#include "Basic.hpp"

#include "DataRegistry_structs.hpp"
#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Ammunition.VM_Ammunition_C
// 0x0050 (0x00C8 - 0x0078)
class UVM_Ammunition_C final : public UTyrGlobalViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UVM_Ammunition_Shell_C*>         CurrentSlotShells;                                 // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   CurrentSlotName;                                   // 0x0090(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         EquippedShellIndex;                                // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVM_Ammunition_Shell_C*>         SecondaryShells;                                   // 0x00A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UVM_Ammunition_Shell_C*>         TertiaryShells;                                    // 0x00B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddShellViewModel(const struct FGameplayTag& InAmmoTag, const struct FGameplayTag& InItemTag, const struct FTyrAmmunitionUIDataTableStruct& InAmmoData, const TArray<class UVM_Ammunition_Shell_C*>& InShellArray);
	void ExecuteUbergraph_VM_Ammunition(int32 EntryPoint);
	void FilterForSecondarySlot();
	void FilterForTertiarySlot();
	void GetValidatedShell(TArray<struct FGameplayTag>& InShells, int32 InSlotIndex, struct FGameplayTag* ShellTag);
	void InitializeShells();
	struct FGameplayTag ItemTagFromAmmoTag(const struct FGameplayTag& InComponentTag);
	void OnInitialized();
	void OnInventoryReceived(const struct FTyrInventoryMessage& Payload);
	void OnMessageReceived_4908FD8E45BF7CF82B64DFB3807CC810(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void SetUnlockConfirmed(const struct FGameplayTag& InAmmoTag, bool bInDidSucceed);
	void SetWaitingToUnlock(const struct FGameplayTag& InAmmoTag);
	void SortShellsByRecommended(const class UObject* InA, const class UObject* InB, bool* Result);
	void TryClearBreadcrumbsForSecondaryShells();
	void TryClearBreadcrumbsForTertiaryShells();
	void UpdateCurrencyPrices(TArray<class UVM_Ammunition_Shell_C*>& InShells);
	void UpdateEquippedShell(const struct FGameplayTag& InAmmoTag, TArray<class UVM_Ammunition_Shell_C*>& InShellsArray);
	void UpdateForLoadout(const struct FGameplayTag& InEquippedSecondaryShell, const struct FGameplayTag& InEquippedTertiaryShell, const struct FGameplayTagContainer& InUnlockedShells, TArray<struct FGameplayTag>& InRecommendedShells, bool bInIsSecondaryUnlocked, bool bInIsTertiaryUnlocked, const struct FGameplayTag& InVehicleTag);
	void UpdateUnlockedShells(TArray<class UVM_Ammunition_Shell_C*>& InShellsArray, const struct FGameplayTagContainer& InUnlockedShells, const struct FGameplayTag& InRecommendedShell, bool bInIsSlotUnlocked);
	void UpdateVehicleTag(TArray<class UVM_Ammunition_Shell_C*>& InShellArray, const struct FGameplayTag& InVehicleTag);

	void FindEquippedShell(TArray<class UVM_Ammunition_Shell_C*>& InShells, bool* bHasEquippedShell, int32* IndexOfEquippedShell) const;
	class UVM_Ammunition_Shell_C* GetEquippedSlotShell() const;
	class UVM_Ammunition_Shell_C* GetSecondaryShell(const struct FGameplayTag& InAmmoTag) const;
	void GetShellViewModel(const struct FGameplayTag& InAmmoTag, TArray<class UVM_Ammunition_Shell_C*>& InShellsArray, class UVM_Ammunition_Shell_C** ViewModel) const;
	class UVM_Ammunition_Shell_C* GetTertiaryShell(const struct FGameplayTag& InAmmoTag) const;
	bool HasEquippedSlotShell() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Ammunition_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Ammunition_C")
	}
	static class UVM_Ammunition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Ammunition_C>();
	}
};
DUMPER7_ASSERTS_UVM_Ammunition_C;

SDK_NAMESPACE_END
