#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Battle

#include "Basic.hpp"

#include "FieldNotification_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function VM_Battle.VM_Battle_C.ExecuteUbergraph_VM_Battle
// 0x0060 (0x0060 - 0x0000)
struct VM_Battle_C_ExecuteUbergraph_VM_Battle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId;             // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_1;           // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_2;           // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_3;           // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_4;           // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_5;           // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_6;           // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_7;           // 0x003C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_8;           // 0x0044(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
};
DUMPER7_ASSERTS_VM_Battle_C_ExecuteUbergraph_VM_Battle;

// Function VM_Battle.VM_Battle_C.UpdateRankedResult
// 0x00D0 (0x00D0 - 0x0000)
struct VM_Battle_C_UpdateRankedResult final
{
public:
	bool                                          bInIsRanked;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrRankingUpdateNotification          InResult;                                          // 0x0008(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId;             // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_1;           // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_2;           // 0x00A4(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_3;           // 0x00AC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array_1;                          // 0x00B8(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue; // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue_1; // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Battle_C_UpdateRankedResult;

// Function VM_Battle.VM_Battle_C.DidAnyAssistDamage
// 0x0002 (0x0002 - 0x0000)
struct VM_Battle_C_DidAnyAssistDamage final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Battle_C_DidAnyAssistDamage;

// Function VM_Battle.VM_Battle_C.DidAnyDamage
// 0x0002 (0x0002 - 0x0000)
struct VM_Battle_C_DidAnyDamage final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Battle_C_DidAnyDamage;

// Function VM_Battle.VM_Battle_C.DidDamageAndAssistDamage
// 0x0004 (0x0004 - 0x0000)
struct VM_Battle_C_DidDamageAndAssistDamage final
{
public:
	bool                                          DidBoth;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Battle_C_DidDamageAndAssistDamage;

// Function VM_Battle.VM_Battle_C.GetDeltaMMRColor
// 0x0060 (0x0060 - 0x0000)
struct VM_Battle_C_GetDeltaMMRColor final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x004C(0x0014)()
};
DUMPER7_ASSERTS_VM_Battle_C_GetDeltaMMRColor;

// Function VM_Battle.VM_Battle_C.GetDeltaMMRText
// 0x0110 (0x0110 - 0x0000)
struct VM_Battle_C_GetDeltaMMRText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   Temp_text_Variable;                                // 0x0010(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0038(0x0010)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0098(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0100(0x0010)()
};
DUMPER7_ASSERTS_VM_Battle_C_GetDeltaMMRText;

// Function VM_Battle.VM_Battle_C.GetGameModeBorder
// 0x0230 (0x0230 - 0x0000)
struct VM_Battle_C_GetGameModeBorder final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x00B0)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00B4(0x0014)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00CC(0x0014)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0xF];                                       // 0x00E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x00F0(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrushOutlineSettings             K2Node_MakeStruct_SlateBrushOutlineSettings;       // 0x0110(0x0040)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0150(0x0014)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0164(0x0014)()
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0180(0x00B0)()
};
DUMPER7_ASSERTS_VM_Battle_C_GetGameModeBorder;

// Function VM_Battle.VM_Battle_C.GetGameModeTextColor
// 0x002C (0x002C - 0x0000)
struct VM_Battle_C_GetGameModeTextColor final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_SelectSlateColor_ReturnValue;             // 0x0018(0x0014)()
};
DUMPER7_ASSERTS_VM_Battle_C_GetGameModeTextColor;

// Function VM_Battle.VM_Battle_C.GetGameModeVisibility
// 0x0006 (0x0006 - 0x0000)
struct VM_Battle_C_GetGameModeVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Battle_C_GetGameModeVisibility;

// Function VM_Battle.VM_Battle_C.GetResultColor
// 0x0014 (0x0014 - 0x0000)
struct VM_Battle_C_GetResultColor final
{
public:
	struct FLinearColor                           ResultColor;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Battle_C_GetResultColor;

// Function VM_Battle.VM_Battle_C.GetResultText
// 0x0018 (0x0018 - 0x0000)
struct VM_Battle_C_GetResultText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Battle_C_GetResultText;

// Function VM_Battle.VM_Battle_C.GetRewardSCText
// 0x0090 (0x0090 - 0x0000)
struct VM_Battle_C_GetRewardSCText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0010)()
};
DUMPER7_ASSERTS_VM_Battle_C_GetRewardSCText;

// Function VM_Battle.VM_Battle_C.GetRewardStatusText
// 0x0018 (0x0018 - 0x0000)
struct VM_Battle_C_GetRewardStatusText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Battle_C_GetRewardStatusText;

// Function VM_Battle.VM_Battle_C.GetRewardXPText
// 0x0088 (0x0088 - 0x0000)
struct VM_Battle_C_GetRewardXPText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0010)()
};
DUMPER7_ASSERTS_VM_Battle_C_GetRewardXPText;

// Function VM_Battle.VM_Battle_C.IsRankedBattle
// 0x0002 (0x0002 - 0x0000)
struct VM_Battle_C_IsRankedBattle final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Battle_C_IsRankedBattle;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
