#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Clan_Member

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Clan_Member.VM_Clan_Member_C
// 0x00A8 (0x0118 - 0x0070)
class UVM_Clan_Member_C final : public UTyrViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0070(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                 UserId;                                            // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int64                                         DiscordUserId;                                     // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0090(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2DDynamic*                      ProfileIcon;                                       // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocalPlayer;                                    // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLeader;                                         // 0x00A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInDiscordServer;                                // 0x00AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayingTyr;                                     // 0x00AB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasTitle;                                         // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrPlayerTitleData                    PlayerTitle;                                       // 0x00B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         ContributionAmountXP;                              // 0x0100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ProfileIconURL;                                    // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void DownloadProfileIcon(const class FString& ProfileIconURL_0);
	void ExecuteUbergraph_VM_Clan_Member(int32 EntryPoint);
	void OnFail_CD8283DC47064264BD7E29AD94F80147(class UTexture2DDynamic* Texture);
	void OnKickMember();
	void OnResult_2A2E76454FD7257E8A92EA8486BC7B6C(ETyrMessagingResult Result);
	void OnResult_DFA23A3C40E75146F7730196F93F96AA(ETyrMessagingResult Result);
	void OnSuccess_CD8283DC47064264BD7E29AD94F80147(class UTexture2DDynamic* Texture);
	void OnTransferOwnership();
	void ShowContextActions(class UTyrContextMenuWidget* InContextMenu);
	void UpdateFromClanMemberData(const class FString& InUserId, const class FString& InLeaderId, const class FString& InLocalPlayerId, const struct FMemberWeeklyProgress& InMemberProgression);
	void UpdatePlayerDiscordId(int64 InDiscordUserId);
	void UpdatePlayerProfile();

	void GetContributionAmountText(class FText* Result) const;
	struct FSlateColor GetContributionTextColor() const;
	struct FLinearColor GetLeaderIndicatorColor() const;
	struct FSlateColor GetNameTextColor() const;
	bool HasAnyContextActions() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Clan_Member_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Clan_Member_C")
	}
	static class UVM_Clan_Member_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Clan_Member_C>();
	}
};
DUMPER7_ASSERTS_UVM_Clan_Member_C;

SDK_NAMESPACE_END
