#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_ConsumableBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_ConsumableBase.VM_ConsumableBase_C
// 0x0128 (0x01A0 - 0x0078)
class UVM_ConsumableBase_C : public UTyrGlobalViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Amount;                                            // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0088(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UTexture2D>              Image;                                             // 0x0098(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayTag                           ConsumableTag;                                     // 0x00C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ConsumableContainerTag;                            // 0x00C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 ItemId;                                            // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 ConsumableItemName;                                // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FItemInformation                       ItemInformation;                                   // 0x00F0(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         SoftCurrencyCost;                                  // 0x0190(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SoftCurrencyAmountGranted;                         // 0x0194(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanPurchaseWithSoftCurrency;                      // 0x0198(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsWaitingForPurchaseConfirmation;                 // 0x0199(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VM_ConsumableBase(int32 EntryPoint);
	void On_Inventory_Received_Message(const struct FTyrInventoryMessage& Payload);
	void OnFailure_BBBA40C04914F6DDE6C10F9194EBE187(const TArray<struct FSnapserPurchasedItemResult>& GrantedItems, const struct FTyrOnlineErrorWrapper& Error);
	void OnInitialized();
	void OnInventoryItemAddedMessage(const struct FTyrInventoryItemsAddedMessage& TyrInventoryItemsAddedMessage);
	void OnInventoryItemConsumedMessage(const struct FTyrInventoryItemConsumedMessage& TyrInventoryItemConsumedMessage);
	void OnMessageReceived_6F36013447C38B7D046978A097309215(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_AFC176FA4706502C71CB9082F8EBF130(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_B08079E548DF033E063B949B86347F7C(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnSuccess_BBBA40C04914F6DDE6C10F9194EBE187(const TArray<struct FSnapserPurchasedItemResult>& GrantedItems, const struct FTyrOnlineErrorWrapper& Error);
	void PurchaseConsumable();
	void RefreshConsumableContainer();
	void RefreshConsumableItem();

	void GetAmountText(class FText* AmountText) const;
	void GetDescription(class FText* Description) const;
	void HasAnyOfConsumable(bool* CanApply) const;
	void SetBoosterIconColor(struct FLinearColor* NewParam) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_ConsumableBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_ConsumableBase_C")
	}
	static class UVM_ConsumableBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_ConsumableBase_C>();
	}
};
DUMPER7_ASSERTS_UVM_ConsumableBase_C;

SDK_NAMESPACE_END
