#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_ClaimExperience_VehicleUnlock

#include "Basic.hpp"

#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_ClaimExperience_VehicleUnlock.VM_ClaimExperience_VehicleUnlock_C
// 0x0088 (0x00F8 - 0x0070)
class UVM_ClaimExperience_VehicleUnlock_C final : public UTyrViewModel
{
public:
	class FName                                   Trackid;                                           // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   PilotName;                                         // 0x0078(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   VehicleName;                                       // 0x0088(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UMaterialInterface>      SplashArt;                                         // 0x0098(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Startxp;                                           // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GainedXP;                                          // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Requiredxp;                                        // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDidUnlockVehicle;                                 // 0x00CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        GainAnimationProgress;                             // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsBonusXP;                                        // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 BonusGainedXP;                                     // 0x00E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsRepeatableUnlock;                               // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsOverflowDuplicate;                              // 0x00F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddBonusGainedXP(const int32& InBonusXP, int32* LeftoverBonusXP);
	void AddGainedXP(int32 InClaimedXP, bool bInDidUnlockVehicle, int32* OverflowXP);
	void HandleNextBonusGain(bool* bDidHandleBonusGain);
	void InitializeFromVehicleTrack(class UVM_Vehicle_C* InVehicleTrack);
	void ResolveBonusGainedXP();

	double GetProgressAmount() const;
	class FText GetProgressGainedText() const;
	class FText GetProgressText() const;
	double GetTotalProgressAmount() const;
	bool HasAnyRemainingBonusToHandle() const;
	bool HasGainedNonBonusXP() const;
	bool IsEnoughToUnlock(int32 InXP) const;
	struct FLinearColor ResetMaterialOffset() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_ClaimExperience_VehicleUnlock_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_ClaimExperience_VehicleUnlock_C")
	}
	static class UVM_ClaimExperience_VehicleUnlock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_ClaimExperience_VehicleUnlock_C>();
	}
};
DUMPER7_ASSERTS_UVM_ClaimExperience_VehicleUnlock_C;

SDK_NAMESPACE_END
