#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Cosmetics_Vehicle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"
#include "TyrSharedTypes_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Cosmetics_Vehicle.VM_Cosmetics_Vehicle_C
// 0x0108 (0x0178 - 0x0070)
class UVM_Cosmetics_Vehicle_C final : public UTyrViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0070(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           VehicleTag;                                        // 0x0078(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UVM_Cosmetics_Skin_C*>           Skins;                                             // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UVM_Cosmetics_Skin_C*                   SelectedSkin;                                      // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UVM_Cosmetics_Charm_C*>          Charms;                                            // 0x0098(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UVM_Cosmetics_Charm_C*                  SelectedCharm;                                     // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UVM_Cosmetics_VFX_C*>            DeathVFX;                                          // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UVM_Cosmetics_VFX_C*                    SelectedDeathVFX;                                  // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasAnyUnsavedChanges;                             // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStyleItemsBlob                        LastSavedStyleItemsBlob;                           // 0x00D0(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FStyleItemsBlob                        PendingStyleItemsBlob;                             // 0x0110(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnSaveSucceeded;                                   // 0x0150(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnsavedChangesChanged;                           // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAudioComponent*                        SFXPurchase;                                       // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void CheckForUnsavedChanges();
	void ExecuteUbergraph_VM_Cosmetics_Vehicle(int32 EntryPoint);
	void FindBaseSkinTag(bool* bDidFind, struct FGameplayTag* BaseSkinTag);
	void MakeStyleItemsBlob(struct FStyleItemsBlob* StyleItemsBlob);
	void MakeStyleWithNewCharm(class UVM_Cosmetics_Charm_C* InCharm, struct FStyleItemsBlob* StyleItemsBlob);
	void MakeStyleWithNewDeathVfx(class UVM_Cosmetics_VFX_C* InVFX, struct FStyleItemsBlob* StyleItemsBlob);
	void MakeStyleWithNewSkin(class UVM_Cosmetics_Skin_C* InSkin, struct FStyleItemsBlob* StyleItemsBlob);
	void OnAllCosmeticsInitialized();
	void OnCharmsInitialized();
	void OnCosmeticsUserDataUpdated();
	void OnDeathVfxInitialized();
	void OnEquipCharm(class UVM_Cosmetics_Charm_C* InCharmToEquip);
	void OnEquipDeathVfx(class UVM_Cosmetics_VFX_C* InVfxToEquip);
	void OnEquipSkin(class UVM_Cosmetics_Skin_C* InSkinToEquip);
	void OnFailure_3EBFC8D64AB187B85EB5BAB89CC4F35F(const TArray<struct FSnapserPurchasedItemResult>& GrantedItems, const struct FTyrOnlineErrorWrapper& Error);
	void OnFailure_98B30DA94B2A8AF1FA106695610C2156(const class FString& ErrorMessage);
	void OnFailure_A8A8D7234AF911E90C5EBD9B2791A226(const TArray<struct FSnapserPurchasedItemResult>& GrantedItems, const struct FTyrOnlineErrorWrapper& Error);
	void OnFailure_E6F065B147828510C9782ABA64C4FA96(const TArray<struct FSnapserPurchasedItemResult>& GrantedItems, const struct FTyrOnlineErrorWrapper& Error);
	void OnPurchaseCharm(class UVM_Cosmetics_Charm_C* InCharmToEquip);
	void OnPurchaseDeathVfx(class UVM_Cosmetics_VFX_C* InVfxToEquip);
	void OnPurchaseSkin(class UVM_Cosmetics_Skin_C* InSkinToEquip);
	void OnResult_58AEA96C4CEF06D9A864D49CBB0F6C8A(ETyrMessagingResult Result);
	void OnResult_5AA695834C119CB8F20FB4A55C8FA1E2(ETyrMessagingResult Result);
	void OnResult_699F0EEF421EB7817C016C99CA2FA80D(ETyrMessagingResult Result);
	void OnResult_EA580D64458ECB08155291B05E44CBAF(ETyrMessagingResult Result);
	void OnResult_ED157F0A4991DBE75FE52DB8C2B9F1AC(ETyrMessagingResult Result);
	void OnResult_FB572C844172CE22BE5D4FB9D5F0A75F(ETyrMessagingResult Result);
	void OnSaveAnyStyleChanges();
	void OnSkinsInitialized();
	void OnSuccess_3EBFC8D64AB187B85EB5BAB89CC4F35F(const TArray<struct FSnapserPurchasedItemResult>& GrantedItems, const struct FTyrOnlineErrorWrapper& Error);
	void OnSuccess_98B30DA94B2A8AF1FA106695610C2156(const struct FGameplayTag& VehicleTag_0, bool bSuccess, const TArray<class FString>& ValidationErrors);
	void OnSuccess_A8A8D7234AF911E90C5EBD9B2791A226(const TArray<struct FSnapserPurchasedItemResult>& GrantedItems, const struct FTyrOnlineErrorWrapper& Error);
	void OnSuccess_E6F065B147828510C9782ABA64C4FA96(const TArray<struct FSnapserPurchasedItemResult>& GrantedItems, const struct FTyrOnlineErrorWrapper& Error);
	void PreviewCharm(class UVM_Cosmetics_Charm_C* InCharm);
	void PreviewDeathVfx(class UVM_Cosmetics_VFX_C* InVFX);
	void PreviewSkin(class UVM_Cosmetics_Skin_C* InSkin);
	void RefreshAllEquipped();
	void RefreshCharmOwnership();
	void RefreshEquippedCharm();
	void RefreshEquippedDeathVfx();
	void RefreshEquippedSkin();
	void RefreshSkinOwnership();
	void RefreshVfxOwnership();
	void ResetSelectionToEquipped();
	void SelectCharm(class UVM_Cosmetics_Charm_C* InCharm);
	void SelectDeathVfx(class UVM_Cosmetics_VFX_C* InVFX, bool bInPlayVFX);
	void SelectSkin(class UVM_Cosmetics_Skin_C* InSkin);
	void SetCharmEquipped(class UObject* InCharmToEquip);
	void SetDeathVfxEquipped(class UObject* InVfxToEquip);
	void SetSkinEquipped(class UObject* InSkinToEquip);
	void StopDeathVfxPreview();
	void TryEquipCharm(class UVM_Cosmetics_Charm_C* InCharm, bool* bDidEquip);
	void TryEquipDeathVfx(class UVM_Cosmetics_VFX_C* InVFX, bool* bDidEquip);
	void TryEquipSkin(class UVM_Cosmetics_Skin_C* InSkin, bool* bDidEquip);
	void UpdateEquippedCharm(const struct FGameplayTag& InEquippedCharmTag);
	void UpdateEquippedDeathVfx(const struct FGameplayTag& InEquippedCharmTag);
	void UpdateEquippedSkin(const struct FGameplayTag& InEquippedSkinTag);

	void GetEquippedCharmTag(struct FGameplayTag* CharmTag) const;
	void GetEquippedDeathVfxTag(struct FGameplayTag* VfxTag) const;
	void GetEquippedSkinTag(struct FGameplayTag* SkinTag) const;
	void MakeCosmeticItemArrayOrEmpty(const struct FGameplayTag& InItemTag, TArray<struct FGameplayTag>* Array) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Cosmetics_Vehicle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Cosmetics_Vehicle_C")
	}
	static class UVM_Cosmetics_Vehicle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Cosmetics_Vehicle_C>();
	}
};
DUMPER7_ASSERTS_UVM_Cosmetics_Vehicle_C;

SDK_NAMESPACE_END
