#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Clans

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Clans.VM_Clans_C
// 0x00B0 (0x0250 - 0x01A0)
class UVM_Clans_C final : public UTyrClansViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bIsPlayerInClan;                                   // 0x01A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Clan_C*                             Clan;                                              // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UVM_Clan_Discord_Server_C*>      DiscordServers;                                    // 0x01B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsFetchingDiscordServers;                         // 0x01C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CreateClanCost_SoftCurrency;                       // 0x01CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDiscordLinked;                                  // 0x01D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsWaitingForDiscordLink;                          // 0x01D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDiscordClientReady;                             // 0x01D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D3[0x5];                                      // 0x01D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_DiscordLink_C*                      DiscordLink;                                       // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnDiscordChannelsChanged;                          // 0x01E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTyrOnlineErrorWrapper                 LastRequestError;                                  // 0x01F0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 PendingClanName;                                   // 0x0218(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 PendingJoinCode;                                   // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int64                                         PendingLinkedServerId;                             // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         PendingLinkedChannelId;                            // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsWaitingForCreateValidation;                     // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsWaitingForJoinValidation;                       // 0x0249(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PendingClanIsPrivate;                              // 0x024A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrDiscordLinkState                          DiscordLinkState;                                  // 0x024B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AfterPush_4B9BA5A54C17B92040C84EAC02F69389(class UCommonActivatableWidget* UserWidget);
	void BeforePush_4B9BA5A54C17B92040C84EAC02F69389(class UCommonActivatableWidget* UserWidget);
	void BroadcastDiscordChannelsChanged();
	void ClearSelectedDiscordChannel();
	class UTyrGameDialogDescriptor* CreateClanDialogDescriptor();
	class UVM_Dialog_TextInput_C* CreateClanNameInputViewModel();
	class UTyrGameDialogDescriptor* CreateConfirmClanNameDescriptor();
	class UTyrGameDialogDescriptor* CreateJoinCodeDialogDescriptor();
	class UVM_Dialog_TextInput_C* CreateJoinCodeInputViewModel();
	void CreateNewClan(const TDelegate<void(bool bSuccess)>& InCompleteDelegate);
	void ExecuteUbergraph_VM_Clans(int32 EntryPoint);
	void FetchDiscordServers();
	void InitializeFromConfig();
	void JoinClan(const class FString& InJoinCode, const TDelegate<void(bool bSuccess)>& InCompleteDelegate);
	void LinkDiscord();
	void OnAutoJoinClan();
	void OnClanDeleted(const struct FClan& DeletedClan);
	void OnClanMemberJoined(const class FString& MemberDisplayName);
	void OnClansError(const struct FTyrOnlineErrorWrapper& Error);
	void OnCreateClanResult(bool bSuccess, const struct FClan& Clan_0, const struct FTyrOnlineErrorWrapper& Error);
	void OnDeinitialized();
	void OnDeleteClan();
	void OnDeleteClanResult(bool bSuccess, const struct FTyrOnlineErrorWrapper& Error);
	void OnDiscordClientStatusChanged(class UObject* Object, const struct FFieldNotificationId& Field);
	void OnDiscordLinkStateChanged(class UObject* Object, const struct FFieldNotificationId& Field);
	void OnEnterClanName();
	void OnEnterJoinCode();
	void OnGetDiscordServersComplete(bool bSuccess, const TArray<struct FDiscordGuildInfo>& guilds, const struct FTyrOnlineErrorWrapper& Error);
	void OnInitialPlayerReady();
	void OnInviteToClanDiscordResult(bool bSuccess, const class FString& inviteUrl, const struct FTyrOnlineErrorWrapper& Error);
	void OnJoinClanResult(bool bSuccess, const struct FClan& Clan_0, const struct FTyrOnlineErrorWrapper& Error);
	void OnKickClanMemberResult(bool bSuccess, const class FString& MemberUserId, const struct FTyrOnlineErrorWrapper& Error);
	void OnKickMember(class UVM_Clan_Member_C* ClanMember);
	void OnKickMemberComplete(bool bSuccess);
	void OnLeaveClan();
	void OnLeaveClanResult(bool bSuccess, const struct FTyrOnlineErrorWrapper& Error);
	void OnMakeClanPublic(bool bInPublicClan);
	void OnMessageReceived_BB5568D44E30D8ABE8281EBE48DE0189(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnReauthorizeDiscord();
	void OnRelinkDiscordChannel();
	void OnResult_023A8AA744534080D2D596A58745328E(ETyrMessagingResult Result);
	void OnResult_3814A1B04BE1B12D0F04F283F9F1C278(ETyrMessagingResult Result);
	void OnResult_834E6CB24A8F917B6C6645A29C098639(ETyrMessagingResult Result);
	void OnResult_9892BBAA40C24FDC29441784E1DE869A(ETyrMessagingResult Result);
	void OnResult_B44592A146AEDCF633F39E9E6EAEC3A0(ETyrMessagingResult Result);
	void OnResult_E20E0BC24707648FC8BB458B14570DA2(ETyrMessagingResult Result);
	void OnSetClanPublicResult(bool bSuccess, const struct FTyrOnlineErrorWrapper& Error);
	void OnShowLastClansError();
	void OnSubmitRelinkRequest();
	void OnTransferClanLeadershipResult(bool bSuccess, const class FString& NewLeaderUserId, const struct FTyrOnlineErrorWrapper& Error);
	void OnTransferOwnership(class UVM_Clan_Member_C* ClanMember);
	void ToggleLinkedDiscordChannel(int64 InServerId, int64 InChannelId);
	void UpdateClanMembership();
	void UpdateDiscordLinkState();
	void UpdateDiscordServers(const TArray<struct FDiscordGuildInfo>& InDiscordServerData);

	bool CanLinkDiscord() const;
	void GetClanNameValidationMessage(class FText* Result) const;
	int32 GetDiscordServerFetchState() const;
	class FText GetLinkDiscordButtonLabel() const;
	class FText GetNoDiscordServersMessage() const;
	bool HasErrorMessage() const;
	bool HasSelectedDiscordChannel() const;
	bool IsDiscordUnlinked() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Clans_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Clans_C")
	}
	static class UVM_Clans_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Clans_C>();
	}
};
DUMPER7_ASSERTS_UVM_Clans_C;

SDK_NAMESPACE_END
