#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Currency

#include "Basic.hpp"

#include "FieldNotification_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function VM_Currency.VM_Currency_C.ExecuteUbergraph_VM_Currency
// 0x0150 (0x0150 - 0x0000)
struct VM_Currency_C_ExecuteUbergraph_VM_Currency final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrInventoryMessage                   Temp_struct_Variable;                              // 0x0008(0x0010)(NoDestructor)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTyrInventoryCurrencyMessage           Temp_struct_Variable_2;                            // 0x0040(0x000C)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTyrInventoryCurrencyMessage           Temp_struct_Variable_3;                            // 0x0070(0x000C)(NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_4;                            // 0x007C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_1;                            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_1;  // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId;             // 0x009C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_1;           // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array_1;                          // 0x00C0(0x0010)(ReferenceParm)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_2;           // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array_2;                          // 0x00D8(0x0010)(ReferenceParm)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_3;           // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array_3;                          // 0x00F0(0x0010)(ReferenceParm)
	struct FTyrInventoryMessage                   K2Node_CustomEvent_Payload_1;                      // 0x0100(0x0010)(NoDestructor)
	struct FTyrInventoryMessage                   Temp_struct_Variable_5;                            // 0x0110(0x0010)(NoDestructor)
	int32                                         CallFunc_GetCurrency_ReturnValue;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrency_ReturnValue_1;                // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue; // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue_1; // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_1;                 // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_1;                  // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_1;                // 0x0138(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTyrInventoryCurrencyMessage           K2Node_CustomEvent_Payload;                        // 0x0140(0x000C)(NoDestructor)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue_2; // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue_3; // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x014E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Currency_C_ExecuteUbergraph_VM_Currency;

// Function VM_Currency.VM_Currency_C.On Currency Updated Message
// 0x000C (0x000C - 0x0000)
struct VM_Currency_C_On_Currency_Updated_Message final
{
public:
	struct FTyrInventoryCurrencyMessage           Payload;                                           // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_VM_Currency_C_On_Currency_Updated_Message;

// Function VM_Currency.VM_Currency_C.On Inventory Received Message
// 0x0010 (0x0010 - 0x0000)
struct VM_Currency_C_On_Inventory_Received_Message final
{
public:
	struct FTyrInventoryMessage                   Payload;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_VM_Currency_C_On_Inventory_Received_Message;

// Function VM_Currency.VM_Currency_C.OnMessageReceived_5DE6670E4EE40C870B2BBC87F2239BD2
// 0x0010 (0x0010 - 0x0000)
struct VM_Currency_C_OnMessageReceived_5DE6670E4EE40C870B2BBC87F2239BD2 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Currency_C_OnMessageReceived_5DE6670E4EE40C870B2BBC87F2239BD2;

// Function VM_Currency.VM_Currency_C.OnMessageReceived_B9436B9E4D3A0A0C50461D8AA08D9EAF
// 0x0010 (0x0010 - 0x0000)
struct VM_Currency_C_OnMessageReceived_B9436B9E4D3A0A0C50461D8AA08D9EAF final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Currency_C_OnMessageReceived_B9436B9E4D3A0A0C50461D8AA08D9EAF;

// Function VM_Currency.VM_Currency_C.GetHardCurrencyText
// 0x0020 (0x0020 - 0x0000)
struct VM_Currency_C_GetHardCurrencyText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_VM_Currency_C_GetHardCurrencyText;

// Function VM_Currency.VM_Currency_C.GetSoftCurrencyText
// 0x0020 (0x0020 - 0x0000)
struct VM_Currency_C_GetSoftCurrencyText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_VM_Currency_C_GetSoftCurrencyText;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
