#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Cosmetics_VFX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Cosmetics_VFX.VM_Cosmetics_VFX_C
// 0x0068 (0x00D8 - 0x0070)
class UVM_Cosmetics_VFX_C final : public UTyrViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0070(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           VfxTag;                                            // 0x0078(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   VfxName;                                           // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   UnlockMessage;                                     // 0x0090(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UMaterialInterface>      Thumbnail;                                         // 0x00A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	ERarity                                       Rarity;                                            // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HardCurrencyPrice;                                 // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SoftCurrencyPrice;                                 // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsUnlocked;                                       // 0x00D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPurchasable;                                    // 0x00D5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEquipped;                                       // 0x00D6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x00D7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class UTyrGameDialogDescriptor* CreatePurchaseDialogDescriptor();
	class UVM_Currency_Purchase_C* CreatePurchaseViewModel(int32 InHardCurrencyCost);
	void ExecuteUbergraph_VM_Cosmetics_VFX(int32 EntryPoint);
	void InitializeEmptyVFX();
	void InitializeFromData(const struct FTyrVehicleCosmeticsDisplayData& InVehicleCosmeticItemData);
	void MarkAsUnlocked();
	void OnPurchaseSuccess();
	void OnResult_AEA0103643AB2FA0A769EC96490F0C9F(ETyrMessagingResult Result);

	bool CanEquip() const;
	class FText GetHardCurrencyPriceText() const;
	class FText GetHardCurrencyUnlockLabel() const;
	class FText GetRarityLabel() const;
	double GetSelectedOpacity() const;
	ESlateVisibility GetSelectedVisibility() const;
	class FText GetSoftCurrencyPriceText() const;
	class FText GetSoftCurrencyUnlockLabel() const;
	bool IsNotUnequipVFX() const;
	bool IsPurchasableOrUnlocked() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Cosmetics_VFX_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Cosmetics_VFX_C")
	}
	static class UVM_Cosmetics_VFX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Cosmetics_VFX_C>();
	}
};
DUMPER7_ASSERTS_UVM_Cosmetics_VFX_C;

SDK_NAMESPACE_END
