#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_ClaimExperience_Reward

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"
#include "DataRegistry_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_ClaimExperience_Reward.VM_ClaimExperience_Reward_C
// 0x0110 (0x0180 - 0x0070)
class UVM_ClaimExperience_Reward_C final : public UTyrViewModel
{
public:
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0070(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      IconMaterial;                                      // 0x0098(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      IconWideMaterial;                                  // 0x00C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      Portrait;                                          // 0x00E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x0110(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Description;                                       // 0x0120(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Pilot;                                             // 0x0130(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Vehicle;                                           // 0x0140(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   LevelText;                                         // 0x0150(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	ESlateVisibility                              CharacterVisibility;                               // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              PilotLabelVisibility;                              // 0x0161(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              LevelVisibility;                                   // 0x0162(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERarity                                       Rarity;                                            // 0x0163(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseCompactLayout;                                 // 0x0164(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   RewardType;                                        // 0x0168(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           ItemTag;                                           // 0x0178(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void InitFromCatalogItemTag(const struct FGameplayTag& InCatalogItemTag, int32 InItemAmount, int32 InLevel);
	void InitFromCurrency(const class FString& InCurrency, int32 InAmount);
	void InitFromQuestItemBlob(const struct FQuestUserInventoryItemBlob& InData);
	void SetLevel(int32 InLevel);
	void SetNoLevel();
	void SetRewardDetails(const class FText& InTitle, const class FText& InDescription, const class FText& InRewardType, TSoftObjectPtr<class UTexture2D> InIcon);
	void SetVehicleDetails(class UVM_Vehicle_C* InVehicleViewModel);

	void GetConsumableColor(struct FLinearColor* NewParam) const;
	struct FLinearColor GetRarityColor() const;
	class FText GetRarityText() const;
	struct FLinearColor GetRarityTextColor() const;
	ESlateVisibility GetRarityVisibility() const;
	int32 GetRewardIconSwitcherIndex() const;
	void GetVehicleNameFromVehicleSkinTag(const struct FGameplayTag& InSkinTag, class FText* VehicleName) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_ClaimExperience_Reward_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_ClaimExperience_Reward_C")
	}
	static class UVM_ClaimExperience_Reward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_ClaimExperience_Reward_C>();
	}
};
DUMPER7_ASSERTS_UVM_ClaimExperience_Reward_C;

SDK_NAMESPACE_END
