#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Clan

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Clan.VM_Clan_C
// 0x0120 (0x0190 - 0x0070)
class UVM_Clan_C final : public UTyrViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0070(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                 ClanId;                                            // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0088(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UVM_Clan_Member_C*>              Members;                                           // 0x0098(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           MemberSort;                                        // 0x00A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UVM_Selector_Option_C*>          MemberSortOptions;                                 // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsClanFull;                                       // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPrivateClan;                                    // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocalPlayerClanLeader;                          // 0x00C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrDiscordLinkState                          DiscordLinkState;                                  // 0x00C3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrClanDiscordLinkState                      ClanDiscordLinkState;                              // 0x00C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 JoinCode;                                          // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bNeedsDiscordAuthorization;                        // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAsyncAction_ListenForGameplayMessage*> MessageListeners;                           // 0x00E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsSendingChatMessage;                             // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ChatErrorMessage;                                  // 0x00F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UVM_Clan_Chat_Message_C*>        ChatMessages;                                      // 0x0108(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ChatWelcomeMessage;                                // 0x0118(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ChatConnectedMessage;                              // 0x0128(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ChatEntryHintMessage;                              // 0x0138(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Currentxp;                                         // 0x0148(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Requiredxp;                                        // 0x014C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumScansEarned;                                    // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentProgressAmount;                             // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              ProgressRolloverTimestamp;                         // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UVM_TerritoryScans_Scan_C*>      UnclaimedScans;                                    // 0x0168(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(bool bSuccess, const class UVM_ClaimExperience_C* Rewards)> OnClaimClanRewardsComplete; // 0x0178(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsChatWidgetActive;                               // 0x0188(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ClaimTerritoryScans();
	class UTyrGameDialogDescriptor* CreateDeleteClanDialogDescriptor();
	class UTyrGameDialogDescriptor* CreateLeaveClanDialogDescriptor();
	class UTyrGameDialogDescriptor* CreateMakePublicDialogDescriptor(bool bInPublicClan);
	void ExecuteUbergraph_VM_Clan(int32 EntryPoint);
	void FindChatAuthorDetails(const struct FTyrClanChatMessage& InMessageData, class FText* AuthorName, bool* bIsLocalPlayer, bool* bIsClanLeader);
	void FindChatMessage(const class FString& InMessageId, bool* bDidFind, class UVM_Clan_Chat_Message_C** ViewModel);
	void FindClanMember(const class FString& InUserId, bool* bDidFind, class UVM_Clan_Member_C** ViewModel);
	void FindClanMemberWithDiscordId(int64 InDiscordUserId, bool* bDidFind, class UVM_Clan_Member_C** ClanMember);
	struct FMemberWeeklyProgress GetClanMemberProgression(const class FString& InUserIde);
	void GetOrCreateClanMember(const class FString& InUserId, class UVM_Clan_Member_C** ClanMember, bool* bDidCreate);
	void OnChatMessageSent(bool bSuccess, const class FString& ErrorMessage);
	void OnClanCreated();
	void OnClanDiscordLinkChanged(ETyrClanDiscordLinkState State);
	void OnDeinitialized();
	void OnDiscordLinkStateChanged(bool bSuccess, const class FText& ErrorMessage);
	void OnDiscordReauthorizationComplete(bool bSuccess, const class FText& ErrorMessage);
	void OnFailure_7B63E7DA482FDCE52E7E0E80EFE60F03(const class FString& ErrorMessage);
	void OnInitialized();
	void OnMessageReceived_26040B474974FAFC229E60A851E2F839(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_45964E30487B91A2F5A4B9AE25F142D9(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_6AF80C97473696420C51F2828D52F9B8(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_73D3412F47B53704BB0A3BA4D2DA6F7D(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_A7B095744D6ADD7391C7C298EBE02AE0(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_EEF6CB014DA5224F24188D9504A9FB30(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnOptionSelectedDissolveClan();
	void OnOptionSelectedLeaveClan();
	void OnOptionSelectedMakeClanPrivate();
	void OnOptionSelectedMakeClanPublic();
	void OnResult_374A737A4E71FB5F49D66D81463632D4(ETyrMessagingResult Result);
	void OnResult_55A6BC564D1949788664E6B3FFFF404B(ETyrMessagingResult Result);
	void OnResult_6BA5834E44E30411D563C8A4149DB2DC(ETyrMessagingResult Result);
	void OnResult_B366A762400EB31CECFABCB916D16B88(ETyrMessagingResult Result);
	void OnSuccess_7B63E7DA482FDCE52E7E0E80EFE60F03(int32 RewardsRemaining, int32 TerritoryScansClaimed, float SoftCurrency, float HardCurrency, const TArray<struct FClanRewardItem>& Itemsgranted);
	void RefreshClanData();
	void RemoveClanMemberDirectly(const class UVM_Clan_Member_C*& InClanMember);
	void SendChatMessage(const class FString& InContent);
	void SetupSortingOptions();
	void ShowClanOptions(const class ULocalPlayer* LocalPlayer);
	void SortClanMembers(const class UObject* InA, const class UObject* InB, bool* Result);
	void UpdateChatMessages();
	void UpdateClanData(const struct FClan& InClanData);
	void UpdateClanDiscordLinkState();
	void UpdateClanMemberProfiles();
	void UpdateClanMembers();
	void UpdateClanMemberSort(class UVM_Selector_Option_C* InSortOption);
	void UpdateClanProgress(const struct FClanWeeklyProgress& InProgressData);
	void UpdateDiscordLinkState();

	bool CanJoinLinkedDiscordServer() const;
	bool CanPossiblyClaimScans() const;
	bool CanRelinkDiscordServer() const;
	void GetClanCodeLabel(class FText* Result) const;
	void GetCurrentProgressText(class FText* Result) const;
	class FText GetDiscordRestrictionText() const;
	int32 GetIndexOfMostRecentMessage() const;
	void GetMemberCountText(class FText* Result) const;
	class FText GetNumScansEarnedText() const;
	int32 GetNumScansToClaim() const;
	bool HasAnyChatMessages() const;
	bool HasAnyScansToClaim() const;
	bool HasChatErrorMessage() const;
	bool HasEarnedAnyScans() const;
	bool HasJoinedLinkedChannelAndServer() const;
	class UVM_ClaimExperience_C* MakeTerritoryScanRewards(int32 InSoftCurrency, int32 InHardCurrency, TArray<struct FClanRewardItem>& InItemsGranted) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Clan_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Clan_C")
	}
	static class UVM_Clan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Clan_C>();
	}
};
DUMPER7_ASSERTS_UVM_Clan_C;

SDK_NAMESPACE_END
