#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_CurrencyPack

#include "Basic.hpp"

#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_CurrencyPack.VM_CurrencyPack_C
// 0x00C8 (0x0138 - 0x0070)
class UVM_CurrencyPack_C final : public UTyrViewModel
{
public:
	int32                                         Currencyamount;                                    // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BonusPercentage;                                   // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 PackId;                                            // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   DisplayName;                                       // 0x0088(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   FormattedCurrencyAmount;                           // 0x0098(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   RealMoneyPrice;                                    // 0x00A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UTexture2D>              PackIcon;                                          // 0x00B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bIsFeatured;                                       // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              FeaturedImage;                                     // 0x00E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   FeaturedDescription;                               // 0x0110(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   TermsText;                                         // 0x0120(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         SortOrder;                                         // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool HasBonus();
	void InitializePack(const class FString& InPackId, const class FText& InDisplayName, int32 InCurrencyAmount, const class FText& InFormattedAmount, const class FText& InPrice, int32 InBonusPct, bool InIsFeatured, const class FText& InFeaturedDesc, const class FText& InTerms, int32 InSortOrder, TSoftObjectPtr<class UTexture2D> InTexturePackIcon, TSoftObjectPtr<class UTexture2D> InTextureFeatureIcon);

	void GetBonus(class FText* NewParam) const;
	void IsBonusVisible(bool* NewParam) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_CurrencyPack_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_CurrencyPack_C")
	}
	static class UVM_CurrencyPack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_CurrencyPack_C>();
	}
};
DUMPER7_ASSERTS_UVM_CurrencyPack_C;

SDK_NAMESPACE_END
