#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_ConsumableBase

#include "Basic.hpp"

#include "TyrSharedTypes_structs.hpp"
#include "Tyr_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FieldNotification_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function VM_ConsumableBase.VM_ConsumableBase_C.ExecuteUbergraph_VM_ConsumableBase
// 0x0420 (0x0420 - 0x0000)
struct VM_ConsumableBase_C_ExecuteUbergraph_VM_ConsumableBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_2;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_2;                // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTyrInventoryItemConsumedMessage       Temp_struct_Variable;                              // 0x0028(0x0058)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate; // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTyrInventoryItemConsumedMessage       Temp_struct_Variable_1;                            // 0x00A8(0x0058)()
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_1;                            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_1;  // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId;             // 0x011C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_1;           // 0x0124(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ReferenceParm)
	TArray<struct FSnapserPurchasedItemResult>    K2Node_CustomEvent_GrantedItems_1;                 // 0x0140(0x0010)(ConstParm, ReferenceParm)
	struct FTyrOnlineErrorWrapper                 K2Node_CustomEvent_Error_1;                        // 0x0150(0x0028)(ConstParm)
	TDelegate<void(const TArray<struct FSnapserPurchasedItemResult>& GrantedItems, const struct FTyrOnlineErrorWrapper& Error)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0178(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSnapserPurchasedItemResult>    K2Node_CustomEvent_GrantedItems;                   // 0x0188(0x0010)(ConstParm, ReferenceParm)
	struct FTyrOnlineErrorWrapper                 K2Node_CustomEvent_Error;                          // 0x0198(0x0028)(ConstParm)
	TDelegate<void(const TArray<struct FSnapserPurchasedItemResult>& GrantedItems, const struct FTyrOnlineErrorWrapper& Error)> K2Node_CreateDelegate_OutputDelegate_2; // 0x01C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTyrOnlineErrorWrapper                 Temp_struct_Variable_3;                            // 0x01D0(0x0028)()
	TArray<struct FSnapserPurchasedItemResult>    Temp_struct_Variable_4;                            // 0x01F8(0x0010)(ReferenceParm)
	class USnapserProgressionSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrOnlineSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_2;           // 0x0218(0x0008)(NoDestructor, HasGetValueTypeHash)
	const class UTyrOnlineUserInfo*               CallFunc_GetUserInfoForLocalPlayerIndex_ReturnValue; // 0x0220(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_3;           // 0x0228(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array_1;                          // 0x0230(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_1; // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_2; // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_5;                            // 0x0250(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrInventoryMessage                   K2Node_CustomEvent_Payload;                        // 0x0260(0x0010)(NoDestructor)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0270(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTyrInventoryItemsAddedMessage         K2Node_CustomEvent_TyrInventoryItemsAddedMessage;  // 0x0280(0x0010)(ConstParm)
	struct FTyrInventoryItemConsumedMessage       K2Node_CustomEvent_TyrInventoryItemConsumedMessage; // 0x0290(0x0058)(ConstParm)
	struct FItemBlob                              CallFunc_Array_Get_Item;                           // 0x02E8(0x0058)()
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue; // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue_1; // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342[0x2];                                      // 0x0342(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34B[0x5];                                      // 0x034B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrInventoryItemsAddedMessage         Temp_struct_Variable_6;                            // 0x0350(0x0010)()
	class FString                                 CallFunc_GetDebugStringFromGameplayTag_ReturnValue; // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0370(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_1;                  // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_1;                // 0x0388(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0390(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_1;        // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrInventoryMessage                   Temp_struct_Variable_7;                            // 0x03A8(0x0010)(NoDestructor)
	struct FTyrInventoryItemsAddedMessage         Temp_struct_Variable_8;                            // 0x03B8(0x0010)()
	bool                                          CallFunc_GetPayload_ReturnValue_1;                 // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_2;  // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_2;                            // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_2;                 // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E2[0x2];                                      // 0x03E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_9;                            // 0x03E4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED[0x3];                                      // 0x03ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ConvertNewItemTagToName_ReturnValue;      // 0x03F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTyrAsyncActionPurchaseItem*            CallFunc_PurchaseItem_ReturnValue;                 // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrInventoryMessage                   Temp_struct_Variable_10;                           // 0x0410(0x0010)(NoDestructor)
};
DUMPER7_ASSERTS_VM_ConsumableBase_C_ExecuteUbergraph_VM_ConsumableBase;

// Function VM_ConsumableBase.VM_ConsumableBase_C.On Inventory Received Message
// 0x0010 (0x0010 - 0x0000)
struct VM_ConsumableBase_C_On_Inventory_Received_Message final
{
public:
	struct FTyrInventoryMessage                   Payload;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_VM_ConsumableBase_C_On_Inventory_Received_Message;

// Function VM_ConsumableBase.VM_ConsumableBase_C.OnFailure_BBBA40C04914F6DDE6C10F9194EBE187
// 0x0038 (0x0038 - 0x0000)
struct VM_ConsumableBase_C_OnFailure_BBBA40C04914F6DDE6C10F9194EBE187 final
{
public:
	TArray<struct FSnapserPurchasedItemResult>    GrantedItems;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FTyrOnlineErrorWrapper                 Error;                                             // 0x0010(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_VM_ConsumableBase_C_OnFailure_BBBA40C04914F6DDE6C10F9194EBE187;

// Function VM_ConsumableBase.VM_ConsumableBase_C.OnInventoryItemAddedMessage
// 0x0010 (0x0010 - 0x0000)
struct VM_ConsumableBase_C_OnInventoryItemAddedMessage final
{
public:
	struct FTyrInventoryItemsAddedMessage         TyrInventoryItemsAddedMessage;                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_VM_ConsumableBase_C_OnInventoryItemAddedMessage;

// Function VM_ConsumableBase.VM_ConsumableBase_C.OnInventoryItemConsumedMessage
// 0x0058 (0x0058 - 0x0000)
struct VM_ConsumableBase_C_OnInventoryItemConsumedMessage final
{
public:
	struct FTyrInventoryItemConsumedMessage       TyrInventoryItemConsumedMessage;                   // 0x0000(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_VM_ConsumableBase_C_OnInventoryItemConsumedMessage;

// Function VM_ConsumableBase.VM_ConsumableBase_C.OnMessageReceived_6F36013447C38B7D046978A097309215
// 0x0010 (0x0010 - 0x0000)
struct VM_ConsumableBase_C_OnMessageReceived_6F36013447C38B7D046978A097309215 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_ConsumableBase_C_OnMessageReceived_6F36013447C38B7D046978A097309215;

// Function VM_ConsumableBase.VM_ConsumableBase_C.OnMessageReceived_AFC176FA4706502C71CB9082F8EBF130
// 0x0010 (0x0010 - 0x0000)
struct VM_ConsumableBase_C_OnMessageReceived_AFC176FA4706502C71CB9082F8EBF130 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_ConsumableBase_C_OnMessageReceived_AFC176FA4706502C71CB9082F8EBF130;

// Function VM_ConsumableBase.VM_ConsumableBase_C.OnMessageReceived_B08079E548DF033E063B949B86347F7C
// 0x0010 (0x0010 - 0x0000)
struct VM_ConsumableBase_C_OnMessageReceived_B08079E548DF033E063B949B86347F7C final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_ConsumableBase_C_OnMessageReceived_B08079E548DF033E063B949B86347F7C;

// Function VM_ConsumableBase.VM_ConsumableBase_C.OnSuccess_BBBA40C04914F6DDE6C10F9194EBE187
// 0x0038 (0x0038 - 0x0000)
struct VM_ConsumableBase_C_OnSuccess_BBBA40C04914F6DDE6C10F9194EBE187 final
{
public:
	TArray<struct FSnapserPurchasedItemResult>    GrantedItems;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FTyrOnlineErrorWrapper                 Error;                                             // 0x0010(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_VM_ConsumableBase_C_OnSuccess_BBBA40C04914F6DDE6C10F9194EBE187;

// Function VM_ConsumableBase.VM_ConsumableBase_C.RefreshConsumableContainer
// 0x0120 (0x0120 - 0x0000)
struct VM_ConsumableBase_C_RefreshConsumableContainer final
{
public:
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_1; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDebugStringFromGameplayTag_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_2; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDebugStringFromGameplayTag_ReturnValue_1; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_3; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTyrInventorySubsystem*                 CallFunc_GetInventorySubsystem_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FItemInformation                       CallFunc_GetItemInformation_OutInfo;               // 0x0070(0x00A0)()
	bool                                          CallFunc_GetItemInformation_ReturnValue;           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_Int64ToInt_ReturnValue;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_4; // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_5; // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_ConsumableBase_C_RefreshConsumableContainer;

// Function VM_ConsumableBase.VM_ConsumableBase_C.RefreshConsumableItem
// 0x0160 (0x0160 - 0x0000)
struct VM_ConsumableBase_C_RefreshConsumableItem final
{
public:
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId;             // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_1;           // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	class UTyrInventorySubsystem*                 CallFunc_GetInventorySubsystem_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrInventorySubsystem*                 CallFunc_GetInventorySubsystem_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_2;           // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FItemInformation                       CallFunc_GetItemInformation_OutInfo;               // 0x0038(0x00A0)()
	bool                                          CallFunc_GetItemInformation_ReturnValue;           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_3;           // 0x00DC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array_1;                          // 0x00E8(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue; // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemBlob                              CallFunc_GetItemFromRootInventory_OutItem;         // 0x0100(0x0058)()
	bool                                          CallFunc_GetItemFromRootInventory_ReturnValue;     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue_1; // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_ConsumableBase_C_RefreshConsumableItem;

// Function VM_ConsumableBase.VM_ConsumableBase_C.GetAmountText
// 0x00A0 (0x00A0 - 0x0000)
struct VM_ConsumableBase_C_GetAmountText final
{
public:
	class FText                                   AmountText;                                        // 0x0000(0x0010)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0090(0x0010)()
};
DUMPER7_ASSERTS_VM_ConsumableBase_C_GetAmountText;

// Function VM_ConsumableBase.VM_ConsumableBase_C.GetDescription
// 0x0010 (0x0010 - 0x0000)
struct VM_ConsumableBase_C_GetDescription final
{
public:
	class FText                                   Description;                                       // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_VM_ConsumableBase_C_GetDescription;

// Function VM_ConsumableBase.VM_ConsumableBase_C.HasAnyOfConsumable
// 0x0002 (0x0002 - 0x0000)
struct VM_ConsumableBase_C_HasAnyOfConsumable final
{
public:
	bool                                          CanApply;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_ConsumableBase_C_HasAnyOfConsumable;

// Function VM_ConsumableBase.VM_ConsumableBase_C.SetBoosterIconColor
// 0x0014 (0x0014 - 0x0000)
struct VM_ConsumableBase_C_SetBoosterIconColor final
{
public:
	struct FLinearColor                           NewParam;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_ConsumableBase_C_SetBoosterIconColor;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
