#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Dialog_TextInput

#include "Basic.hpp"

#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Dialog_TextInput.VM_Dialog_TextInput_C
// 0x0070 (0x00E0 - 0x0070)
class UVM_Dialog_TextInput_C final : public UTyrViewModel
{
public:
	class FString                                 EnteredText;                                       // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   HintText;                                          // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ErrorMessage;                                      // 0x0090(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsPassword;                                       // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinCharacters;                                     // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxCharacters;                                     // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   EditingProperty;                                   // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UVM_Currency_Purchase_C*                CurrencyPurchase;                                  // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasOption;                                        // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsOptionEnabled;                                  // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OptionLabel;                                       // 0x00D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ConfigureOption(const class FText& InLabel, bool bInEnabled);
	void SetAndValidateEnteredText(const class FString& InText);
	void ToggleOption();
	void ValidateEnteredText(bool* bIsValid);

	bool CanPurchase() const;
	class FText GetCurrencyAvailableText() const;
	class FText GetCurrencyCostText() const;
	bool IsEnteredTextValid() const;
	bool RequiresCurrency() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Dialog_TextInput_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Dialog_TextInput_C")
	}
	static class UVM_Dialog_TextInput_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Dialog_TextInput_C>();
	}
};
DUMPER7_ASSERTS_UVM_Dialog_TextInput_C;

SDK_NAMESPACE_END
