#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_GameMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "E_GameMode_Disabled_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_GameMode.VM_GameMode_C
// 0x0100 (0x0170 - 0x0070)
class UVM_GameMode_C final : public UTyrViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0070(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           Tag;                                               // 0x0078(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Description;                                       // 0x0090(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UMaterialInterface>      Thumbnail;                                         // 0x00A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      Background;                                        // 0x00C8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Slot;                                              // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDisabled;                                       // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisabledMessage;                                   // 0x0100(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 QueueTag;                                          // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         MinMaxVehicle;                                     // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnabled;                                          // 0x0124(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinSquadSize;                                      // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxSquadSize;                                      // 0x012C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSupportsSquads;                                   // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrGameModeEntry                      GameModeConfig;                                    // 0x0138(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void DisableGameMode(const class FText& InReason);
	void EnableGameMode();
	void ExecuteUbergraph_VM_GameMode(int32 EntryPoint);
	void GetDisabledMessage(bool bInIsEnabled, class FText* Message);
	void InitializeFromConfig(const struct FTyrGameModeEntry& InConfig);
	void OnInitialized();
	void OnMessageReceived_1D7A47EE4E2F24B7F01DD4BBC052DADF(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_27B37E0C47309BB4602533BA00E8B2AA(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_46D5AF5C41B90414CBBAA9826207D1AA(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_62922D414220F31C28D3CBB14D34F726(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_7F3B80AA4B8D387C72852A8D7766C879(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_9A6C83394569B2DD2EDD91AD93FC5021(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void UpdateEnabledState();

	bool CanSelect() const;
	void IsUnlocked(bool* Result, E_GameMode_Disabled* OutReason) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_GameMode_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_GameMode_C")
	}
	static class UVM_GameMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_GameMode_C>();
	}
};
DUMPER7_ASSERTS_UVM_GameMode_C;

SDK_NAMESPACE_END
