#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Garage

#include "Basic.hpp"

#include "DataRegistry_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Garage.VM_Garage_C
// 0x0070 (0x00E8 - 0x0078)
class UVM_Garage_C final : public UTyrGlobalViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULevelStreamingDynamic*                 ActiveGarageSublevel;                              // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLoadingGarage;                                  // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLoadingVehicle;                                 // 0x0089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHideGarageRequested;                              // 0x008A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           DesiredVehicle;                                    // 0x008C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           DisplayedVehicle;                                  // 0x0094(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BaseTank_Lite_C*                    SpawnedVehicle;                                    // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVM_Cosmetics_Vehicle_C*                ActiveVehicleCosmetics;                            // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ViewTargetToRestore;                               // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnGarageReady;                                     // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnVehicleReady;                                    // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnGarageAndVehicleReady;                           // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void DestroySpawnedVehicle();
	void ExecuteUbergraph_VM_Garage(int32 EntryPoint);
	void HideGarage();
	void OnGarageLevelShown();
	void OnHideGarage();
	void OnLoaded_7CEF41894C206FE253EFADA6EBB7C0CA(TSubclassOf<class UObject> Loaded);
	void OnLoaded_7E0844FB438F14E5A06206851FE53621(class UObject* Loaded);
	void OnLoaded_B43749A649E8527924A5D48C8C1BED2C(class UObject* Loaded);
	void OnLoaded_EC84B93745E842320D43C2BF72C971A3(TSubclassOf<class UObject> Loaded);
	void OnShowDesiredVehicle();
	void OnShowGarage();
	void OnSpawnVehicle(TSoftClassPtr<class UClass> VehicleClass);
	void PreloadGarage();
	void PreloadVehicle(TSoftClassPtr<class UClass> VehicleClass);
	void SetCameraRotation(const struct FRotator& InRotation);
	void SetGarageCameraAsViewTarget();
	void ShowGarage();
	void ShowGarageWithVehicle(const struct FGameplayTag& InVehicleTag);
	void SpawnVehicle(const struct FGameplayTag& InVehicleTag);
	void TryBroadcastGarageAndVehicleReady();

	bool IsGarageActive() const;
	bool IsVehicleSpawned() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Garage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Garage_C")
	}
	static class UVM_Garage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Garage_C>();
	}
};
DUMPER7_ASSERTS_UVM_Garage_C;

SDK_NAMESPACE_END
