#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Lobby_Player

#include "Basic.hpp"

#include "DataRegistry_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Lobby_Player.VM_Lobby_Player_C
// 0x0138 (0x0260 - 0x0128)
class UVM_Lobby_Player_C final : public UTyrPlayerViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0128(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         PlayerId;                                          // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TeamId;                                            // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0138(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsLocalPlayer;                                    // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsReady;                                          // 0x0149(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAlly;                                           // 0x014A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInParty;                                        // 0x014B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelectionRevealed;                              // 0x014C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   VehicleName;                                       // 0x0150(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   PilotName;                                         // 0x0160(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           VehicleClass;                                      // 0x0170(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       PilotPortrait;                                     // 0x0178(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              KeystoneIcon;                                      // 0x01A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bIsSpectator;                                      // 0x01C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrPlayerTitleData                    PlayerTitleData;                                   // 0x01D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   KeystoneName;                                      // 0x0220(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   KeystoneDesc;                                      // 0x0230(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsLobbyOwner;                                     // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAsyncAction_ListenForGameplayMessage*> MessageListeners;                           // 0x0248(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsOpenSlot;                                       // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanJoinSlot;                                      // 0x0259(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanShowContextMenu;                               // 0x025A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrRecordConnectionState                     ConnectionState;                                   // 0x025B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ConfigureContextMenu(class UTyrContextMenuWidget* InContextMenu);
	void ExecuteUbergraph_VM_Lobby_Player(int32 EntryPoint);
	void InitializeAsOpenSlot(int32 InTeamId, int32 InLocalPlayerTeamId);
	bool IsLocalPlayerState(class ATyrPlayerStateBase* InPlayerState);
	void OnChangeTeams();
	void OnConnectionStateChanged(ETyrRecordConnectionState NewState);
	void OnDeinitialized();
	void OnInitializedForPlayer();
	void OnIsOnlySpectatorChanged(bool bIsOnlySpectator);
	void OnKeystoneChanged(class ATyrPlayerStateBase* OwningPlayerState, const struct FGameplayTag& NewKeystoneTag);
	void OnKeystoneTagChanged(const struct FGameplayTag& NewKeystoneTag);
	void OnKickPlayer();
	void OnMakePlayer();
	void OnMakeSpectator();
	void OnMessageReceived_ADE93C5A4E0DE1CAFB6668A46CB232FB(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_E71565BB4F1D7E6F39589AA343CDCA8D(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnPlayerNameChanged(const class FString& NewName);
	void OnPlayerTitleChanged(const struct FGameplayTag& NewTitle);
	void OnPromoteToOwner();
	void RefreshKeystone(const struct FTyrKeystoneMessage& InKeystoneMessage);
	void UpdateIsAlly(int32 InLocalPlayerTeamId, bool bInUpdateSelectionReveal);
	void UpdateIsReady(bool bInIsReady);
	void UpdateIsSelectionRevealed(bool bInSelectionRevealed);
	void UpdatePlayerInfo(int32 InLocalPlayerTeamId, bool bInLocalPlayerIsLobbyOwner, bool bInSpectator, bool bInParty, bool bInUpdateSelectionReveal);
	void UpdateTeamId(int32 InTeamId);
	void UpdateVehicleSelection(const struct FGameplayTag& InVehicleTag);

	int32 GetDetailsWidgetIndex() const;
	struct FLinearColor GetIndicatorColor() const;
	struct FSlateColor GetIndicatorTextColor() const;
	double GetReadyOpacity() const;
	struct FLinearColor GetSelectionIndicatorColor() const;
	void GetSelectionWidgetIndex(int32* WidgetIndex) const;
	int32 GetSpectatorDetailWidgetIndex() const;
	void GetTitleVisibility(ESlateVisibility* NewParam) const;
	ESlateVisibility VisibleWhenKeystonePresent() const;
	ESlateVisibility VisibleWhenKeystoneValid() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Lobby_Player_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Lobby_Player_C")
	}
	static class UVM_Lobby_Player_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Lobby_Player_C>();
	}
};
DUMPER7_ASSERTS_UVM_Lobby_Player_C;

SDK_NAMESPACE_END
