#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Lobby_Vehicle

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Tyr_classes.hpp"
#include "DataRegistry_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Lobby_Vehicle.VM_Lobby_Vehicle_C
// 0x0138 (0x01A8 - 0x0070)
class UVM_Lobby_Vehicle_C final : public UTyrViewModel
{
public:
	struct FGameplayTag                           VehicleTag;                                        // 0x0070(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VehicleClass;                                      // 0x0078(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   VehicleName;                                       // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Ability_Name;                                      // 0x0090(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   PilotName;                                         // 0x00A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsUnlocked;                                       // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLevelRestricted;                                // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsWIP;                                            // 0x00B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanSelect;                                        // 0x00B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x00B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              VehiclePortrait;                                   // 0x00B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CharPortrait;                                      // 0x00E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       CharThumb;                                         // 0x0108(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       CharSplashArt;                                     // 0x0130(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       CharAnimatedSplashArt;                             // 0x0158(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UFileMediaSource>        CharAnimatedSplashArtSource;                       // 0x0180(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void InitializeWithVehicleData(const struct FTyrVehicleUIDataTableStruct& InVehicleUIData, const struct FGameplayTag& InVehicleTag);
	void SetCanSelect(bool bInCanSelect);
	void SetIsLevelRestricted(bool bInIsLevelRestricted);
	void SetIsUnlocked(bool bInIsUnlocked);

	struct FTyrMaterialScalarParam GetPortraitMaterialSaturation() const;
	void GetPortraitMaterialScaleY(struct FTyrMaterialVectorParam* TyrMaterialVectorParam) const;
	void IsLockedOrRestricted(bool* IsLockedOrRestricted_0) const;
	double OpacityWhileLockedOrUnselectable() const;
	ESlateVisibility VisibleForAnimatedSplashArt() const;
	ESlateVisibility VisibleForFallbackArt() const;
	ESlateVisibility VisibleForSplashArt() const;
	ESlateVisibility VisibleWhileLocked() const;
	ESlateVisibility VisibleWhileLockedOrUnselectable() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Lobby_Vehicle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Lobby_Vehicle_C")
	}
	static class UVM_Lobby_Vehicle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Lobby_Vehicle_C>();
	}
};
DUMPER7_ASSERTS_UVM_Lobby_Vehicle_C;

SDK_NAMESPACE_END
