#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Leaderboard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Leaderboard.VM_Leaderboard_C
// 0x0050 (0x00C0 - 0x0070)
class UVM_Leaderboard_C final : public UTyrViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0070(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           LeaderboardTag;                                    // 0x0078(0x0008)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class UVM_Leaderboard_Player_C*>       Players;                                           // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	ETyrQueryState                                ScoresQuery;                                       // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldQueryForData;                               // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RankDecayAmount;                                   // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RankDecayDaysInactive;                             // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsRankDecayEnabled;                               // 0x009C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVM_Ranked_Info_TierGroup_C*>    TierGroups;                                        // 0x00A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FTyrLeaderboardTierThreshold>   Tier_Thresholds;                                   // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_VM_Leaderboard(int32 EntryPoint);
	void GetOrCreateLeaderboardPlayer(const class FString& InUserId, class UVM_Leaderboard_Player_C** ViewModel);
	void GetOrCreateTierGroup(const struct FGameplayTag& InTierGroupTag, int32 InRequiredThreshold, class UVM_Ranked_Info_TierGroup_C** TierGroupViewModel);
	void InitializeLeaderboardFromConfig();
	void OnFailure_A25881E440F68BA7D2987287FCCB0BFD(const class FString& ErrorMessage);
	void OnInitialized();
	void OnQueryLeaderboardScores();
	void OnSuccess_A25881E440F68BA7D2987287FCCB0BFD(const class FString& LeaderboardName, const TArray<struct FLeaderboardScore>& Scores);
	void QueryLeaderboardScores();
	void RefreshPlayerProfiles(TArray<class FString>& InUserIds);
	void SetCanQueryForData();
	void SetTierGroupSizing();
	void SortByRank(const class UObject* InA, const class UObject* InB, bool* Result);
	void UpdateLeaderboardScores(TArray<struct FLeaderboardScore>& InScores);

	class FText GetGrandmasterDecayMessage() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Leaderboard_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Leaderboard_C")
	}
	static class UVM_Leaderboard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Leaderboard_C>();
	}
};
DUMPER7_ASSERTS_UVM_Leaderboard_C;

SDK_NAMESPACE_END
