#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_LatentOperation_Clan_UpdateClanData

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function VM_LatentOperation_Clan_UpdateClanData.VM_LatentOperation_Clan_UpdateClanData_C.ExecuteUbergraph_VM_LatentOperation_Clan_UpdateClanData
// 0x0030 (0x0030 - 0x0000)
struct VM_LatentOperation_Clan_UpdateClanData_C_ExecuteUbergraph_VM_LatentOperation_Clan_UpdateClanData final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSuccess)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bPublicClan;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Clans_C*                            CallFunc_GetClansViewModel_ViewModel;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Clans_C*                            CallFunc_GetClansViewModel_ViewModel_1;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_LatentOperation_Clan_UpdateClanData_C_ExecuteUbergraph_VM_LatentOperation_Clan_UpdateClanData;

// Function VM_LatentOperation_Clan_UpdateClanData.VM_LatentOperation_Clan_UpdateClanData_C.MakeClanPublic
// 0x0001 (0x0001 - 0x0000)
struct VM_LatentOperation_Clan_UpdateClanData_C_MakeClanPublic final
{
public:
	bool                                          bPublicClan;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_LatentOperation_Clan_UpdateClanData_C_MakeClanPublic;

// Function VM_LatentOperation_Clan_UpdateClanData.VM_LatentOperation_Clan_UpdateClanData_C.OnSetClanPublicComplete
// 0x0001 (0x0001 - 0x0000)
struct VM_LatentOperation_Clan_UpdateClanData_C_OnSetClanPublicComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_LatentOperation_Clan_UpdateClanData_C_OnSetClanPublicComplete;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
