#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_LatentOperation_Clan_TransferOwnership

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function VM_LatentOperation_Clan_TransferOwnership.VM_LatentOperation_Clan_TransferOwnership_C.ExecuteUbergraph_VM_LatentOperation_Clan_TransferOwnership
// 0x0048 (0x0048 - 0x0000)
struct VM_LatentOperation_Clan_TransferOwnership_C_ExecuteUbergraph_VM_LatentOperation_Clan_TransferOwnership final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSuccess)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_NewLeaderUserId;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Clans_C*                            CallFunc_GetClansViewModel_ViewModel;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Clans_C*                            CallFunc_GetClansViewModel_ViewModel_1;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_LatentOperation_Clan_TransferOwnership_C_ExecuteUbergraph_VM_LatentOperation_Clan_TransferOwnership;

// Function VM_LatentOperation_Clan_TransferOwnership.VM_LatentOperation_Clan_TransferOwnership_C.OnTransferOwnershipComplete
// 0x0001 (0x0001 - 0x0000)
struct VM_LatentOperation_Clan_TransferOwnership_C_OnTransferOwnershipComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_LatentOperation_Clan_TransferOwnership_C_OnTransferOwnershipComplete;

// Function VM_LatentOperation_Clan_TransferOwnership.VM_LatentOperation_Clan_TransferOwnership_C.TransferOwnership
// 0x0010 (0x0010 - 0x0000)
struct VM_LatentOperation_Clan_TransferOwnership_C_TransferOwnership final
{
public:
	class FString                                 NewLeaderUserId;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_LatentOperation_Clan_TransferOwnership_C_TransferOwnership;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
