#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_LocalPlayerProfile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_LocalPlayerProfile.VM_LocalPlayerProfile_C
// 0x0050 (0x00C8 - 0x0078)
class UVM_LocalPlayerProfile_C final : public UTyrGlobalViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVM_PlayerProfile_C*                    LocalPlayerProfile;                                // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVM_Leaderboard_Rank_C*                 CurrentSoloRank;                                   // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVM_Leaderboard_Rank_C*                 CurrentTeamRank;                                   // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVM_Leaderboard_Rank_C*                 SeasonBestSoloRank;                                // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVM_Leaderboard_Rank_C*                 SeasonBestTeamRank;                                // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasUnlockedSoloRanked;                            // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVM_PlayerProfile_Title_C*>      Titles;                                            // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         EquippedTitleIndex;                                // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasUnlockedTeamRanked;                            // 0x00C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanQueryProfile;                                  // 0x00C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AssignTitle(class UVM_PlayerProfile_Title_C* InTitle);
	void CheckForRankedUnlocked();
	void ExecuteUbergraph_VM_LocalPlayerProfile(int32 EntryPoint);
	void InitializeProfile();
	void InitializeRank();
	void OnFailure_9477689640EF800B35C627B0959C7D39(const class FString& ItemId, const class FString& ErrorMessage);
	void OnFailure_D21A263243173D912DFA93BF45C9F3B9(const class FString& UserId, const class FString& ErrorMessage);
	void OnInitialPlayerReady();
	void OnMatchHistoryRankUpdate(const struct FTyrRankingUpdateMessage& Payload);
	void OnMessageReceived_18B96DA94619702EDA12FF941B271195(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_AF8123784AF8F6E3DB9254AE33689757(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_BDD568204711D34C57506AA50A1F31E3(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnPlayerReady();
	void OnResult_742E9BB04E1FA82C0977C3B8AA11BA0A(ETyrMessagingResult Result);
	void OnSuccess_9477689640EF800B35C627B0959C7D39(const class FString& ItemId, bool Success);
	void OnSuccess_D21A263243173D912DFA93BF45C9F3B9(const class FString& UserId);
	void RefreshAllTitles();
	void RefreshBestSoloRank();
	void RefreshBestTeamRank();
	void RefreshEquippedTitleIndex();
	void RefreshTitle();
	void SortTitleByRarity(const class UObject* InA, const class UObject* InB, bool* Result);
	void UpdateCurrentRankFromRankingUpdate(const struct FTyrRankingUpdateMessage& InPayload);

	void GetTitleInsertionIndexByRarity(const struct FTyrPlayerTitleData& InTitleData, int32* Index_0) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_LocalPlayerProfile_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_LocalPlayerProfile_C")
	}
	static class UVM_LocalPlayerProfile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_LocalPlayerProfile_C>();
	}
};
DUMPER7_ASSERTS_UVM_LocalPlayerProfile_C;

SDK_NAMESPACE_END
