#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Lobby

#include "Basic.hpp"

#include "DataRegistry_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Lobby.VM_Lobby_C
// 0x0148 (0x01E0 - 0x0098)
class UVM_Lobby_C final : public UTyrGameStateViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UVM_Lobby_Player_C*>             Team0_Players;                                     // 0x00A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UVM_Lobby_Player_C*>             Team1_Players;                                     // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UVM_Lobby_Player_C*>             LeftTeam_Players;                                  // 0x00C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UVM_Lobby_Player_C*>             RightTeam_Players;                                 // 0x00D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UVM_Lobby_Player_C*>             Team0_Spectators;                                  // 0x00E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UVM_Lobby_Player_C*>             Team1_Spectators;                                  // 0x00F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UVM_Lobby_Player_C*>             LeftTeam_Spectators;                               // 0x0100(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UVM_Lobby_Player_C*>             RightTeam_Spectators;                              // 0x0110(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MaxTeamPlayers;                                    // 0x0120(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxTeamSpectators;                                 // 0x0124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NumSecondsForVehicleSelection;                     // 0x0128(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Gamemodetag;                                       // 0x0130(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bLocalPlayerReady;                                 // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAllPlayersReady;                                  // 0x0139(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           ForcePlayerReadyTimerHandle;                       // 0x0140(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ForceReadySecondsRemaining;                        // 0x0148(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MatchStartSeconds;                                 // 0x014C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UVM_Lobby_Vehicle_C*>            Vehicles;                                          // 0x0150(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UVM_Lobby_Vehicle_C*                    SelectedVehicle;                                   // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Details_C*                  SelectedVehicleDetails;                            // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UVM_Lobby_Map_C*>                Maps;                                              // 0x0170(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UVM_Lobby_Map_C*                        SelectedMap;                                       // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalPlayerTeamId;                                 // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAsyncAction_ListenForGameplayMessage*> MessageListeners;                           // 0x0190(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 LocalPlayerPartyId;                                // 0x01A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bIsLocalPlayerSpectator;                           // 0x01B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocalPlayerLobbyOwner;                          // 0x01B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 JoinCode;                                          // 0x01B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bIsJoinCodeVisible;                                // 0x01C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasInitializedLocalPlayerState;                   // 0x01C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasNonSpectatorPlayers;                           // 0x01CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CB[0x5];                                      // 0x01CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GaragePlane_C*                      GaragePlane;                                       // 0x01D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanToggleReady;                                   // 0x01D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ForceReadyLocalStartTime;                          // 0x01DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddLobbyPlayerToNewTeam(const class UVM_Lobby_Player_C*& InLobbyPlayer, int32 InTeamId);
	void AddOrRemoveOpenSlots(int32 InTeamId, TArray<class UVM_Lobby_Player_C*>& InTeamPlayers, int32 InMaxPlayers);
	void AssignLeftAndRightTeams();
	void ChangeLocalPlayerTeam(int32 InTeamId, bool bInSpectate);
	void ExecuteUbergraph_VM_Lobby(int32 EntryPoint);
	void FindMapViewModel(class FName InMapName, bool* bDidFindMap, class UVM_Lobby_Map_C** MapViewModel);
	void HandleLobbyOwnerChanged(const struct FTyrLobbyOwnerChangedMessage& InPayload);
	void OnChangeTeam();
	void OnDeinitialized();
	void OnForcePlayerReady();
	void OnInitializedForGameState();
	void OnInitializeLocalPlayerState(class ATyrPlayerStateBase* PlayerState);
	void OnLobbyPlayerAdded(class APlayerState* PlayerState);
	void OnLobbyPlayerRemoved(class APlayerState* PlayerState);
	void OnLobbySetupComplete();
	void OnLocalPlayerBecameLobbyOwner();
	void OnMapSelected(class FName MapName);
	void OnMessageReceived_0263B1D4401D48C926A943BEF4EA4A04(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_2E9B4F4A42E806B46469379104398318(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_31A96EAB48C48C4A0509CC908AEC9441(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_4B8AA7D5406037FCB0C0A1A6833DEB23(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_5177A2F1460640B91FDA44AB1A6BA9AB(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_9296D0A1491B8A09EA87E78B161E5C39(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_9D7E6DE941CC6F7A69ABE4A9B448094E(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_AB5E376D41A1DD80D570D48BF61B4A83(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_E1E8EA9444A8B8483631FF9D1AEFB221(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void RecomputeCanToggleReady();
	void RefreshLobbyPlayers();
	void RefreshOpenSlots();
	void RefreshSelectedVehicle(class ATyrPlayerStateBase* InLocalPlayerState);
	void RefreshVehicles();
	void RemoveLobbyPlayerFromCurrentTeam(const class UVM_Lobby_Player_C*& InLobbyPlayer);
	void RequestSwapTeams();
	void SetAllPlayersReady(bool bInAllPlayersReady);
	void SetLocalPlayerReady(bool bInReady);
	void SetMap(class FName InMapName);
	void SetMatchStartSeconds(int32 InSeconds);
	void SetupGarage();
	void SetupMaps();
	void SetupVehicles();
	void ShowJoinCode(bool bInShouldShow);
	void SortByPlayerId(class UObject* InLobbyPlayerA, class UObject* InLobbyPlayerB, bool* Result);
	void SortLobbyVehiclesByNameAndWIP(class UObject* InVehicleA, class UObject* InVehicleB, bool* Result);
	void SortOpenSlotsToEnd(const class UObject* InLobbyPlayerA, const class UObject* InLobbyPlayerB, bool* Result);
	void StartForcePlayerReadyTimer();
	void StopForcePlayerReadyTimer();
	void UpdateCanJoinSlots(TArray<class UVM_Lobby_Player_C*>& inArray, bool bInSpectatorSlots);
	void UpdateGameStateLobbyDetails();
	void UpdateHasNonSpectatorPlayers();
	void UpdateIsSpectorForPlayer(bool bInOnlySpectator, class ATyrPlayerStateBase* InPlayerState);
	void UpdateLocalPlayerLobbyOwner(class ATyrPlayerRecord* InPlayerRecord);
	void UpdateLocalPlayerParty(class APlayerState* InLocalPlayerState);
	void UpdateLocalPlayerPartyId(const class FString& InLocalPlayerPartyId);
	void UpdateLocalPlayerSpectator(bool bInIsSpectator);
	void UpdateLocalPlayerTeamId(int32 InLocalPlayerTeamId);
	void UpdatePlayersInSameParty(const TArray<class UVM_Lobby_Player_C*>& InTeam, class APlayerState* InLocalPlayerState);
	void UpdateSelectedVehicle(class UVM_Lobby_Vehicle_C* InVehicle);
	void UpdateSelectedVehicleByTag(const struct FGameplayTag& InVehicleTag);
	void UpdateTeamForPlayer(int32 InTeamId, class ATyrPlayerStateBase* InPlayerState);

	bool CanChangeMap() const;
	bool CanChangeMatchSettings() const;
	ESlateVisibility CollapsedForMatchStartCountdown() const;
	ESlateVisibility CollapsedForSpecOrMatchStartCountdown() const;
	bool DoesGameModeHaveTimedVehicleSelection() const;
	class FText GetJoinCodeLabel() const;
	class FText GetJoinCodeToggleVisibilityHint() const;
	ESlateVisibility GetJoinCodeVisibility() const;
	class FText GetLeftTeamLabel() const;
	void GetLocalPlayerState(bool* bHasLocalPlayerState, class ABP_TyrLobbyPlayerState_C** LocalPlayerState) const;
	int32 GetLocalPlayerStateId() const;
	class FText GetMatchStartCountdownText() const;
	class FText GetNextMapLabel() const;
	int32 GetNumPlayers(const TArray<class UVM_Lobby_Player_C*>& InTeamPlayers) const;
	class FText GetPlayerCountText_LeftTeam() const;
	class FText GetPlayerCountText_RightTeam() const;
	int32 GetReadyWidgetIndex() const;
	class FText GetRightTeamLabel() const;
	double GetSecondsElapsedForTimedVehicleSelection() const;
	double GetSecondsRemainingForTimedVehicleSelection() const;
	class FText GetSelectedTankName() const;
	class UVM_Vehicle_LoadoutSlots_C* GetSelectedVehicleLoadoutSlots() const;
	class FText GetSelectionStatusText() const;
	bool IsCustomGame() const;
	bool IsInLocalPlayerParty(class UTyrPlayerViewModel* InLobbyPlayer) const;
	bool IsInMatchStartCountdown() const;
	bool IsInTimedVehicleSelection() const;
	bool IsSandbox() const;
	void IsVehicleMaxLevel(const struct FGameplayTag& InVehicleTag, bool* IsMaxLevel) const;
	void IsVehicleUnlocked(class UVM_Progression_C* InProgression, const struct FGameplayTag& InVehicleTag, bool* bIsUnlocked) const;
	ESlateVisibility VisibleForChangingTeams() const;
	ESlateVisibility VisibleForCustomGame() const;
	ESlateVisibility VisibleForMatchStartCountdown() const;
	ESlateVisibility VisibleForTeamGameModes() const;
	ESlateVisibility VisibleForTimedVehicleSelection() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Lobby_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Lobby_C")
	}
	static class UVM_Lobby_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Lobby_C>();
	}
};
DUMPER7_ASSERTS_UVM_Lobby_C;

SDK_NAMESPACE_END
