#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Lobby_Connecting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Lobby_Connecting.VM_Lobby_Connecting_C
// 0x0028 (0x00C0 - 0x0098)
class UVM_Lobby_Connecting_C final : public UTyrGameStateViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bShowConnectingPlayerCount;                        // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumConnectedPlayers;                               // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumExpectedPlayers;                                // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bServerConfirmedAllPlayersConnected;               // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAsyncAction_ListenForGameplayMessage*> MessageListeners;                           // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_VM_Lobby_Connecting(int32 EntryPoint);
	void OnDeinitialized();
	void OnInitializedForGameState();
	void OnMessageReceived_3C41EC9747BD11CE0A3BB9A7982D34FE(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_6E9544384EAF949F72CED1A6CCE712DA(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_B16C7A824B676860821FD38AE76AFCA1(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_EB0DE8534B8F10DEA9286C9189898055(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void UpdateCanShowConnectingPlayerCount();
	void UpdateNumConnectedPlayers();
	void UpdateNumExpectedPlayers();

	float GetConnectedPlayersPercent() const;
	double GetConnectPlayersAnimatedFromPercent() const;
	class FText GetNumConnectedPlayersText() const;
	class FText GetNumExpectedPlayersText() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Lobby_Connecting_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Lobby_Connecting_C")
	}
	static class UVM_Lobby_Connecting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Lobby_Connecting_C>();
	}
};
DUMPER7_ASSERTS_UVM_Lobby_Connecting_C;

SDK_NAMESPACE_END
