#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_LatentOperation_Clan_AutoJoin

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function VM_LatentOperation_Clan_AutoJoin.VM_LatentOperation_Clan_AutoJoin_C.ExecuteUbergraph_VM_LatentOperation_Clan_AutoJoin
// 0x0030 (0x0030 - 0x0000)
struct VM_LatentOperation_Clan_AutoJoin_C_ExecuteUbergraph_VM_LatentOperation_Clan_AutoJoin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Clans_C*                            CallFunc_GetClansViewModel_ViewModel;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSuccess)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Clans_C*                            CallFunc_GetClansViewModel_ViewModel_1;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_LatentOperation_Clan_AutoJoin_C_ExecuteUbergraph_VM_LatentOperation_Clan_AutoJoin;

// Function VM_LatentOperation_Clan_AutoJoin.VM_LatentOperation_Clan_AutoJoin_C.OnAutoJoinClanComplete
// 0x0001 (0x0001 - 0x0000)
struct VM_LatentOperation_Clan_AutoJoin_C_OnAutoJoinClanComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_LatentOperation_Clan_AutoJoin_C_OnAutoJoinClanComplete;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
