#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Leaderboard_Player

#include "Basic.hpp"

#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"
#include "DataRegistry_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Leaderboard_Player.VM_Leaderboard_Player_C
// 0x0108 (0x0178 - 0x0070)
class UVM_Leaderboard_Player_C final : public UTyrViewModel
{
public:
	class FString                                 UserId;                                            // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   PlayerName;                                        // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Rank;                                              // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Score;                                             // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTyrPlayerTitleData                    TitleData;                                         // 0x0098(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bHasTitle;                                         // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PilotName;                                         // 0x00F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UMaterialInterface>      PilotPortrait;                                     // 0x0100(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	ETyrQueryState                                NameQuery;                                         // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasPilotMaterial;                                 // 0x0129(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLocalPlayer;                                     // 0x012A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bResetMaterialScale;                               // 0x012B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 TierThresholds;                                    // 0x0130(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 TierGroupThresholds;                               // 0x0140(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UMaterialInstance>       RankIcon;                                          // 0x0150(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	int32 GetScoreValue();
	void RefreshPlayerProfile(bool* bDidRefreshFromData);
	void SetUserId(const class FString& InUserId);
	void UpdateFromLeaderboardScore(const struct FLeaderboardScore& InScore, TArray<struct FTyrLeaderboardTierThreshold>& InTierThreholds);

	void GetLocalPlayerTextColor(struct FSlateColor* SlateColor) const;
	void GetRankIconFromScore(TSoftObjectPtr<class UMaterialInstance>* RankIcon_0) const;
	class FText GetRankText() const;
	struct FLinearColor GetRowBackerColor() const;
	class FText GetScoreText() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Leaderboard_Player_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Leaderboard_Player_C")
	}
	static class UVM_Leaderboard_Player_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Leaderboard_Player_C>();
	}
};
DUMPER7_ASSERTS_UVM_Leaderboard_Player_C;

SDK_NAMESPACE_END
