#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Leaderboard_Rank

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Leaderboard_Rank.VM_Leaderboard_Rank_C
// 0x0078 (0x00E8 - 0x0070)
class UVM_Leaderboard_Rank_C final : public UTyrViewModel
{
public:
	class FText                                   RankAndTierName;                                   // 0x0070(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UMaterialInterface>      RankIcon;                                          // 0x0080(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Score;                                             // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RankTierTag;                                       // 0x00AC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x00B4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Glow_Color;                                        // 0x00C4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Rank_Name;                                         // 0x00D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UpdateAsUnranked();
	void UpdateFromLeaderboardScore(const struct FTyrUserLeaderboardScore& InScore);
	void UpdateFromScore(const struct FGameplayTag& InLeaderboardId, int32 InScore);
	void UpdateFromTierAndScore(const struct FGameplayTag& InRankTierTag, int32 InScore);
	void UpdateRankNameAndIcon();
	void UpdateScore(int32 InScore);

	class FText GetPromotionMessage() const;
	class FText GetRankAndScoreText() const;
	class FText GetScoreText() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Leaderboard_Rank_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Leaderboard_Rank_C")
	}
	static class UVM_Leaderboard_Rank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Leaderboard_Rank_C>();
	}
};
DUMPER7_ASSERTS_UVM_Leaderboard_Rank_C;

SDK_NAMESPACE_END
