#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Leaderboards

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Leaderboards.VM_Leaderboards_C
// 0x0040 (0x00B8 - 0x0078)
class UVM_Leaderboards_C final : public UTyrGlobalViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVM_Leaderboard_C*                      SoloLeaderboard;                                   // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVM_Leaderboard_C*                      TeamLeaderboard;                                   // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         FetchProfileUserIds;                               // 0x0090(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         FetchProfileUserIds_InFlight;                      // 0x00A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           FetchProfileRequestTimerHandle;                    // 0x00B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VM_Leaderboards(int32 EntryPoint);
	void FetchPlayerProfile(const class FString& InUserId);
	void OnFailure_3C4BC1AF4C45AFB69BEF90AF1C73756A(const class FString& ErrorMessage);
	void OnFetchPlayerProfiles();
	void OnInitialPlayerReady();
	void OnPlayerReady();
	void OnSuccess_3C4BC1AF4C45AFB69BEF90AF1C73756A(const TArray<class FString>& UserIds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Leaderboards_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Leaderboards_C")
	}
	static class UVM_Leaderboards_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Leaderboards_C>();
	}
};
DUMPER7_ASSERTS_UVM_Leaderboards_C;

SDK_NAMESPACE_END
