#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Matchmaking

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Matchmaking.VM_Matchmaking_C
// 0x0080 (0x00F8 - 0x0078)
class UVM_Matchmaking_C final : public UTyrGlobalViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bIsMatchmaking;                                    // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasFoundMatch;                                    // 0x0081(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInParty;                                        // 0x0082(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPartyLeader;                                    // 0x0083(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPartyReady;                                     // 0x0084(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPartyInGame;                                    // 0x0085(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocalPlayerReady;                               // 0x0086(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldInitialize;                                 // 0x0087(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              MatchmakingTimespan;                               // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           MatchmakingTimerHandle;                            // 0x0090(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               MatchmakingStatusWidget;                           // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               MatchmakingFoundMatchWidget;                       // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SelectedModeTag;                                   // 0x00A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   FoundMatchStatusText;                              // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsWaitingForLobby;                                // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelectedCustomGameMode;                           // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSquadEligible;                                  // 0x00C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   SquadBlockedMessage;                               // 0x00C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsMMRRestricted;                                  // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   MMRRestrictionMessage;                             // 0x00E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCommonActivatableWidget*               MatchFoundModalWidget;                             // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AfterPush_40CE214C4D0BD835C7A079AB1A4BF90C(class UCommonActivatableWidget* UserWidget);
	void AfterPush_70559D5A46A1DAEA54F2C7A8B8B70240(class UCommonActivatableWidget* UserWidget);
	void AfterPush_70F7EA6C48C2B3177653E6ABD110A2FC(class UCommonActivatableWidget* UserWidget);
	void AfterPush_BCF6FA5D463D6C749DE8DB9A3DF85BDF(class UCommonActivatableWidget* UserWidget);
	void BeforePush_40CE214C4D0BD835C7A079AB1A4BF90C(class UCommonActivatableWidget* UserWidget);
	void BeforePush_70559D5A46A1DAEA54F2C7A8B8B70240(class UCommonActivatableWidget* UserWidget);
	void BeforePush_70F7EA6C48C2B3177653E6ABD110A2FC(class UCommonActivatableWidget* UserWidget);
	void BeforePush_BCF6FA5D463D6C749DE8DB9A3DF85BDF(class UCommonActivatableWidget* UserWidget);
	void CancelMatchmaking();
	void ClearMatchmakingStatusWidget();
	void CreatePasswordDialogDescriptor(class UTyrGameDialogDescriptor** Descriptor, class UVM_Dialog_TextInput_C** TextInputViewModel);
	class UVM_Dialog_TextInput_C* CreatePasswordInputViewModel();
	void ExecuteUbergraph_VM_Matchmaking(int32 EntryPoint);
	void IncrementMatchmakingTimer();
	void JoinCustomGame(const class FString& InJoinCode);
	void OnConnectToLocalServer();
	void OnCreatedMatchMessage(const struct FTyrMatchmakingCreateMatchMessage& Payload);
	void OnFailedMatchMessage(const struct FTyrMatchmakingFailedToFindMatchMessage& Payload);
	void OnFoundMatchMessage();
	void OnJoinCustomGame(const class FString& JoinCode);
	void OnJoinedCustomGameLobby(const struct FTyrLobbyJoinedMessage& Message);
	void OnLobbyConnectError();
	void OnLobbyReadyToConnect();
	void OnMatchmakingDequeuedMessage();
	void OnMatchmakingNoRulesMessage(const struct FTyrMatchmakingNoQueueAvailableMessage& Payload);
	void OnMatchmakingQueuedMessage();
	void OnMatchmakingStarted();
	void OnMatchmakingStopped();
	void OnMessageReceived_18CC55774C0304329ABB35A9A56B5680(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_2E6B19594A0896EB25EABE87EC896380(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_33EF863C4CE2036B51F42193E6A2A0D8(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_59B4DF0041DCEEBA4507B9A0BE2A10B1(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_602B7FF340577C98DA90C7A3D43052DB(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_6A1E6CC14053E5A1B61F08B8CF27871A(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_75476314449286FA53C3FC8155D963D9(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_7A887DE14AAFCD9CEB8D709244A60980(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_8E14941F4B7FBA0CA925E4BBD58A5CA1(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_A39366CE45344A836192D2899BA1ED99(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_A6CEE67A4CA5D446C2E94DA398105AC0(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_BC0231CA43BFE4908962E59069866ED6(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_C0FEA894470F3D9DCA921481CC21A3A4(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_D1E43490407E3193540A6DB157971DEF(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_E3FB941244A7F4A13F0BE0B22A68DD93(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_E6F68DEB47B599EF5B3CE993489D9819(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_EE171DFD414D38F2BEE87AAD9C7DEDF0(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnPartyUpdateMetadata(const struct FTyrPartyMetadataUpdatedMessage& InParty);
	void OnPlayCustomGame();
	void OnPlayerReady();
	void OnPlayMatchmadeGame(const class FString& QueueTag);
	void OnPlaySandboxGame();
	void OnResult_46CC6A324441541F7F3B3084F8875961(ETyrMessagingResult Result);
	void OnResult_549541AF4DCE650131F7769C57463EE4(ETyrMessagingResult Result);
	void OnResult_59F0ADDA4932B0968B2719A307A14235(ETyrMessagingResult Result);
	void OnResult_892321BD47A6215B6E94D288F8522D15(ETyrMessagingResult Result);
	void OnServicesUpdateGameModes();
	void OnWaitingForLobby();
	void PlaySelectedGameMode();
	void RefreshPartyState(const class FString& InContext);
	void ResetSelectedModeIfIneligible();
	void SetDefautlGameModeFromConfig();
	void SetSelectedGameMode(const struct FGameplayTag& InGameModeTag);
	bool ShouldShowSquadRequirement();
	void ShowMatchmakingCanceledNotification();
	void StartMatchmakingTimer();
	void StopMatchmakingTimer();
	void UpdateMMRRestriction();
	void UpdateSquadEligibility();

	bool CanCancelMatchmaking() const;
	bool CanChangeGameMode() const;
	bool CanReady() const;
	bool CanStartMatchmaking() const;
	bool CanUnready() const;
	class FText GetFindingMatchText() const;
	class FText GetFindingMatchTimerText() const;
	class FText GetMatchmakingButtonLabel() const;
	bool IsMatchmakingOrMatched() const;
	bool ShouldShowJoinButton() const;
	bool ShouldShowPlayButton() const;
	bool ShouldShowWaitingForLeaderMessage() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Matchmaking_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Matchmaking_C")
	}
	static class UVM_Matchmaking_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Matchmaking_C>();
	}
};
DUMPER7_ASSERTS_UVM_Matchmaking_C;

SDK_NAMESPACE_END
