#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_MediaControls

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function VM_MediaControls.VM_MediaControls_C.ExecuteUbergraph_VM_MediaControls
// 0x0018 (0x0018 - 0x0000)
struct VM_MediaControls_C_ExecuteUbergraph_VM_MediaControls final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrMediaControlPlaybackState                 K2Node_Event_InPlaybackState;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              K2Node_Event_CurrentTime;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_Event_Duration;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_MediaControls_C_ExecuteUbergraph_VM_MediaControls;

// Function VM_MediaControls.VM_MediaControls_C.OnPlaybackStateChanged_BP
// 0x0001 (0x0001 - 0x0000)
struct VM_MediaControls_C_OnPlaybackStateChanged_BP final
{
public:
	ETyrMediaControlPlaybackState                 InPlaybackState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_MediaControls_C_OnPlaybackStateChanged_BP;

// Function VM_MediaControls.VM_MediaControls_C.OnTimeChanged_BP
// 0x0010 (0x0010 - 0x0000)
struct VM_MediaControls_C_OnTimeChanged_BP final
{
public:
	struct FTimespan                              CurrentTime;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Duration;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_MediaControls_C_OnTimeChanged_BP;

// Function VM_MediaControls.VM_MediaControls_C.GetPercentComplete
// 0x0028 (0x0028 - 0x0000)
struct VM_MediaControls_C_GetPercentComplete final
{
public:
	double                                        Percent;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetDuration_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCurrentTime_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TimespanRatio_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_Percent_ImplicitCast;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_MediaControls_C_GetPercentComplete;

// Function VM_MediaControls.VM_MediaControls_C.GetPlaybackStateBrush
// 0x0220 (0x0220 - 0x0000)
struct VM_MediaControls_C_GetPlaybackStateBrush final
{
public:
	struct FSlateBrush                            NewParam;                                          // 0x0000(0x00B0)(Parm, OutParm)
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x00B0(0x00B0)()
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue_1;       // 0x0160(0x00B0)()
	ETyrMediaControlPlaybackState                 CallFunc_GetPlaybackState_ReturnValue;             // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_MediaControls_C_GetPlaybackStateBrush;

// Function VM_MediaControls.VM_MediaControls_C.GetTimeText
// 0x00F0 (0x00F0 - 0x0000)
struct VM_MediaControls_C_GetTimeText final
{
public:
	class FText                                   Time;                                              // 0x0000(0x0010)(Parm, OutParm)
	struct FTimespan                              CallFunc_GetDuration_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCurrentTime_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_AsTimespan_Timespan_ReturnValue;          // 0x0020(0x0010)()
	class FText                                   CallFunc_AsTimespan_Timespan_ReturnValue_1;        // 0x0030(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0010)()
};
DUMPER7_ASSERTS_VM_MediaControls_C_GetTimeText;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
