#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_MainMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_MainMenu.VM_MainMenu_C
// 0x00D8 (0x0150 - 0x0078)
class UVM_MainMenu_C final : public UTyrGlobalViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UVM_GameMode_C*>                 GameModes;                                         // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UVM_GameMode_C*                         SelectedGameMode;                                  // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowBackground;                                   // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrStateOverride                      ShowBackgroundOverrides;                           // 0x00A0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bShowBackgroundDarkenEffect;                       // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowTopBar;                                       // 0x00F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrStateOverride                      ShowTopBarOverrides;                               // 0x00F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   DesiredTabId;                                      // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddGameMode(const struct FTyrGameModeEntry& InGameModeData, class UVM_GameMode_C** NewGameMode);
	void ExecuteUbergraph_VM_MainMenu(int32 EntryPoint);
	void GetDesiredTabId(class FName* TabId);
	void InitializeGameModes();
	void OnInitialPlayerReady();
	void OnMessageReceived_D09C4BB64E1DF7DB951BEA9C375070A7(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void RefreshGameModes();
	void SetBackgroundVisible(bool bInShouldShow, class FName InIdentifier);
	void SetDesiredTabId(class FName InTabId);
	void SetSelectedGameMode(const struct FGameplayTag& InGameModeTag);
	void SetTopBarVisible(bool bInShouldShow, class FName InIdentifier);
	void ShowBackgroundDarkenEffect(bool bInShouldShow);

	class UVM_GameMode_C* GetGameMode(const struct FGameplayTag& InGameModeTag) const;
	void GetQuickStartLabel(class FText* Result) const;
	struct FGameplayTag GetSelectedGameModeTag() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_MainMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_MainMenu_C")
	}
	static class UVM_MainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_MainMenu_C>();
	}
};
DUMPER7_ASSERTS_UVM_MainMenu_C;

SDK_NAMESPACE_END
