#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Progression

#include "Basic.hpp"

#include "DataRegistry_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Progression.VM_Progression_C
// 0x00D0 (0x0148 - 0x0078)
class UVM_Progression_C final : public UTyrProgressionViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bHasValidProgression;                              // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVM_Vehicle_C*>                  VehicleUnlockTracks;                               // 0x0088(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           VehicleTrackOrder;                                 // 0x0098(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UVM_Vehicle_C*                          NextVehicleUnlockTrack;                            // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UVM_Vehicle_C*>                  LightVehicles;                                     // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UVM_Vehicle_C*>                  MediumVehicles;                                    // 0x00C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UVM_Vehicle_C*>                  HeavyVehicles;                                     // 0x00D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnProgressionReady;                                // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<struct FGameplayTag, class UVM_Vehicle_Levels_C*> VehicleMasteryTracks;                     // 0x00F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bHasAnyVehicleBreadcrumbs;                         // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VM_Progression(int32 EntryPoint);
	void FindOrAddVehicleMastery(const struct FTrackableBlob& InTrackableData, const struct FGameplayTag& InVehicleTag, class UVM_Vehicle_Levels_C** VehicleMastery);
	void FindOrAddVehicleUnlock(const struct FTrackableBlob& InTrackableData, const struct FGameplayTag& InVehicleTag, class UVM_Vehicle_C** VEHICLEUNLOCK);
	void GetVehicleMasteryTrack(const struct FGameplayTag& InVehicleTag, class UVM_Vehicle_Levels_C** MasteryTrack);
	void HandleClaimedXP(TArray<struct FClaimXPBlob>& InClaims);
	void On_Inventory_Received_Message();
	void On_Progression_Received_Message();
	void OnCategoryBreadcrumbChanged(const struct FGameplayTag& Category);
	void OnInitialized();
	void OnInitialPlayerReady();
	void OnMessageReceived_0C3B002E45692AF073BD0A81DE61B5C8(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_1CA94F654D08AA6AFC0386A9D5E9AC49(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_45839A6145A9914F622DCFB9ED3D37C6(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void RefreshNextVehicleUnlockTrack();
	void SortLobbyVehiclesByNameAndWIP(class UObject* InVehicleA, class UObject* InVehicleB, bool* Result);
	void SortVehicleClassArrays();
	void UpdateVehicleProgression();
	void UpdateVehiclePurchaseAmounts();
	void ValidateVehicleProgressionViewModels();

	void GetCurrentVehicleUnlockTrack(class UVM_Vehicle_C** CurrentTrack) const;
	void GetVehicleTrackFromTag(const struct FGameplayTag& InVehicleTag, class UVM_Vehicle_C** VehicleTrack) const;
	void GetVehicleTrackFromVehicleId(class FName InVehicleId, class UVM_Vehicle_C** VehicleTrack) const;
	void GetVehicleUnlockTrack(class FName InTrackID, class UVM_Vehicle_C** VehicleTrack) const;
	bool HasNextVehicleTrack() const;
	bool HasVehicleUnlockTrack(class FName InTrackID) const;
	void IsProgressionEnabled(bool* IsEnabled) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Progression_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Progression_C")
	}
	static class UVM_Progression_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Progression_C>();
	}
};
DUMPER7_ASSERTS_UVM_Progression_C;

SDK_NAMESPACE_END
