#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_PlayerProfile

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function VM_PlayerProfile.VM_PlayerProfile_C.SetTitleData
// 0x0060 (0x0060 - 0x0000)
struct VM_PlayerProfile_C_SetTitleData final
{
public:
	bool                                          bInHasTitle;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrPlayerTitleData                    InTitleData;                                       // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_1; // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerProfile_C_SetTitleData;

// Function VM_PlayerProfile.VM_PlayerProfile_C.SetTitleTag
// 0x0008 (0x0008 - 0x0000)
struct VM_PlayerProfile_C_SetTitleTag final
{
public:
	struct FGameplayTag                           InTitleTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerProfile_C_SetTitleTag;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
