#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_PlayerAmmunition_Slot

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_PlayerAmmunition_Slot.VM_PlayerAmmunition_Slot_C
// 0x0060 (0x00D0 - 0x0070)
class UVM_PlayerAmmunition_Slot_C final : public UTyrViewModel
{
public:
	struct FGameplayTag                           IndexTag;                                          // 0x0070(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TypeTag;                                           // 0x0078(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0080(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bIsInfinite;                                       // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   InputKey;                                          // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UInputAction*                           InputAction;                                       // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsActive;                                         // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValid;                                          // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsNextCycleSlot;                                  // 0x00CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_PlayerAmmunition_Slot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_PlayerAmmunition_Slot_C")
	}
	static class UVM_PlayerAmmunition_Slot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_PlayerAmmunition_Slot_C>();
	}
};
DUMPER7_ASSERTS_UVM_PlayerAmmunition_Slot_C;

SDK_NAMESPACE_END
