#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_PlayerProfile

#include "Basic.hpp"

#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_PlayerProfile.VM_PlayerProfile_C
// 0x0098 (0x0108 - 0x0070)
class UVM_PlayerProfile_C final : public UTyrViewModel
{
public:
	class FText                                   PlayerName;                                        // 0x0070(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0080(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bHasTitle;                                         // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrPlayerTitleData                    TitleData;                                         // 0x00B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           TitleTag;                                          // 0x0100(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetTitleData(bool bInHasTitle, const struct FTyrPlayerTitleData& InTitleData);
	void SetTitleTag(const struct FGameplayTag& InTitleTag);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_PlayerProfile_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_PlayerProfile_C")
	}
	static class UVM_PlayerProfile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_PlayerProfile_C>();
	}
};
DUMPER7_ASSERTS_UVM_PlayerProfile_C;

SDK_NAMESPACE_END
