#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_PlayerAutoFlip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_PlayerAutoFlip.VM_PlayerAutoFlip_C
// 0x0058 (0x0180 - 0x0128)
class UVM_PlayerAutoFlip_C final : public UTyrPlayerViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0128(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TotalDuration;                                     // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeRemaining;                                     // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFlipped;                                        // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncTaskCooldownChanged*              CooldownChangeListener;                            // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(double TimeRemaining_0, double Duration)> OnAbilityCooldownAdded;  // 0x0148(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnAbilityCooldownRemoved;                          // 0x0158(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           UpdateCooldownTimerHandle;                         // 0x0168(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CooldownTag;                                       // 0x0170(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTyrAbilitySystemComponent*             InfoASC;                                           // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VM_PlayerAutoFlip(int32 EntryPoint);
	void K2_OnSpectatorTargetPawnUpdated(class ATyrWheeledVehiclePawnBase* PreviousTarget, class ATyrWheeledVehiclePawnBase* NewTarget);
	void OnCooldownBegin_3575F5E94433DA0CE92D28A06A5958CC(const struct FGameplayTag& CooldownTag_0, float TimeRemaining_0, float Duration);
	void OnCooldownEnd_3575F5E94433DA0CE92D28A06A5958CC(const struct FGameplayTag& CooldownTag_0, float TimeRemaining_0, float Duration);
	void OnDeinitialized();
	void OnInitializedForPlayer();
	void SetupCooldownListeners();
	void StartCooldownTracking();
	void UpdateCooldown();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_PlayerAutoFlip_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_PlayerAutoFlip_C")
	}
	static class UVM_PlayerAutoFlip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_PlayerAutoFlip_C>();
	}
};
DUMPER7_ASSERTS_UVM_PlayerAutoFlip_C;

SDK_NAMESPACE_END
