#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_PlayerScoreboard_InGame

#include "Basic.hpp"

#include "Tyr_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "DataRegistry_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.BindListenersToPlayerRecord
// 0x00B0 (0x00B0 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_BindListenersToPlayerRecord final
{
public:
	TDelegate<void(class UObject* ObjectChangingTeam, int32 OldTeamID, int32 NewTeamID)> K2Node_CreateDelegate_OutputDelegate; // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NewVehicleTag)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APawn* OldPawn, class APawn* NewPawn)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ATyrPlayerStateBase* OwningPlayerState, const struct FGameplayTag& NewKeystoneTag)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_BindListenersToPlayerRecord;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.ExecuteUbergraph_VM_PlayerScoreboard_InGame
// 0x0118 (0x0118 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_ExecuteUbergraph_VM_PlayerScoreboard_InGame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrPlayerStateMessage                 Temp_struct_Variable;                              // 0x0008(0x0020)(NoDestructor)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate; // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTyrPlayerStateMessage                 Temp_struct_Variable_1;                            // 0x0050(0x0020)(NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATyrPlayerRecord*                       CallFunc_GetPlayerRecord_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InTeamId;                       // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_1; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetUserId_ReturnValue;                    // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetKeystoneTalentTag_ReturnValue;         // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATyrPlayerStateBase*                    CallFunc_GetOwningPlayerState_ReturnValue;         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_2; // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_3; // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamId_ReturnValue;                    // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_4; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetVehicleTag_ReturnValue;                // 0x00DC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATyrWheeledVehiclePawnBase*             K2Node_Event_Pawn;                                 // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_PartyId;                              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_5; // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_6; // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_ExecuteUbergraph_VM_PlayerScoreboard_InGame;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.FindAndAssignLocalPlayerRecord
// 0x0020 (0x0020 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_FindAndAssignLocalPlayerRecord final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATyrPlayerStateBase*                    K2Node_DynamicCast_AsTyr_Player_State_Base;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_FindAndAssignLocalPlayerRecord;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.InitializeDivider
// 0x0004 (0x0004 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_InitializeDivider final
{
public:
	int32                                         InTeamId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_InitializeDivider;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.K2_OnLocalVehiclePawnReady
// 0x0008 (0x0008 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_K2_OnLocalVehiclePawnReady final
{
public:
	class ATyrWheeledVehiclePawnBase*             Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_K2_OnLocalVehiclePawnReady;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.OnIsLocalPlayerChanged
// 0x0020 (0x0020 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_OnIsLocalPlayerChanged final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamId_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPartyId_ReturnValue;                   // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_OnIsLocalPlayerChanged;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.OnKeystoneTalentTagChanged
// 0x0010 (0x0010 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_OnKeystoneTalentTagChanged final
{
public:
	class ATyrPlayerStateBase*                    InOwningPlayerState;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InNewKeystoneTag;                                  // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_OnKeystoneTalentTagChanged;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.OnLocalPartyIdChanged
// 0x0020 (0x0020 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_OnLocalPartyIdChanged final
{
public:
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_1; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPartyId_ReturnValue;                   // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_OnLocalPartyIdChanged;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.OnLocalPlayerPartyIdUpdated
// 0x0010 (0x0010 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_OnLocalPlayerPartyIdUpdated final
{
public:
	class FString                                 PartyId;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_OnLocalPlayerPartyIdUpdated;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.OnMessageReceived_E3FC87A54CCF11E73F38ACBE028E9D91
// 0x0010 (0x0010 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_OnMessageReceived_E3FC87A54CCF11E73F38ACBE028E9D91 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_OnMessageReceived_E3FC87A54CCF11E73F38ACBE028E9D91;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.OnRecordAmmunitionTagContainerChanged
// 0x0050 (0x0050 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_OnRecordAmmunitionTagContainerChanged final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CallFunc_GetAmmunitionTagContainer_ReturnValue;    // 0x0010(0x0010)(ReferenceParm)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_OnRecordAmmunitionTagContainerChanged;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.OnRecordIsAliveChanged
// 0x0002 (0x0002 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_OnRecordIsAliveChanged final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_OnRecordIsAliveChanged;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.OnRecordIsOnlySpectatorChanged
// 0x0002 (0x0002 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_OnRecordIsOnlySpectatorChanged final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_OnRecordIsOnlySpectatorChanged;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.OnRecordOwningPawnChanged
// 0x0018 (0x0018 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_OnRecordOwningPawnChanged final
{
public:
	class APawn*                                  InOldPawn;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  InNewPawn;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_OnRecordOwningPawnChanged;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.OnRecordPlayerNameChanged
// 0x0030 (0x0030 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_OnRecordPlayerNameChanged final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_FilterPlayerName_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_OnRecordPlayerNameChanged;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.OnRecordPlayerTitleChanged
// 0x0060 (0x0060 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_OnRecordPlayerTitleChanged final
{
public:
	bool                                          CallFunc_FindTitleData_bOutDidFindTitle;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrPlayerTitleData                    CallFunc_FindTitleData_OutTitleData;               // 0x0008(0x0050)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_1; // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_OnRecordPlayerTitleChanged;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.OnRecordStatTagsChanged
// 0x0018 (0x0018 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_OnRecordStatTagsChanged final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStatTagStackCount_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStatTagStackCount_ReturnValue_1;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStatTagStackCount_ReturnValue_2;       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStatTagStackCount_ReturnValue_3;       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_1; // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_2; // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_3; // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_OnRecordStatTagsChanged;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.OnRecordTeamChanged
// 0x0018 (0x0018 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_OnRecordTeamChanged final
{
public:
	class UObject*                                InObjectChangingTeam;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         InOldTeamID;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InNewTeamID;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_OnRecordTeamChanged;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.OnRecordVehicleTagChanged
// 0x04F0 (0x04F0 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_OnRecordVehicleTagChanged final
{
public:
	struct FGameplayTag                           InNewVehicleTag;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataRegistryId                        K2Node_MakeStruct_DataRegistryId;                  // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataRegistryId                        K2Node_MakeStruct_DataRegistryId_1;                // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EDataRegistrySubsystemGetItemResult           CallFunc_FindCachedItemBP_OutResult;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTankDataTableStruct                   CallFunc_FindCachedItemBP_OutItem;                 // 0x0038(0x0270)(ConstParm)
	EDataRegistrySubsystemGetItemResult           CallFunc_FindCachedItemBP_OutResult_1;             // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrVehicleUIDataTableStruct           CallFunc_FindCachedItemBP_OutItem_1;               // 0x02B0(0x0238)(ConstParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x04E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x04EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x04EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_1; // 0x04EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_2; // 0x04ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_3; // 0x04EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_OnRecordVehicleTagChanged;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.ResolveKeystoneFromTag
// 0x0108 (0x0108 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_ResolveKeystoneFromTag final
{
public:
	struct FGameplayTag                           InKeystoneTag;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataRegistryId                        K2Node_MakeStruct_DataRegistryId;                  // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDataRegistrySubsystemGetItemResult           CallFunc_FindCachedItemBP_OutResult;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrTalentDataTableStruct              CallFunc_FindCachedItemBP_OutItem;                 // 0x0028(0x00B8)(ConstParm)
	class FText                                   CallFunc_GetTechTalentFormattedDescriptionFromRow_OutDescription; // 0x00E0(0x0010)()
	class FText                                   CallFunc_GetTechTalentFormattedDescriptionFromRow_OutSupplementalDescription; // 0x00F0(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_1; // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_2; // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_3; // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_4; // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_5; // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_6; // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_ResolveKeystoneFromTag;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.UnbindListenersFromPlayerRecord
// 0x00A4 (0x00A4 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_UnbindListenersFromPlayerRecord final
{
public:
	TDelegate<void(const struct FGameplayTag& NewVehicleTag)> K2Node_CreateDelegate_OutputDelegate;  // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* ObjectChangingTeam, int32 OldTeamID, int32 NewTeamID)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ATyrPlayerStateBase* OwningPlayerState, const struct FGameplayTag& NewKeystoneTag)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_UnbindListenersFromPlayerRecord;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.GetTankBlur
// 0x0018 (0x0018 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_GetTankBlur final
{
public:
	struct FTyrMaterialScalarParam                OutTextureScale;                                   // 0x0000(0x000C)(Parm, OutParm, NoDestructor)
	struct FTyrMaterialScalarParam                K2Node_MakeStruct_TyrMaterialScalarParam;          // 0x000C(0x000C)(NoDestructor)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_GetTankBlur;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.GetTankDesaturation
// 0x0028 (0x0028 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_GetTankDesaturation final
{
public:
	struct FTyrMaterialScalarParam                OutResult;                                         // 0x0000(0x000C)(Parm, OutParm, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTyrMaterialScalarParam                K2Node_MakeStruct_TyrMaterialScalarParam;          // 0x001C(0x000C)(NoDestructor)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_GetTankDesaturation;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.GetTankMipLevel
// 0x0018 (0x0018 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_GetTankMipLevel final
{
public:
	struct FTyrMaterialScalarParam                Return_Node;                                       // 0x0000(0x000C)(Parm, OutParm, NoDestructor)
	struct FTyrMaterialScalarParam                K2Node_MakeStruct_TyrMaterialScalarParam;          // 0x000C(0x000C)(NoDestructor)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_GetTankMipLevel;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.GetTankTextureScale
// 0x0018 (0x0018 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_GetTankTextureScale final
{
public:
	struct FTyrMaterialScalarParam                OutTextureScale;                                   // 0x0000(0x000C)(Parm, OutParm, NoDestructor)
	struct FTyrMaterialScalarParam                K2Node_MakeStruct_TyrMaterialScalarParam;          // 0x000C(0x000C)(NoDestructor)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_GetTankTextureScale;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.SetAssistDamageText
// 0x0028 (0x0028 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_SetAssistDamageText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0010)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_SetAssistDamageText;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.SetDamageBlockedText
// 0x0028 (0x0028 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_SetDamageBlockedText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0010)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_SetDamageBlockedText;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.SetDamageDoneText
// 0x0028 (0x0028 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_SetDamageDoneText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0010)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_SetDamageDoneText;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.SetIsLocalPlayerTextColor
// 0x0010 (0x0010 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_SetIsLocalPlayerTextColor final
{
public:
	struct FLinearColor                           OutColor;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_SetIsLocalPlayerTextColor;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.SetIsLocalPlayerTextColor_Slate
// 0x0064 (0x0064 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_SetIsLocalPlayerTextColor_Slate final
{
public:
	struct FSlateColor                            OutSlateColor;                                     // 0x0000(0x0014)(Parm, OutParm)
	struct FSlateColor                            CallFunc_ToSlateColor_ReturnValue;                 // 0x0014(0x0014)()
	struct FSlateColor                            CallFunc_ToSlateColor_ReturnValue_1;               // 0x0028(0x0014)()
	struct FSlateColor                            CallFunc_ToSlateColor_ReturnValue_2;               // 0x003C(0x0014)()
	struct FSlateColor                            CallFunc_ToSlateColor_ReturnValue_3;               // 0x0050(0x0014)()
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_SetIsLocalPlayerTextColor_Slate;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.SetIsLocalPlayerTextFont
// 0x00E0 (0x00E0 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_SetIsLocalPlayerTextFont final
{
public:
	struct FSlateFontInfo                         SlateFontInfo;                                     // 0x0000(0x0060)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0080(0x0060)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_SetIsLocalPlayerTextFont;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.SetKillsText
// 0x0028 (0x0028 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_SetKillsText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0010)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_SetKillsText;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.SetStatsTextFont
// 0x00E0 (0x00E0 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_SetStatsTextFont final
{
public:
	struct FSlateFontInfo                         SlateFontInfo;                                     // 0x0000(0x0060)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0080(0x0060)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_SetStatsTextFont;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.SetTitleOpacity
// 0x0008 (0x0008 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_SetTitleOpacity final
{
public:
	double                                        OutOpacity;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_SetTitleOpacity;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.SetWidgetIndex
// 0x0030 (0x0030 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_SetWidgetIndex final
{
public:
	int32                                         OutIndex;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrTeamSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdA;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdB;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrTeamComparison                            CallFunc_CompareTeams_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_SetWidgetIndex;

// Function VM_PlayerScoreboard_InGame.VM_PlayerScoreboard_InGame_C.ShouldPlusBeVisible
// 0x0002 (0x0002 - 0x0000)
struct VM_PlayerScoreboard_InGame_C_ShouldPlusBeVisible final
{
public:
	bool                                          bOutResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PlayerScoreboard_InGame_C_ShouldPlusBeVisible;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
