#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_PilotBoosterConsumable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "TyrSharedTypes_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function VM_PilotBoosterConsumable.VM_PilotBoosterConsumable_C.ApplyConsumable
// 0x0008 (0x0008 - 0x0000)
struct VM_PilotBoosterConsumable_C_ApplyConsumable final
{
public:
	struct FGameplayTag                           InVehicleTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PilotBoosterConsumable_C_ApplyConsumable;

// Function VM_PilotBoosterConsumable.VM_PilotBoosterConsumable_C.ExecuteUbergraph_VM_PilotBoosterConsumable
// 0x0210 (0x0210 - 0x0000)
struct VM_PilotBoosterConsumable_C_ExecuteUbergraph_VM_PilotBoosterConsumable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Garage_C*                           CallFunc_GetGarageViewModel_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USnapserInventorySubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrOnlineSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UTyrOnlineUserInfo*               CallFunc_GetUserInfoForLocalPlayerIndex_ReturnValue; // 0x0028(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_ClaimExperience_C*                  CallFunc_SpawnObject_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_InVehicleTag;                   // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugStringFromGameplayTag_ReturnValue; // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FInstancedStruct>               Temp_struct_Variable;                              // 0x0060(0x0010)(ReferenceParm)
	TMap<class FString, class FString>            K2Node_MakeMap_Map;                                // 0x0070(0x0050)()
	struct FInstancedStruct                       Temp_struct_Variable_1;                            // 0x00C0(0x0010)()
	class USnapserAsyncActionApplyConsumable*     CallFunc_ApplyConsumable_ReturnValue;              // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EStructUtilsResult                            CallFunc_GetInstancedStructValue_ExecResult;       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FApplyPilotBoosterResponseData         CallFunc_GetInstancedStructValue_Value;            // 0x00E0(0x0030)(ConstParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FClaimXPBlob>                   K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrInventoryMessage                   K2Node_Event_Payload;                              // 0x0130(0x0010)(NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetItemInformationMetadataNumberField_ReturnValue; // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           CallFunc_GetLocalPlayer_ReturnValue;               // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ConsumableId;                   // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FInstancedStruct>               K2Node_CustomEvent_AdditionalConsumablesApplied;   // 0x0170(0x0010)(ConstParm, ReferenceParm)
	struct FInstancedStruct                       K2Node_CustomEvent_Response;                       // 0x0180(0x0010)(ConstParm)
	class UTyrProgressionSubsystem*               CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrProgressionSubsystem*               CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1; // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ConsumableId, const TArray<struct FInstancedStruct>& AdditionalConsumablesApplied, const struct FInstancedStruct& Response)> K2Node_CreateDelegate_OutputDelegate; // 0x01A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ConsumableId_1;                 // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ErrorMessage;                   // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ConsumableId, const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate_1; // 0x01D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x01F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Garage_C*                           CallFunc_GetGarageViewModel_ReturnValue_1;         // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PilotBoosterConsumable_C_ExecuteUbergraph_VM_PilotBoosterConsumable;

// Function VM_PilotBoosterConsumable.VM_PilotBoosterConsumable_C.On Inventory Received Message
// 0x0010 (0x0010 - 0x0000)
struct VM_PilotBoosterConsumable_C_On_Inventory_Received_Message final
{
public:
	struct FTyrInventoryMessage                   Payload;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_VM_PilotBoosterConsumable_C_On_Inventory_Received_Message;

// Function VM_PilotBoosterConsumable.VM_PilotBoosterConsumable_C.OnFailure_882B4AE4458F8F703D8A549A36EC74D8
// 0x0020 (0x0020 - 0x0000)
struct VM_PilotBoosterConsumable_C_OnFailure_882B4AE4458F8F703D8A549A36EC74D8 final
{
public:
	class FString                                 ConsumableId;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ErrorMessage;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PilotBoosterConsumable_C_OnFailure_882B4AE4458F8F703D8A549A36EC74D8;

// Function VM_PilotBoosterConsumable.VM_PilotBoosterConsumable_C.OnSuccess_882B4AE4458F8F703D8A549A36EC74D8
// 0x0030 (0x0030 - 0x0000)
struct VM_PilotBoosterConsumable_C_OnSuccess_882B4AE4458F8F703D8A549A36EC74D8 final
{
public:
	class FString                                 ConsumableId;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FInstancedStruct>               AdditionalConsumablesApplied;                      // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FInstancedStruct                       Response;                                          // 0x0020(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_VM_PilotBoosterConsumable_C_OnSuccess_882B4AE4458F8F703D8A549A36EC74D8;

// Function VM_PilotBoosterConsumable.VM_PilotBoosterConsumable_C.GetDescription
// 0x0098 (0x0098 - 0x0000)
struct VM_PilotBoosterConsumable_C_GetDescription final
{
public:
	class FText                                   Description;                                       // 0x0000(0x0010)(Parm, OutParm)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0010)()
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_PilotBoosterConsumable_C_GetDescription;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
