#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_PlayerProfile_Title

#include "Basic.hpp"

#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_PlayerProfile_Title.VM_PlayerProfile_Title_C
// 0x0070 (0x00E0 - 0x0070)
class UVM_PlayerProfile_Title_C final : public UTyrViewModel
{
public:
	struct FTyrPlayerTitleData                    TitleData;                                         // 0x0070(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsLocked;                                         // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasTitleData;                                     // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TitleItemId;                                       // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayTag                           TitleTag;                                          // 0x00D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetAsEmptyTitle();
	void SetTitleData(const struct FTyrPlayerTitleData& InTitleData, const struct FGameplayTag& InTitleTag, const class FString& InTitleItemId, bool bInIsLocked);

	bool CanSelectTitle() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_PlayerProfile_Title_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_PlayerProfile_Title_C")
	}
	static class UVM_PlayerProfile_Title_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_PlayerProfile_Title_C>();
	}
};
DUMPER7_ASSERTS_UVM_PlayerProfile_Title_C;

SDK_NAMESPACE_END
