#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Ranked_Info_TierGroup

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Ranked_Info_TierGroup.VM_Ranked_Info_TierGroup_C
// 0x0078 (0x00E8 - 0x0070)
class UVM_Ranked_Info_TierGroup_C final : public UTyrViewModel
{
public:
	struct FGameplayTag                           TierGroupTag;                                      // 0x0070(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      TierGroupIcon;                                     // 0x0078(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   TierGroupName;                                     // 0x00A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FText>                           TierLabels;                                        // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsLowestTierGroup;                                // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHighestTierGroup;                               // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateChildSize                        TopSpacing;                                        // 0x00C4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSlateChildSize                        BottomSpacing;                                     // 0x00CC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSlateChildSize                        DetailsSpacing;                                    // 0x00D4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	int32                                         RequiredThreshold;                                 // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TargetThreshold;                                   // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddTierLabel(const class FText& InTierLabel);
	void SetSizing(float InTopSpacing, double InBottomSpacing, double InDetailsSpacing);
	void SetTargetThreshold(int32 InThreshold);

	struct FVector2D GetTargetThresholdContentAnchor() const;
	class FText GetTargetThresholdText() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Ranked_Info_TierGroup_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Ranked_Info_TierGroup_C")
	}
	static class UVM_Ranked_Info_TierGroup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Ranked_Info_TierGroup_C>();
	}
};
DUMPER7_ASSERTS_UVM_Ranked_Info_TierGroup_C;

SDK_NAMESPACE_END
