#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Scoreboard_InGame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Scoreboard_InGame.VM_Scoreboard_InGame_C
// 0x0090 (0x0128 - 0x0098)
class UVM_Scoreboard_InGame_C final : public UTyrGameStateViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UVM_PlayerScoreboard_InGame_C*>  AllyTeamWithDividers;                              // 0x00A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UVM_PlayerScoreboard_InGame_C*>  EnemyTeamWithDividers;                             // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UVM_PlayerScoreboard_InGame_C*>  AllyTeam;                                          // 0x00C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UVM_PlayerScoreboard_InGame_C*>  EnemyTeam;                                         // 0x00D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   LocalPlayerId;                                     // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   MapName;                                           // 0x00E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         AllyTeamId;                                        // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnemyTeamId;                                       // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 LocalPlayerPartyId;                                // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UAsyncAction_ListenForGameplayMessage*> MessageListeners;                           // 0x0110(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bHasFoundLocalPlayer;                              // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AssignIsFirstLastEntryInVehicleClassToVMs(TArray<class UVM_PlayerScoreboard_InGame_C*>& InTeamArray);
	void BuildTeamArrayWithDividers(TArray<class UVM_PlayerScoreboard_InGame_C*>& InTeamViewModels, int32 InTeamId, TArray<class UVM_PlayerScoreboard_InGame_C*>* OutWithDividers);
	void CheckScoreboardVMContextReady(bool* bOutReady);
	void Compare_VMPlayer_Predicate(const class UObject* InA, const class UObject* InB, bool* OutResult);
	void Compare_VMPlayerVehicleClass_Predicate(const class UObject* InA, const class UObject* InB, bool* OutResult);
	void ExecuteUbergraph_VM_Scoreboard_InGame(int32 EntryPoint);
	void FindAndAssignLocalPlayerInfo(bool* FoundLocalPlayer, int32* TeamId, class FString* PartyId);
	void InitializeFromPlayerRecords(const TArray<class ATyrPlayerRecord*>& InPlayerRecords);
	void OnDeinitialized();
	void OnInitializedForGameState();
	void OnLocalPlayerTeamIdChanged(int32 OldTeamID, int32 NewTeamID);
	void OnMessageReceived_5D1D286F42E1BB94D73D5895401846CC(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_A482DFD94304989C08A5C986448F1067(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_AE0D61DE4C079E81455E3AB1099ADF66(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_E80C16A3491B47B75F1D72BE0660E0A6(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void RefreshTeamArrays();
	void UpdatePlayersFromUserRecords(TArray<class ATyrPlayerRecord*>& InPlayerRecords);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Scoreboard_InGame_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Scoreboard_InGame_C")
	}
	static class UVM_Scoreboard_InGame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Scoreboard_InGame_C>();
	}
};
DUMPER7_ASSERTS_UVM_Scoreboard_InGame_C;

SDK_NAMESPACE_END
