#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_SaluteConsumable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "TyrSharedTypes_structs.hpp"
#include "VM_ConsumableBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_SaluteConsumable.VM_SaluteConsumable_C
// 0x0190 (0x0330 - 0x01A0)
class UVM_SaluteConsumable_C final : public UVM_ConsumableBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_VM_SaluteConsumable_C;              // 0x01A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         CurrencyGranted;                                   // 0x01A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USnapserAsyncActionApplyConsumable*     ApplyConsumableAsyncAction;                        // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FMatchUserRecordBlob_MatchUserRecordExt CachedMatchDetails;                               // 0x01B8(0x0130)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSaluteMessage>                 UnprocessedSaluteNotifications;                    // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAsyncAction_ListenForGameplayMessage*  MatchHistoryUpdateListener;                        // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  SaluteReceivedListener;                            // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  GameModeChangedListener;                           // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         TargetUserIdsQueue;                                // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         MatchDetailsIdQueue;                               // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ApplyConsumable(const class FString& TargetUserId, const class FString& Matchdetailsid);
	void DidSaluteUser(const class FString& InUserId, const class FString& InMatchId, bool* bDidSalute);
	void ExecuteUbergraph_VM_SaluteConsumable(int32 EntryPoint);
	void HandleSaluteReceived(const struct FSaluteMessage& InPayload);
	void On_Inventory_Received_Message(const struct FTyrInventoryMessage& Payload);
	void OnDeinitialized();
	void OnFailure_9DB303884FC2891C9858BFA654E95A4F(const class FString& ConsumableId, const class FString& ErrorMessage);
	void OnFailure_F43EA52B40F0393118C5CF9AA483870B(const class FString& UserId, const class FString& ErrorMessage);
	void OnInitialized();
	void OnMessageReceived_54171A9D43411A2ABEBAFDA932348C83(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_5641D9D84650341965DF8AAD37D42DA8(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_6FD14F7C478A7D65264AD7B05021B23A(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnSuccess_9DB303884FC2891C9858BFA654E95A4F(const class FString& ConsumableId, const TArray<struct FInstancedStruct>& AdditionalConsumablesApplied, const struct FInstancedStruct& Response);
	void OnSuccess_F43EA52B40F0393118C5CF9AA483870B(const class FString& UserId);
	void SendNextQueuedRequest();
	void UpdateCachedMatchDetails(const class FString& InMatchId);

	void GetDescription(class FText* Description) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_SaluteConsumable_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_SaluteConsumable_C")
	}
	static class UVM_SaluteConsumable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_SaluteConsumable_C>();
	}
};
DUMPER7_ASSERTS_UVM_SaluteConsumable_C;

SDK_NAMESPACE_END
