#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Scoreboard

#include "Basic.hpp"

#include "DataRegistry_structs.hpp"
#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"
#include "TyrSharedTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_MatchEndCondition_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Scoreboard.VM_Scoreboard_C
// 0x0118 (0x0188 - 0x0070)
class UVM_Scoreboard_C final : public UTyrViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0070(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UVM_Scoreboard_Player_C*>        AllyTeam;                                          // 0x0078(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UVM_Scoreboard_Player_C*>        EnemyTeam;                                         // 0x0088(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   Matchdetailsid;                                    // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchDetails                          MatchDetails;                                      // 0x00A0(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   LocalPlayerId;                                     // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrQueryState                                QueryState;                                        // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCancellableAsyncAction*                FetchAsyncAction;                                  // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   MapName;                                           // 0x0128(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDateTime                              Date;                                              // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              MatchDuration;                                     // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EBattleResultState                            Result;                                            // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MatchEndCondition                           MatchEndReason;                                    // 0x0149(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WinningTeamId;                                     // 0x014C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AllyTeamId;                                        // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnemyTeamId;                                       // 0x0154(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AllyTeamKills;                                     // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnemyTeamKills;                                    // 0x015C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnScoresReady;                                     // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 LocalPlayerPartyId;                                // 0x0170(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bAreScoresReady;                                   // 0x0180(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCustomGame;                                      // 0x0181(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class FName ConvertToMatchDetails(const struct FBP_EndGameStats& InLastGameInfo, const class FString& InLocalPlayerName, struct FMatchDetails* OutMatchDetails);
	class UVM_Scoreboard_Player_C* CreateScorboardPlayer(const struct FMatchUserRecord& InMatchUserRecord, const class FString& InLocalPartyId);
	void ExecuteUbergraph_VM_Scoreboard(int32 EntryPoint);
	void FindLocalPlayerInfo(const struct FMatchDetails& InMatchDetails, class FName InLocalPlayerId, bool* FoundLocalPlayer, int32* TeamId, class FString* PartyId);
	bool FindScoreSortIndex(const class UTyrViewModel* InPlayer, int32 InScore);
	void GetMatchEndReason(const struct FMatchDetails& InMatchDetails, E_MatchEndCondition* EnumValue);
	void GetTeamScore(TArray<int32>& InScores, int32 InTeamId, int32* Score);
	void Initialize_by_Fetching_Match_Details(const class FString& Matchdetailsid_0, const class FText& MapName_0, EBattleResultState Result_0);
	void Initialize_from_Last_Game_Info(const struct FBP_EndGameStats& LastGameInfo, class APlayerState* LocalPlayerState);
	void InitializeFromMatchDetails(const struct FMatchDetails& MatchDetails_0);
	bool IsValidMatch(const struct FMatchDetails& InMatchDetails);
	void On_Scoreboard_Widget_Destruct();
	void OnFailure_511402C94A67C11BD751C98F767D1614(const class FString& ErrorMessage);
	void OnSuccess_511402C94A67C11BD751C98F767D1614(const struct FMatchDetailsBlob& Matches);
	void UpdateMatchFromDetails(const struct FMatchDetails& InMatchDetails);
	void UpdatePlayersFromUserRecords(TArray<struct FMatchUserRecord>& InUserRecords);

	void DidWinMatch(bool* InDidWin) const;
	class FText GetAllyTeamKillCountText() const;
	class FText GetEnemyTeamKillCountText() const;
	class FText GetMatchDurationText() const;
	void GetMatchEndReasonText(class FText* ReasonText) const;
	class FText GetResultText() const;
	void IsLocalPlayerNetId(const struct FUniqueNetIdRepl& InUniqueID, class UObject* InLocalPlayerState, bool* IsLocalPlayer) const;
	bool IsWaitingForQueryResponse() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Scoreboard_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Scoreboard_C")
	}
	static class UVM_Scoreboard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Scoreboard_C>();
	}
};
DUMPER7_ASSERTS_UVM_Scoreboard_C;

SDK_NAMESPACE_END
