#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Scoreboard_Player

#include "Basic.hpp"

#include "DataRegistry_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Scoreboard_Player.VM_Scoreboard_Player_C
// 0x0168 (0x01D8 - 0x0070)
class UVM_Scoreboard_Player_C final : public UTyrViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0070(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   PlayerId;                                          // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Matchdetailsid;                                    // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 LocalPartyId;                                      // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   VehicleId;                                         // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   PlayerName;                                        // 0x00A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   TankName;                                          // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UMaterialInterface>      PilotPortrait;                                     // 0x00C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   VehicleName;                                       // 0x00E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           VehicleClass;                                      // 0x00F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         DamageDone;                                        // 0x0100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DamageBlocked;                                     // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AssistDamage;                                      // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Kills;                                             // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAlive;                                           // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInParty;                                         // 0x0111(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLocalPlayer;                                     // 0x0112(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrPlayerTitleData                    TitleData;                                         // 0x0118(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HasTitle;                                          // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SalutedByLocalPlayer;                              // 0x0169(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SaluteRequestInflight;                             // 0x016A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16B[0x5];                                      // 0x016B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              KeystoneIcon;                                      // 0x0170(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          HasKeystone;                                       // 0x0198(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   KeystoneName;                                      // 0x01A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   KeystoneDesc;                                      // 0x01B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsCustomGame;                                      // 0x01C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSpectator;                                       // 0x01C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAsyncAction_ListenForGameplayMessage*> MessageListeners;                           // 0x01C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_VM_Scoreboard_Player(int32 EntryPoint);
	bool IsInLocalParty(const class FString& InPartyId);
	void OnDeinitialized();
	void OnInitialized();
	void OnMessageReceived_2030774F4A24168D376C149C680090BA(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_F0FDCF52467142560CED169E94183E31(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnReportPlayer();
	void ResolveKeystoneFromTag(const struct FGameplayTag& InKeystoneTag);
	void SetIsLocalPlayer(class FName InLocalPlayerId);
	void ShowContextActions(class UTyrContextMenuWidget* InContextMenu);
	void UpdateFromUserRecord(const struct FMatchUserRecord& InMatchUserRecord, class FName InMatchDetailsId, const class FString& InLocalPartyId);
	void UpdatePlayerTitle();
	void UpdateSalutedByLocalPlayer(const struct FBP_SaluteSuccessMessage& InSaluteMessage);

	bool CanSalute() const;
	void GetDisplayAsSaluted(bool* bDisplayAsSaluted) const;
	ESlateVisibility GetShouldHideSalute() const;
	void GetTankDesaturation(struct FTyrMaterialScalarParam* Return_Node) const;
	void GetTankMipLevel(struct FTyrMaterialScalarParam* Return_Node) const;
	bool HasAnyContextActions() const;
	void IsAliveLocalPlayerColor(struct FLinearColor* LinearColor) const;
	class FText SetAssistDamageText() const;
	class FText SetDamageBlockedText() const;
	class FText SetDamageDoneText() const;
	void SetIsLocalPlayerText_Name(struct FSlateFontInfo* SlateFontInfo) const;
	void SetIsLocalPlayerText_Numbers(struct FSlateFontInfo* SlateFontInfo) const;
	void SetIsLocalPlayerText_Vehicle(struct FSlateFontInfo* SlateFontInfo) const;
	class FText SetKillsText() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Scoreboard_Player_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Scoreboard_Player_C")
	}
	static class UVM_Scoreboard_Player_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Scoreboard_Player_C>();
	}
};
DUMPER7_ASSERTS_UVM_Scoreboard_Player_C;

SDK_NAMESPACE_END
