#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_TerritoryScans_Scan

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TyrSharedTypes_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function VM_TerritoryScans_Scan.VM_TerritoryScans_Scan_C.InitializeAsReadyToClaim
// 0x0004 (0x0004 - 0x0000)
struct VM_TerritoryScans_Scan_C_InitializeAsReadyToClaim final
{
public:
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_1; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_2; // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_3; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_TerritoryScans_Scan_C_InitializeAsReadyToClaim;

// Function VM_TerritoryScans_Scan.VM_TerritoryScans_Scan_C.UpdateStatusFromQuest
// 0x0012 (0x0012 - 0x0000)
struct VM_TerritoryScans_Scan_C_UpdateStatusFromQuest final
{
public:
	EQuestStatus                                  InQuestStatus;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_1; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_2; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_3; // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_4; // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_5; // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_6; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_7; // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_8; // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_9; // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_10; // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_11; // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_12; // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_13; // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_14; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_15; // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_TerritoryScans_Scan_C_UpdateStatusFromQuest;

// Function VM_TerritoryScans_Scan.VM_TerritoryScans_Scan_C.Get_BackingColor
// 0x0010 (0x0010 - 0x0000)
struct VM_TerritoryScans_Scan_C_Get_BackingColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_TerritoryScans_Scan_C_Get_BackingColor;

// Function VM_TerritoryScans_Scan.VM_TerritoryScans_Scan_C.Get_DivColor
// 0x0014 (0x0014 - 0x0000)
struct VM_TerritoryScans_Scan_C_Get_DivColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_TerritoryScans_Scan_C_Get_DivColor;

// Function VM_TerritoryScans_Scan.VM_TerritoryScans_Scan_C.Get_Dropshadow_Visibility
// 0x0002 (0x0002 - 0x0000)
struct VM_TerritoryScans_Scan_C_Get_Dropshadow_Visibility final
{
public:
	ESlateVisibility                              NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_TerritoryScans_Scan_C_Get_Dropshadow_Visibility;

// Function VM_TerritoryScans_Scan.VM_TerritoryScans_Scan_C.Get_GlowVisibility
// 0x0001 (0x0001 - 0x0000)
struct VM_TerritoryScans_Scan_C_Get_GlowVisibility final
{
public:
	ESlateVisibility                              NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_TerritoryScans_Scan_C_Get_GlowVisibility;

// Function VM_TerritoryScans_Scan.VM_TerritoryScans_Scan_C.Get_ScanTextColor
// 0x0040 (0x0040 - 0x0000)
struct VM_TerritoryScans_Scan_C_Get_ScanTextColor final
{
public:
	struct FSlateColor                            Color;                                             // 0x0000(0x0014)(Parm, OutParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0014(0x0014)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x002C(0x0014)()
};
DUMPER7_ASSERTS_VM_TerritoryScans_Scan_C_Get_ScanTextColor;

// Function VM_TerritoryScans_Scan.VM_TerritoryScans_Scan_C.Get_StatusColor
// 0x0010 (0x0010 - 0x0000)
struct VM_TerritoryScans_Scan_C_Get_StatusColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_TerritoryScans_Scan_C_Get_StatusColor;

// Function VM_TerritoryScans_Scan.VM_TerritoryScans_Scan_C.Get_StatusCoverColor
// 0x0010 (0x0010 - 0x0000)
struct VM_TerritoryScans_Scan_C_Get_StatusCoverColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_TerritoryScans_Scan_C_Get_StatusCoverColor;

// Function VM_TerritoryScans_Scan.VM_TerritoryScans_Scan_C.Get_StatusIconColor
// 0x0010 (0x0010 - 0x0000)
struct VM_TerritoryScans_Scan_C_Get_StatusIconColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_TerritoryScans_Scan_C_Get_StatusIconColor;

// Function VM_TerritoryScans_Scan.VM_TerritoryScans_Scan_C.Get_StatusTextColor
// 0x0050 (0x0050 - 0x0000)
struct VM_TerritoryScans_Scan_C_Get_StatusTextColor final
{
public:
	struct FSlateColor                            Color;                                             // 0x0000(0x0014)(Parm, OutParm)
	struct FLinearColor                           CallFunc_Get_StatusColor_Color;                    // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0028(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x003C(0x0014)()
};
DUMPER7_ASSERTS_VM_TerritoryScans_Scan_C_Get_StatusTextColor;

// Function VM_TerritoryScans_Scan.VM_TerritoryScans_Scan_C.Get_WinIcon_Scale
// 0x0010 (0x0010 - 0x0000)
struct VM_TerritoryScans_Scan_C_Get_WinIcon_Scale final
{
public:
	struct FVector2D                              Scale;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_TerritoryScans_Scan_C_Get_WinIcon_Scale;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
