#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_TerritoryScans_Scan

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "TyrSharedTypes_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_TerritoryScans_Scan.VM_TerritoryScans_Scan_C
// 0x0038 (0x00A8 - 0x0070)
class UVM_TerritoryScans_Scan_C final : public UTyrViewModel
{
public:
	struct FGameplayTag                           QuestTag;                                          // 0x0070(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x0078(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   StatusMessage;                                     // 0x0088(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bCanBeClaimed;                                     // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasBeenClaimed;                                   // 0x0099(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MapDesaturationAmount;                             // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void InitializeAsReadyToClaim();
	void UpdateStatusFromQuest(EQuestStatus InQuestStatus);

	void Get_BackingColor(struct FLinearColor* Color) const;
	void Get_DivColor(struct FLinearColor* Color) const;
	void Get_Dropshadow_Visibility(ESlateVisibility* NewParam) const;
	void Get_GlowVisibility(ESlateVisibility* NewParam) const;
	void Get_ScanTextColor(struct FSlateColor* Color) const;
	void Get_StatusColor(struct FLinearColor* Color) const;
	void Get_StatusCoverColor(struct FLinearColor* Color) const;
	void Get_StatusIconColor(struct FLinearColor* Color) const;
	void Get_StatusTextColor(struct FSlateColor* Color) const;
	void Get_WinIcon_Scale(struct FVector2D* Scale) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_TerritoryScans_Scan_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_TerritoryScans_Scan_C")
	}
	static class UVM_TerritoryScans_Scan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_TerritoryScans_Scan_C>();
	}
};
DUMPER7_ASSERTS_UVM_TerritoryScans_Scan_C;

SDK_NAMESPACE_END
