#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_TechTree

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_TechTree.VM_TechTree_C
// 0x0058 (0x00C8 - 0x0070)
class UVM_TechTree_C final : public UTyrViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0070(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UVM_TechTree_Tier_C*>            Tiers;                                             // 0x0078(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UVM_TechTree_Node_C*>            Nodes;                                             // 0x0088(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         PointsAvailable;                                   // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalPointsAllocated;                              // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PointsEarned;                                      // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValidTree;                                      // 0x00A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTyrTechNodeData>               NodeData;                                          // 0x00A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bPointsAvailable;                                  // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_TechTree_Node_C*                    ActiveKeystoneNode;                                // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VM_TechTree(int32 EntryPoint);
	void FindOrAddTierViewModel(int32 InTier, bool bInKeystoneTier, int32 InRequiredMinTierPoints, class UVM_TechTree_Tier_C** TierViewModel);
	void InitializeTalentNode(const struct FTyrTechNodeData& InNodeData, const struct FTyrTechTreeMetadata& InTreeMetadata, class UVM_TechTree_Node_C** TalentNode);
	void Internal_AddNodeViewModel(const class UVM_TechTree_Node_C*& InNodeViewModel);
	void Internal_AddPointToTalent(const struct FGameplayTag& InTalentTag);
	void Internal_RemovePointFromTalent(const struct FGameplayTag& InTalentTag);
	void On_Point_Allocations_Updated();
	void SetupTalentTree(TArray<struct FTyrTechNodeData>& InNodes, const struct FTyrTechTreeMetadata& InTreeMetadata);
	void TryAddPointToTalent(class UVM_TechTree_Node_C* InNodeViewModel, bool* DidAdd, class FText* Error);
	void TryRemovePointFromTalent(class UVM_TechTree_Node_C* InNodeViewModel, bool* DidRemove, class FText* Error);
	void UpdateTalentPointAllocations(TArray<struct FTechTreeAllocation>& InAllocations);
	void UpdateTalentPointsAvailable(int32 InPointsEarned, int32 InTotalPointsAllocated);
	void UpdateTalentPointsEarned(int32 InPointsEarned);

	bool AreAnyNodesActivated(TArray<class UVM_TechTree_Node_C*>& InNodes) const;
	bool CanActivateAnyKeystone() const;
	void CanRemovePointFromTalent(class UVM_TechTree_Node_C* InNode, bool* CanRemove, class FText* CannotReason) const;
	void CanRemovePointWithoutTierLockout(class UVM_TechTree_Node_C* InNodeViewModel, bool* CanRemove, class FText* CannotReason) const;
	class FText GetActiveKeystoneDescription() const;
	void GetActiveKeystoneIcon(TSoftObjectPtr<class UTexture2D>* Icon) const;
	class FText GetActiveKeystoneName() const;
	void GetActiveKeystoneNode(bool* bHasActiveKeystone, class UVM_TechTree_Node_C** KeystoneNode) const;
	void GetNextTier(class UVM_TechTree_Tier_C* InTier, class UVM_TechTree_Tier_C** Tier) const;
	void GetPreviousTier(class UVM_TechTree_Tier_C* InTier, class UVM_TechTree_Tier_C** Tier) const;
	void GetTalentNode(const struct FGameplayTag& InNodeTag, class UVM_TechTree_Node_C** NodeViewModel, int32* Array_Index) const;
	void GetTalentNodeTier(class UVM_TechTree_Node_C* InNodeViewModel, class UVM_TechTree_Tier_C** TierViewModel) const;
	bool HasActiveKeystone() const;
	void Internal_GetTotalPointsAllocated(TArray<struct FTechTreeAllocation>& InAllocations, int32* TotalPoints) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_TechTree_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_TechTree_C")
	}
	static class UVM_TechTree_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_TechTree_C>();
	}
};
DUMPER7_ASSERTS_UVM_TechTree_C;

SDK_NAMESPACE_END
