#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_TrackBoosterConsumable

#include "Basic.hpp"

#include "FieldNotification_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TyrSharedTypes_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function VM_TrackBoosterConsumable.VM_TrackBoosterConsumable_C.ExecuteUbergraph_VM_TrackBoosterConsumable
// 0x02C8 (0x02C8 - 0x0000)
struct VM_TrackBoosterConsumable_C_ExecuteUbergraph_VM_TrackBoosterConsumable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId;             // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	class UTyrOnlineSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RefreshProgressionForUser_ReturnValue;    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_TerritoryScan_RewardList_C*         CallFunc_SpawnObject_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_1;           // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array_1;                          // 0x0058(0x0010)(ReferenceParm)
	class UTyrOnlineSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USnapserInventorySubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UTyrOnlineUserInfo*               CallFunc_GetUserInfoForLocalPlayerIndex_ReturnValue; // 0x0078(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            K2Node_MakeMap_Map;                                // 0x0098(0x0050)()
	class USnapserAsyncActionApplyConsumable*     CallFunc_ApplyConsumable_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTyrInventoryMessage                   K2Node_Event_Payload;                              // 0x00F0(0x0010)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetItemInformationMetadataNumberField_ReturnValue; // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ConsumableId, const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue; // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInstancedStruct>               Temp_struct_Variable;                              // 0x0120(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStructUtilsResult                            CallFunc_GetInstancedStructValue_ExecResult;       // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FApplyDropTableResponseData            CallFunc_GetInstancedStructValue_Value;            // 0x0138(0x0068)(ConstParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           CallFunc_GetLocalPlayer_ReturnValue;               // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_EchoScans_Screen_C*                CallFunc_PushContentToLayerForPlayer_ReturnValue;  // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULocalPlayer*                           CallFunc_GetLocalPlayer_ReturnValue_1;             // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInstancedStruct                       Temp_struct_Variable_1;                            // 0x01C8(0x0010)()
	class UWBP_TerritoryScan_RewardScreen_C*      CallFunc_PushContentToLayerForPlayer_ReturnValue_1; // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EStructUtilsResult                            CallFunc_GetInstancedStructValue_ExecResult_1;     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FApplyTrackBoosterResponseData         CallFunc_GetInstancedStructValue_Value_1;          // 0x01E8(0x0030)(ConstParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrProgressionSubsystem*               CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrProgressionSubsystem*               CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1; // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ConsumableId;                   // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FInstancedStruct>               K2Node_CustomEvent_AdditionalConsumablesApplied;   // 0x0250(0x0010)(ConstParm, ReferenceParm)
	struct FInstancedStruct                       K2Node_CustomEvent_Response;                       // 0x0260(0x0010)(ConstParm)
	class FString                                 K2Node_CustomEvent_ConsumableId_1;                 // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ErrorMessage;                   // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ConsumableId, const TArray<struct FInstancedStruct>& AdditionalConsumablesApplied, const struct FInstancedStruct& Response)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0290(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate_3; // 0x02A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_CustomEvent_Field;                          // 0x02B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyOfConsumable_CanApply;              // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue_1; // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_TrackBoosterConsumable_C_ExecuteUbergraph_VM_TrackBoosterConsumable;

// Function VM_TrackBoosterConsumable.VM_TrackBoosterConsumable_C.On Inventory Received Message
// 0x0010 (0x0010 - 0x0000)
struct VM_TrackBoosterConsumable_C_On_Inventory_Received_Message final
{
public:
	struct FTyrInventoryMessage                   Payload;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_VM_TrackBoosterConsumable_C_On_Inventory_Received_Message;

// Function VM_TrackBoosterConsumable.VM_TrackBoosterConsumable_C.OnAmountChanged
// 0x0010 (0x0010 - 0x0000)
struct VM_TrackBoosterConsumable_C_OnAmountChanged final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   Field;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_TrackBoosterConsumable_C_OnAmountChanged;

// Function VM_TrackBoosterConsumable.VM_TrackBoosterConsumable_C.OnFailure_4A991B31461EE4DA700C909CEC0C0CE2
// 0x0020 (0x0020 - 0x0000)
struct VM_TrackBoosterConsumable_C_OnFailure_4A991B31461EE4DA700C909CEC0C0CE2 final
{
public:
	class FString                                 ConsumableId;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ErrorMessage;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_TrackBoosterConsumable_C_OnFailure_4A991B31461EE4DA700C909CEC0C0CE2;

// Function VM_TrackBoosterConsumable.VM_TrackBoosterConsumable_C.OnSuccess_4A991B31461EE4DA700C909CEC0C0CE2
// 0x0030 (0x0030 - 0x0000)
struct VM_TrackBoosterConsumable_C_OnSuccess_4A991B31461EE4DA700C909CEC0C0CE2 final
{
public:
	class FString                                 ConsumableId;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FInstancedStruct>               AdditionalConsumablesApplied;                      // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FInstancedStruct                       Response;                                          // 0x0020(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_VM_TrackBoosterConsumable_C_OnSuccess_4A991B31461EE4DA700C909CEC0C0CE2;

// Function VM_TrackBoosterConsumable.VM_TrackBoosterConsumable_C.SetIsWaitingForAnimation
// 0x0028 (0x0028 - 0x0000)
struct VM_TrackBoosterConsumable_C_SetIsWaitingForAnimation final
{
public:
	bool                                          bInWaiting;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId;             // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_TrackBoosterConsumable_C_SetIsWaitingForAnimation;

// Function VM_TrackBoosterConsumable.VM_TrackBoosterConsumable_C.CanApplyBooster
// 0x0003 (0x0003 - 0x0000)
struct VM_TrackBoosterConsumable_C_CanApplyBooster final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_TrackBoosterConsumable_C_CanApplyBooster;

// Function VM_TrackBoosterConsumable.VM_TrackBoosterConsumable_C.GetDescription
// 0x0098 (0x0098 - 0x0000)
struct VM_TrackBoosterConsumable_C_GetDescription final
{
public:
	class FText                                   Description;                                       // 0x0000(0x0010)(Parm, OutParm)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0010)()
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_TrackBoosterConsumable_C_GetDescription;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
