#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Vehicle_Unlock

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tyr_classes.hpp"
#include "DataRegistry_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Vehicle_Unlock.VM_Vehicle_Unlock_C
// 0x01D8 (0x0248 - 0x0070)
class UVM_Vehicle_Unlock_C final : public UTyrViewModel
{
public:
	struct FGameplayTag                           VehicleTag;                                        // 0x0070(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VehicleClass;                                      // 0x0078(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseFullUnlock;                                    // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PilotName;                                         // 0x0088(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   VehicleName;                                       // 0x0098(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UMaterialInstance>       CharUnlockOrthoSide;                               // 0x00A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       CharUnlockOrthoFront;                              // 0x00D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       CharUnlockOrthoBack;                               // 0x00F8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       CharUnlockOrthoTop;                                // 0x0120(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       CharUnlockOrthoTopColor;                           // 0x0148(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       CharUnlockOrthoQuarterFront;                       // 0x0170(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       CharUnlockOrthoQuarterBack;                        // 0x0198(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       CharUnlockPilotPortrait;                           // 0x01C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	struct FLinearColor                           CharUnlockPilotColor;                              // 0x01E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       CharUnlockTankPortrait;                            // 0x01F8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      SplashArt;                                         // 0x0220(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void InitializeFromVehicleViewModel(class UVM_Vehicle_C* InVehicleViewModel);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Vehicle_Unlock_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Vehicle_Unlock_C")
	}
	static class UVM_Vehicle_Unlock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Vehicle_Unlock_C>();
	}
};
DUMPER7_ASSERTS_UVM_Vehicle_Unlock_C;

SDK_NAMESPACE_END
