#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Vehicle_LoadoutSlots

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Vehicle_LoadoutSlots.VM_Vehicle_LoadoutSlots_C
// 0x0088 (0x00F8 - 0x0070)
class UVM_Vehicle_LoadoutSlots_C final : public UTyrViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0070(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           Pub_VehicleTag;                                    // 0x0078(0x0008)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class UVM_Vehicle_Loadout_C*>          Loadouts;                                          // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UVM_Vehicle_Loadout_C*                  ActiveLoadout;                                     // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ActiveLoadoutIndex;                                // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrQueryState                                LoadoutQuery;                                      // 0x009C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastConfirmedActiveLoadoutIndex;                   // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsConfirmingActiveIndex;                          // 0x00A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   PurchasesInFlight;                                 // 0x00A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAsyncAction_ListenForGameplayMessage*  PurchaseUpdateListener;                            // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  UnlockedShells;                                    // 0x00C0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FGameplayTag>                   RecommendedShells;                                 // 0x00E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsLoadoutImportEnabled;                           // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Confirm_New_Active_Index();
	void ConfirmAllLoadoutChanges();
	void Discard_New_Active_Index();
	void ExecuteUbergraph_VM_Vehicle_LoadoutSlots(int32 EntryPoint);
	void FindOrAddLoadoutSlot(int32 InSlotIndex, class UVM_Vehicle_Loadout_C** LoadoutViewModel);
	void GetLoadoutAtIndex(int32 InIndex, class UVM_Vehicle_Loadout_C** LoadoutViewModel);
	void GetLoadoutWithSlotName(const class FString& InSlotName, class UVM_Vehicle_Loadout_C** LoadoutViewModel);
	void OnCannotPurchase();
	void OnFailure_4E64320B40AA8A609792BEB0FF0C6544(const class FString& ErrorMessage);
	void OnFailure_75FAD9A54BD9D5EEDA5A6792889ACFF2(const class FString& AmmunitionId, const class FString& ErrorMessage);
	void OnFailure_D3C56A5B4C4D3D5E6B198AB87F3052E4(const class FString& ComponentId, const class FString& ErrorMessage);
	void OnInitialized();
	void OnInventoryReceived(const struct FTyrInventoryMessage& Payload);
	void OnLoadoutSlotUpdated(const struct FTyrLoadoutUpdatedMessage& Payload);
	void OnMessageReceived_56612BFF48C1915E1D847689FB332D8C(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_7AC0856D415BCF4371E3F6A2E3D16620(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_947C06AC4AD7B85CECE3AABE5D996D85(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_A3439CFE4CB3102F4214F39A1B1C9A87(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnPurchaseAmmunition(class UVM_Ammunition_Shell_C* AmmunitionShell);
	void OnPurchaseComponent(class UVM_Vehicle_Component_C* Component);
	void OnPurchasedItemReceived(const struct FTyrInventoryMessage& Payload);
	void OnRefreshForPurchasedItem();
	void OnResult_F2ADE9CA4C7B69B59B0F4B806B9923DB(ETyrMessagingResult Result);
	void OnSuccess_4E64320B40AA8A609792BEB0FF0C6544();
	void OnSuccess_75FAD9A54BD9D5EEDA5A6792889ACFF2(const class FString& AmmunitionId);
	void OnSuccess_D3C56A5B4C4D3D5E6B198AB87F3052E4(const class FString& ComponentId);
	void PurchaseAmmunition(class UVM_Ammunition_Shell_C* InShell);
	void PurchaseComponent(class UVM_Vehicle_Component_C* InComponent);
	void RefreshAmmunitionUnlocks();
	void Request_Loadouts();
	void ResolvePurchasesInFlight();
	void SetActiveIndex(int32 InLoadoutIndex);
	void SetAmmunitionPurchaseComplete(const struct FGameplayTag& InGameplayTag, bool bInDidSucceed);
	void SetComponentPurchaseComplete(const struct FGameplayTag& InGameplayTag, bool bInDidSucceed);
	void SetNumSlotsUnlocked(int32 InNumComponentSlotsUnlocked, int32 InNumAmmoSlotsUnlocked);
	void SetSlotUnlockLevels(TArray<int32>& InComponentSlotUnlockLevels, TArray<int32>& InAmmoSlotUnlockLevels);
	void UpdateFromSavedLoadoutData(const struct FCompleteVehicleLoadoutListBlob& InSavedLoadoutData);
	void UpdateTalentPointsEarned(int32 InPoints);

	bool HasActiveQuery() const;
	bool HasAnyIncompatibleLoadouts() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Vehicle_LoadoutSlots_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Vehicle_LoadoutSlots_C")
	}
	static class UVM_Vehicle_LoadoutSlots_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Vehicle_LoadoutSlots_C>();
	}
};
DUMPER7_ASSERTS_UVM_Vehicle_LoadoutSlots_C;

SDK_NAMESPACE_END
