#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Vehicle_Component

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"
#include "DataRegistry_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Vehicle_Component.VM_Vehicle_Component_C
// 0x0120 (0x0190 - 0x0070)
class UVM_Vehicle_Component_C final : public UTyrViewModel
{
public:
	struct FGameplayTag                           ComponentTag;                                      // 0x0070(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ItemTag;                                           // 0x0078(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VehicleTag;                                        // 0x0080(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0088(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Description;                                       // 0x0098(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SupplimentalDescription;                           // 0x00A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x00B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bIsNative;                                         // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEquippedElsewhere;                              // 0x00E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVehicleComponentAvailability                 Availability;                                      // 0x00E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x1];                                       // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PurchaseAmount;                                    // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, int32>              NativeVehicleLevels;                               // 0x00E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UMaterialInstance>> NativeVehiclePortraits;                          // 0x0138(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsUnlockedByNativeVehicle;                        // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NativeUnlockLevel;                                 // 0x014C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsWaitingForUnlockConfirmation;                   // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CategoryTags;                                      // 0x0158(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   CategoryName;                                      // 0x0178(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bImportFailed;                                     // 0x0188(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddNativeVehicle(const struct FGameplayTag& InVehicleTag, int32 InLevel);
	void SetAvailability(const struct FGameplayTagContainer& InEquippedComponents, const struct FGameplayTagContainer& InUnlockedComponents, const struct FGameplayTagContainer& InPurchasableComponents);
	void SetEquippedForSlot(const struct FGameplayTag& InEquippedInSlot);
	void SetImportFailed(bool bInImportFailed);
	void SetIsNativeForVehicle(const struct FGameplayTag& InVehicleTag);
	void SetUnlockConfirmed(bool bInUnlockConfirmed);
	void SetWaitingToUnlock();

	bool CanUnlockWithCurrency() const;
	void GetAvailabilityWidgetIndex(int32* WidgetSwitcherIndex) const;
	struct FItemBreadcrumb GetBreadcrumb() const;
	TSoftObjectPtr<class UTexture2D> GetCategoryIcon() const;
	struct FLinearColor GetCategoryIconColor() const;
	class FText GetCategoryText() const;
	class FText GetCurrencyUnlockHeaderText() const;
	class FText GetCurrencyUnlockText() const;
	struct FLinearColor GetDotGridColor() const;
	struct FLinearColor GetFillBackerColor() const;
	struct FSlateColor GetGreebleTextColor() const;
	struct FLinearColor GetIconColor() const;
	struct FSlateColor GetNameTextColor() const;
	struct FLinearColor GetNativeBackerColor() const;
	struct FSlateColor GetNativeTextColor() const;
	class FText GetNativeUnlockMessage() const;
	bool IsUnlocked() const;
	ESlateVisibility ShowEquippedBacker() const;
	ESlateVisibility ShowFillBacker() const;
	ESlateVisibility ShowNativeLabel() const;
	ESlateVisibility ShowUnselectableDimmer() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Vehicle_Component_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Vehicle_Component_C")
	}
	static class UVM_Vehicle_Component_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Vehicle_Component_C>();
	}
};
DUMPER7_ASSERTS_UVM_Vehicle_Component_C;

SDK_NAMESPACE_END
