#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Vehicle_Components

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Vehicle_Components.VM_Vehicle_Components_C
// 0x0050 (0x00C8 - 0x0078)
class UVM_Vehicle_Components_C final : public UTyrGlobalViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UVM_Vehicle_Component_C*>        Components;                                        // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         EquippedComponentIndex;                            // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Filter;                                            // 0x0094(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVM_Selector_Option_C*>          FilterCategories;                                  // 0x00A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UVM_Vehicle_Component_C*>        FilteredComponents;                                // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         FilteredEquippedComponentIndex;                    // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasAssignedNativeVehicles;                        // 0x00C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ClearBreadcrumbsFromFilteredComponents();
	void ExecuteUbergraph_VM_Vehicle_Components(int32 EntryPoint);
	void FilterComponents(const struct FGameplayTag& InFilter);
	void InitializeComponents();
	void IsComponentInFilterCategory(const class UObject* InComponent, bool* Result);
	struct FGameplayTag ItemTagFromComponentTag(const struct FGameplayTag& InComponentTag);
	void OnInitialized();
	void SortComponentsByNative(const class UObject* InA, const class UObject* InB, bool* Result);
	void UpdateForComponentSlot(const struct FGameplayTag& InEquippedComponent);
	void UpdateForVehicle(const struct FGameplayTag& InVehicleTag, const struct FGameplayTagContainer& InEquippedComponents, const struct FGameplayTagContainer& InUnlockedComponents, const struct FGameplayTagContainer& InPurchasableComponents);

	void GetComponent(const struct FGameplayTag& InComponentTag, class UVM_Vehicle_Component_C** ComponentViewModel) const;
	class UVM_Vehicle_Component_C* GetEquippedComponent() const;
	void GetFilterCategoryMatchingTag(const struct FGameplayTag& InCategoryTag, class UVM_Selector_Option_C** FilterOption) const;
	class UVM_Vehicle_Component_C* GetFilteredEquippedComponent() const;
	bool HasEquippedComponent() const;
	bool HasFilteredEquippedComponent() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Vehicle_Components_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Vehicle_Components_C")
	}
	static class UVM_Vehicle_Components_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Vehicle_Components_C>();
	}
};
DUMPER7_ASSERTS_UVM_Vehicle_Components_C;

SDK_NAMESPACE_END
