#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Vehicle_Cinematics

#include "Basic.hpp"

#include "FieldNotification_structs.hpp"
#include "DataRegistry_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function VM_Vehicle_Cinematics.VM_Vehicle_Cinematics_C.ExecuteUbergraph_VM_Vehicle_Cinematics
// 0x00F0 (0x00F0 - 0x0000)
struct VM_Vehicle_Cinematics_C_ExecuteUbergraph_VM_Vehicle_Cinematics final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId;             // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	struct FDataRegistryId                        K2Node_MakeStruct_DataRegistryId;                  // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Section;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDataRegistrySubsystemGetItemResult           CallFunc_FindCachedItemBP_OutResult;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrVehicleCinematicDataTableStruct    CallFunc_FindCachedItemBP_OutItem;                 // 0x0048(0x00A0)(ConstParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue; // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Cinematics_C_ExecuteUbergraph_VM_Vehicle_Cinematics;

// Function VM_Vehicle_Cinematics.VM_Vehicle_Cinematics_C.OnAbilityMontageStarted
// 0x0008 (0x0008 - 0x0000)
struct VM_Vehicle_Cinematics_C_OnAbilityMontageStarted final
{
public:
	class FName                                   Section;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Cinematics_C_OnAbilityMontageStarted;

// Function VM_Vehicle_Cinematics.VM_Vehicle_Cinematics_C.ResetAbilityVisuals
// 0x0020 (0x0020 - 0x0000)
struct VM_Vehicle_Cinematics_C_ResetAbilityVisuals final
{
public:
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId;             // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Cinematics_C_ResetAbilityVisuals;

// Function VM_Vehicle_Cinematics.VM_Vehicle_Cinematics_C.CanPlayAbilityAnimation
// 0x0002 (0x0002 - 0x0000)
struct VM_Vehicle_Cinematics_C_CanPlayAbilityAnimation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Cinematics_C_CanPlayAbilityAnimation;

// Function VM_Vehicle_Cinematics.VM_Vehicle_Cinematics_C.GetAbilitySectionToPlay
// 0x0008 (0x0008 - 0x0000)
struct VM_Vehicle_Cinematics_C_GetAbilitySectionToPlay final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Cinematics_C_GetAbilitySectionToPlay;

// Function VM_Vehicle_Cinematics.VM_Vehicle_Cinematics_C.GetAbilityToggleText
// 0x0010 (0x0010 - 0x0000)
struct VM_Vehicle_Cinematics_C_GetAbilityToggleText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_VM_Vehicle_Cinematics_C_GetAbilityToggleText;

// Function VM_Vehicle_Cinematics.VM_Vehicle_Cinematics_C.HasAbilityAnimation
// 0x0002 (0x0002 - 0x0000)
struct VM_Vehicle_Cinematics_C_HasAbilityAnimation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Cinematics_C_HasAbilityAnimation;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
