#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Vehicle_Purchase

#include "Basic.hpp"

#include "Tyr_structs.hpp"
#include "FieldNotification_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function VM_Vehicle_Purchase.VM_Vehicle_Purchase_C.OnVehiclePurchasedForDisplay
// 0x0001 (0x0001 - 0x0000)
struct VM_Vehicle_Purchase_C_OnVehiclePurchasedForDisplay final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Purchase_C_OnVehiclePurchasedForDisplay;

// Function VM_Vehicle_Purchase.VM_Vehicle_Purchase_C.OnResult_D983982641634101ED131E9C41974813
// 0x0001 (0x0001 - 0x0000)
struct VM_Vehicle_Purchase_C_OnResult_D983982641634101ED131E9C41974813 final
{
public:
	ETyrMessagingResult                           Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Purchase_C_OnResult_D983982641634101ED131E9C41974813;

// Function VM_Vehicle_Purchase.VM_Vehicle_Purchase_C.On Vehicle Purchased
// 0x0001 (0x0001 - 0x0000)
struct VM_Vehicle_Purchase_C_On_Vehicle_Purchased final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Purchase_C_On_Vehicle_Purchased;

// Function VM_Vehicle_Purchase.VM_Vehicle_Purchase_C.HandleVehicleAlreadyPurchased
// 0x0008 (0x0008 - 0x0000)
struct VM_Vehicle_Purchase_C_HandleVehicleAlreadyPurchased final
{
public:
	class UVM_Vehicle_C*                          InVehicle;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Purchase_C_HandleVehicleAlreadyPurchased;

// Function VM_Vehicle_Purchase.VM_Vehicle_Purchase_C.ExitedStage_AE0033D34EF5B21CD1420B984816E1C2
// 0x0008 (0x0008 - 0x0000)
struct VM_Vehicle_Purchase_C_ExitedStage_AE0033D34EF5B21CD1420B984816E1C2 final
{
public:
	class UCommonActivatableWidget*               Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Purchase_C_ExitedStage_AE0033D34EF5B21CD1420B984816E1C2;

// Function VM_Vehicle_Purchase.VM_Vehicle_Purchase_C.ExitedStage_5912C5E247D104C8D8163794E9AE38EA
// 0x0008 (0x0008 - 0x0000)
struct VM_Vehicle_Purchase_C_ExitedStage_5912C5E247D104C8D8163794E9AE38EA final
{
public:
	class UCommonActivatableWidget*               Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Purchase_C_ExitedStage_5912C5E247D104C8D8163794E9AE38EA;

// Function VM_Vehicle_Purchase.VM_Vehicle_Purchase_C.ExecuteUbergraph_VM_Vehicle_Purchase
// 0x02F8 (0x02F8 - 0x0000)
struct VM_Vehicle_Purchase_C_ExecuteUbergraph_VM_Vehicle_Purchase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonActivatableWidget* Widget)> K2Node_CreateDelegate_OutputDelegate;    // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_Widget_1;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_Widget;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* Widget)> K2Node_CreateDelegate_OutputDelegate_1;  // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ETyrMessagingResult Result)>   K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Vehicle_Unlocked_Fallback_C*       K2Node_DynamicCast_AsWBP_Vehicle_Unlocked_Fallback; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrMessagingResult                           K2Node_CustomEvent_Result;                         // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrMessagingResult                           Temp_byte_Variable;                                // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_3; // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_3;                   // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_2;                   // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               Temp_object_Variable_1;                            // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Unlock_C*                   CallFunc_SpawnObject_ReturnValue;                  // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Vehicle_Unlocked_C*                K2Node_DynamicCast_AsWBP_Vehicle_Unlocked;         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_1;                   // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_5; // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget;                     // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_6; // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               Temp_object_Variable_2;                            // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_Widget_7;                       // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Vehicle_Unlocked_Fallback_C*       K2Node_DynamicCast_AsWBP_Vehicle_Unlocked_Fallback_1; // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_Widget_2;                       // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* Widget)> K2Node_CreateDelegate_OutputDelegate_7;  // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerControllerFromID_ReturnValue;    // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* Widget)> K2Node_CreateDelegate_OutputDelegate_8;  // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrAsyncActionPushStagedContentToLayerForPlayer* CallFunc_PushStagedContentToLayerForPlayer_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerControllerFromID_ReturnValue_1;  // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrAsyncActionPushStagedContentToLayerForPlayer* CallFunc_PushStagedContentToLayerForPlayer_ReturnValue_1; // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Garage_C*                           CallFunc_GetGarageViewModel_ReturnValue;           // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Garage_C*                           CallFunc_GetGarageViewModel_ReturnValue_1;         // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Garage_C*                           CallFunc_GetGarageViewModel_ReturnValue_2;         // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_Widget_3;                       // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSuccess)>                K2Node_CreateDelegate_OutputDelegate_9;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* Widget)> K2Node_CreateDelegate_OutputDelegate_10; // 0x0188(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess_1;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x019C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Garage_C*                           CallFunc_GetGarageViewModel_ReturnValue_3;         // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVehicleSpawned_ReturnValue;             // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGarageActive_ReturnValue;               // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA[0x2];                                      // 0x01BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x01BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               Temp_object_Variable_3;                            // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVM_Garage_C*                           CallFunc_GetGarageViewModel_ReturnValue_4;         // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Vehicle_Unlocked_C*                K2Node_DynamicCast_AsWBP_Vehicle_Unlocked_1;       // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Vehicle_C*                          K2Node_CustomEvent_InVehicle_1;                    // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_Widget_4;                       // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* Widget)> K2Node_CreateDelegate_OutputDelegate_13; // 0x0200(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrGameDialogDescriptor*               CallFunc_CreatePurchaseDialogDescriptor_Descriptor; // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Unlock_C*                   CallFunc_SpawnObject_ReturnValue_1;                // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrAsyncActionShowConfirmation*        CallFunc_ShowConfirmationCustom_ReturnValue;       // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrFeatureFlagSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerControllerFromID_ReturnValue_2;  // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFeatureEnabled_ReturnValue;             // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrAsyncActionPushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue; // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerControllerFromID_ReturnValue_3;  // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrAsyncActionPushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue_1; // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_Widget_5;                       // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSuccess)>                K2Node_CreateDelegate_OutputDelegate_14;           // 0x0280(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* Widget)> K2Node_CreateDelegate_OutputDelegate_15; // 0x0290(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Vehicle_C*                          K2Node_CustomEvent_InVehicle;                      // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrFeatureFlagSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFeatureEnabled_ReturnValue_1;           // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Garage_C*                           CallFunc_GetGarageViewModel_ReturnValue_5;         // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_16;           // 0x02C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGarageActive_ReturnValue_1;             // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVehicleSpawned_ReturnValue_1;           // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DB[0x5];                                      // 0x02DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_Widget_6;                       // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* Widget)> K2Node_CreateDelegate_OutputDelegate_17; // 0x02E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Purchase_C_ExecuteUbergraph_VM_Vehicle_Purchase;

// Function VM_Vehicle_Purchase.VM_Vehicle_Purchase_C.EnteredStage_AE0033D34EF5B21CD1420B984816E1C2
// 0x0008 (0x0008 - 0x0000)
struct VM_Vehicle_Purchase_C_EnteredStage_AE0033D34EF5B21CD1420B984816E1C2 final
{
public:
	class UCommonActivatableWidget*               Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Purchase_C_EnteredStage_AE0033D34EF5B21CD1420B984816E1C2;

// Function VM_Vehicle_Purchase.VM_Vehicle_Purchase_C.EnteredStage_5912C5E247D104C8D8163794E9AE38EA
// 0x0008 (0x0008 - 0x0000)
struct VM_Vehicle_Purchase_C_EnteredStage_5912C5E247D104C8D8163794E9AE38EA final
{
public:
	class UCommonActivatableWidget*               Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Purchase_C_EnteredStage_5912C5E247D104C8D8163794E9AE38EA;

// Function VM_Vehicle_Purchase.VM_Vehicle_Purchase_C.CreatePurchaseViewModel
// 0x0078 (0x0078 - 0x0000)
struct VM_Vehicle_Purchase_C_CreatePurchaseViewModel final
{
public:
	class UVM_Vehicle_C*                          InVehicleVM;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Currency_Purchase_C*                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UVM_Currency_Purchase_C*                Loc_PurchaseViewModel;                             // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId;             // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_1;           // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	class UVM_Currency_Purchase_C*                CallFunc_SpawnObject_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Currency_C*                         CallFunc_GetCurrencyViewModel_ViewModel;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_2;           // 0x004C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_3;           // 0x0054(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array_1;                          // 0x0060(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue_1; // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Purchase_C_CreatePurchaseViewModel;

// Function VM_Vehicle_Purchase.VM_Vehicle_Purchase_C.CreatePurchaseDialogDescriptor
// 0x0070 (0x0070 - 0x0000)
struct VM_Vehicle_Purchase_C_CreatePurchaseDialogDescriptor final
{
public:
	class UVM_Vehicle_C*                          InVehicleVM;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrGameDialogDescriptor*               Descriptor;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUnlockConfirmationMessage_ReturnValue; // 0x0010(0x0010)()
	class UVM_Currency_Purchase_C*                CallFunc_CreatePurchaseViewModel_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FConfirmationDialogAction              K2Node_MakeStruct_ConfirmationDialogAction;        // 0x0028(0x0018)()
	struct FConfirmationDialogAction              K2Node_MakeStruct_ConfirmationDialogAction_1;      // 0x0040(0x0018)()
	TArray<struct FConfirmationDialogAction>      K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	class UTyrGameDialogDescriptor*               CallFunc_SpawnObject_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Purchase_C_CreatePurchaseDialogDescriptor;

// Function VM_Vehicle_Purchase.VM_Vehicle_Purchase_C.ConfirmVehiclePurchase
// 0x0008 (0x0008 - 0x0000)
struct VM_Vehicle_Purchase_C_ConfirmVehiclePurchase final
{
public:
	class UVM_Vehicle_C*                          InVehicle;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Purchase_C_ConfirmVehiclePurchase;

// Function VM_Vehicle_Purchase.VM_Vehicle_Purchase_C.BeforePush_AE0033D34EF5B21CD1420B984816E1C2
// 0x0008 (0x0008 - 0x0000)
struct VM_Vehicle_Purchase_C_BeforePush_AE0033D34EF5B21CD1420B984816E1C2 final
{
public:
	class UCommonActivatableWidget*               Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Purchase_C_BeforePush_AE0033D34EF5B21CD1420B984816E1C2;

// Function VM_Vehicle_Purchase.VM_Vehicle_Purchase_C.BeforePush_5912C5E247D104C8D8163794E9AE38EA
// 0x0008 (0x0008 - 0x0000)
struct VM_Vehicle_Purchase_C_BeforePush_5912C5E247D104C8D8163794E9AE38EA final
{
public:
	class UCommonActivatableWidget*               Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Purchase_C_BeforePush_5912C5E247D104C8D8163794E9AE38EA;

// Function VM_Vehicle_Purchase.VM_Vehicle_Purchase_C.BeforePush_4E9893D94119AB05BF704093B7D4CBA3
// 0x0008 (0x0008 - 0x0000)
struct VM_Vehicle_Purchase_C_BeforePush_4E9893D94119AB05BF704093B7D4CBA3 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Purchase_C_BeforePush_4E9893D94119AB05BF704093B7D4CBA3;

// Function VM_Vehicle_Purchase.VM_Vehicle_Purchase_C.BeforePush_3CC741F74A8B03BFC3005681FA35643D
// 0x0008 (0x0008 - 0x0000)
struct VM_Vehicle_Purchase_C_BeforePush_3CC741F74A8B03BFC3005681FA35643D final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Purchase_C_BeforePush_3CC741F74A8B03BFC3005681FA35643D;

// Function VM_Vehicle_Purchase.VM_Vehicle_Purchase_C.AfterPush_AE0033D34EF5B21CD1420B984816E1C2
// 0x0008 (0x0008 - 0x0000)
struct VM_Vehicle_Purchase_C_AfterPush_AE0033D34EF5B21CD1420B984816E1C2 final
{
public:
	class UCommonActivatableWidget*               Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Purchase_C_AfterPush_AE0033D34EF5B21CD1420B984816E1C2;

// Function VM_Vehicle_Purchase.VM_Vehicle_Purchase_C.AfterPush_5912C5E247D104C8D8163794E9AE38EA
// 0x0008 (0x0008 - 0x0000)
struct VM_Vehicle_Purchase_C_AfterPush_5912C5E247D104C8D8163794E9AE38EA final
{
public:
	class UCommonActivatableWidget*               Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Purchase_C_AfterPush_5912C5E247D104C8D8163794E9AE38EA;

// Function VM_Vehicle_Purchase.VM_Vehicle_Purchase_C.AfterPush_4E9893D94119AB05BF704093B7D4CBA3
// 0x0008 (0x0008 - 0x0000)
struct VM_Vehicle_Purchase_C_AfterPush_4E9893D94119AB05BF704093B7D4CBA3 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Purchase_C_AfterPush_4E9893D94119AB05BF704093B7D4CBA3;

// Function VM_Vehicle_Purchase.VM_Vehicle_Purchase_C.AfterPush_3CC741F74A8B03BFC3005681FA35643D
// 0x0008 (0x0008 - 0x0000)
struct VM_Vehicle_Purchase_C_AfterPush_3CC741F74A8B03BFC3005681FA35643D final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Purchase_C_AfterPush_3CC741F74A8B03BFC3005681FA35643D;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
