#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Vehicle_Loadout

#include "Basic.hpp"

#include "DataRegistry_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "TyrSharedTypes_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Vehicle_Loadout.VM_Vehicle_Loadout_C
// 0x0150 (0x01C0 - 0x0070)
class UVM_Vehicle_Loadout_C final : public UTyrViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0070(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           Pub_VehicleTag;                                    // 0x0078(0x0008)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Pub_SlotIndex;                                     // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SlotName;                                          // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0098(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsSlotUnlocked;                                   // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsIncompatible;                                   // 0x00A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasPendingAllocation;                             // 0x00AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_TechTree_C*                         Techtree;                                          // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UVM_Vehicle_Loadout_LockableSlot_C*> ComponentSlots;                                // 0x00B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UVM_Vehicle_Loadout_LockableSlot_C*> Ammoslots;                                     // 0x00C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	ETyrQueryState                                LoadoutQuery;                                      // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCompleteVehicleLoadout                CurrentLoadoutData;                                // 0x00E0(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCompleteVehicleLoadout                LastConfirmedLoadoutData;                          // 0x0150(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddPointAllocation(const struct FGameplayTag& InTalentTag);
	void ApplyImportedLoadout();
	void ClearLoadout();
	void Confirm_Loadout_Changes();
	void CREATEDELEGATE_PROXYFUNCTION_0(bool bSuccess, const struct FTyrOnlineErrorWrapper& ErrorMessage);
	void DebugCountPointAllocations(TArray<struct FTechTreeAllocation>& InAllocations, int32* TotalPointsAllocated);
	void Discard_Loadout_Changes();
	void EquipComponent(const struct FGameplayTag& InComponentTag, int32 InSlotIndex);
	void EquipShellInSlot(const struct FGameplayTag& InShellTag, int32 InSlotIndex);
	void ExecuteUbergraph_VM_Vehicle_Loadout(int32 EntryPoint);
	class FString GetDefaultSlotName();
	void InitializeAmmoSlots();
	void InitializeComponentSlots();
	void InitializeEmptyTechTree();
	void InitializeTechTree(TArray<struct FTyrTechNodeData>& InNodes, const struct FTyrTechTreeMetadata& InMetaData);
	void On_Loadout_Changes_Discarded();
	void On_Loadout_Confirmed(const struct FCompleteVehicleLoadout& ConfirmedLoadoutData);
	void OnInitialized();
	void OnResult_94D5D0A54E6A0B3D00F985B5E8885399(ETyrMessagingResult Result);
	void OnUpdateLoadoutComplete(bool bSuccess, const struct FTyrOnlineErrorWrapper& Error);
	void RemoveAllPointAllocations();
	void RemovePointAllocation(const struct FGameplayTag& InTalentTag);
	void SetNumSlotsUnlocked(int32 InNumComponentSlotsUnlocked, int32 InNumAmmoSlotsUnlocked);
	void SetSlotName(const class FString& InSlotName);
	void SetSlotUnlockLevels(TArray<int32>& InComponentSlotUnlockLevels, TArray<int32>& InAmmoSlotUnlockLevels);
	void TryEquipComponent(class UVM_Vehicle_Component_C* InComponent, int32 InSlotIndex, bool* bDidEquip, class FText* ErrorMessage);
	void TryEquipShell(class UVM_Ammunition_Shell_C* InShell, int32 InSlotIndex, bool* bDidEquip, class FText* ErrorMessage);
	void UpdateAmmoSlots(TArray<struct FGameplayTag>& InAmmoEquipped);
	void UpdateComponentSlots(TArray<struct FGameplayTag>& InComponentsEquipped);
	void UpdateLoadout(const struct FCompleteVehicleLoadout& InLoadoutData);
	void UpdateTalentPointAllocation(const struct FTechTreeAllocationBlob& InAllocation);
	void UpdateTalentPointsEarned(int32 InPoints);

	void AreAmmoSlotsUnlocked(bool* bIsSecondaryUnlocked, bool* bIsTertiaryUnlocked) const;
	class FText GetComponentSlotName(int32 InSlotIndex) const;
	void GetEquippedAmmo(struct FGameplayTag* SecondaryShell, struct FGameplayTag* TertiaryShell) const;
	void GetEquippedAmmoInSlot(int32 InSlotIndex, struct FGameplayTag* ShellTag) const;
	struct FGameplayTag GetEquippedComponent(int32 InSlot) const;
	struct FGameplayTagContainer GetEquippedComponents() const;
	void HasComponentEquipped(const struct FGameplayTag& InComponentTag, bool* bIsNotEquipped, int32* EquippedSlot) const;
	bool HasEmptySlots() const;
	bool HasUnlockedAllNativeComponents() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Vehicle_Loadout_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Vehicle_Loadout_C")
	}
	static class UVM_Vehicle_Loadout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Vehicle_Loadout_C>();
	}
};
DUMPER7_ASSERTS_UVM_Vehicle_Loadout_C;

SDK_NAMESPACE_END
