#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Vehicle_Loadout_LockableSlot

#include "Basic.hpp"

#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Vehicle_Loadout_LockableSlot.VM_Vehicle_Loadout_LockableSlot_C
// 0x0058 (0x00C8 - 0x0070)
class UVM_Vehicle_Loadout_LockableSlot_C final : public UTyrViewModel
{
public:
	ELoadoutItemSlotState                         SlotState;                                         // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0078(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         UnlockLevel;                                       // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotIndex;                                         // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x00A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Description;                                       // 0x00B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetIsLocked(bool bInIsLocked);
	void SetUnlockLevel(int32 InUnlockLevel);
	void UpdateSlot(ELoadoutItemSlotState InSlotState, const class FText& InName, const class FText& InDescription, TSoftObjectPtr<class UTexture2D> InSlotIcon);

	void GetSlotStateSwitcherIndex(int32* WidgetSwitcherIndex) const;
	class FText GetUnlockLevelText() const;
	bool IsUnlocked() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Vehicle_Loadout_LockableSlot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Vehicle_Loadout_LockableSlot_C")
	}
	static class UVM_Vehicle_Loadout_LockableSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Vehicle_Loadout_LockableSlot_C>();
	}
};
DUMPER7_ASSERTS_UVM_Vehicle_Loadout_LockableSlot_C;

SDK_NAMESPACE_END
