#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Vehicle_Level

#include "Basic.hpp"

#include "Tyr_classes.hpp"
#include "DataRegistry_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Vehicle_Level.VM_Vehicle_Level_C
// 0x0090 (0x0100 - 0x0070)
class UVM_Vehicle_Level_C final : public UTyrViewModel
{
public:
	int32                                         LevelIndex;                                        // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TargetLevel;                                       // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsCurrentLevel;                                   // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsComplete;                                       // 0x0079(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Currentxp;                                         // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Requiredxp;                                        // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GainedXP;                                          // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   RewardTitle;                                       // 0x0088(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UTexture2D>              RewardIcon;                                        // 0x0098(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bHasComponentSlotReward;                           // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasAmmoSlotReward;                                // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVM_Vehicle_Level_Reward_C*>     Rewards;                                           // 0x00C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   RewardDescription;                                 // 0x00D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsRepeatable;                                     // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AppliedGainedXP;                                   // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AppliedGainAnimationProgress;                      // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PendingCurrentXP;                                  // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasPendingCurrentXP;                              // 0x00FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyGainedProgress(int32 InGainedXP);
	void GainedProgressApplied();
	void GetOrCreateItemReward(const struct FGameplayTag& InItemTag, class UVM_Vehicle_Level_Reward_C** RewardViewModel);
	void SetLevel(int32 InLevelIndex);
	void UpdateFromProgressionData(bool bInIsCurrentLevel, bool bInIsComplete, int32 InCurrentXP, int32 InRequiredXP);
	void UpdateHeadlineReward();
	void UpdateRepeatableReward(TSoftObjectPtr<class UTexture2D> InIcon, const class FText& InTitle, const class FText& InDescription);
	void UpdateRequiredXP(int32 InRequiredXP);
	void UpdateRewardItem(const struct FTrackableRewardBlob& InRewardBlob, const struct FGameplayTag& InVehicleTag);

	int32 GetCurrentXP() const;
	double GetGainedLevelProgress() const;
	struct FSlateColor GetLevelColor() const;
	double GetLevelProgress() const;
	void GetLevelProgressBar(int32* NewParam) const;
	class FText GetLevelProgressText() const;
	class FText GetLevelText() const;
	class FText GetTargetLevelText() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Vehicle_Level_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Vehicle_Level_C")
	}
	static class UVM_Vehicle_Level_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Vehicle_Level_C>();
	}
};
DUMPER7_ASSERTS_UVM_Vehicle_Level_C;

SDK_NAMESPACE_END
