#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Vehicle_Details

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function VM_Vehicle_Details.VM_Vehicle_Details_C.FormatFloat
// 0x0028 (0x0028 - 0x0000)
struct VM_Vehicle_Details_C_FormatFloat final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0018(0x0010)()
};
DUMPER7_ASSERTS_VM_Vehicle_Details_C_FormatFloat;

// Function VM_Vehicle_Details.VM_Vehicle_Details_C.FormatFloatDuration
// 0x0098 (0x0098 - 0x0000)
struct VM_Vehicle_Details_C_FormatFloatDuration final
{
public:
	double                                        InFloat;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatFloat_ReturnValue;                  // 0x0020(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0010)()
};
DUMPER7_ASSERTS_VM_Vehicle_Details_C_FormatFloatDuration;

// Function VM_Vehicle_Details.VM_Vehicle_Details_C.InitializeFromData
// 0x10A8 (0x10A8 - 0x0000)
struct VM_Vehicle_Details_C_InitializeFromData final
{
public:
	struct FTankDataTableStruct                   InTankData;                                        // 0x0000(0x0270)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FTyrVehicleUIDataTableStruct           InVehicleUIData;                                   // 0x0270(0x0238)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_1; // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_2; // 0x04AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AB[0x5];                                      // 0x04AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x04B0(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x04C8(0x0010)()
	bool                                          Temp_bool_Variable_1;                              // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatFloat_ReturnValue;                  // 0x04E0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x04F0(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_FormatFloat_ReturnValue_1;                // 0x0538(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0548(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0558(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x05A0(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x05B0(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_3; // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C1[0x7];                                      // 0x05C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x05C8(0x0010)()
	class FText                                   CallFunc_FormatFloat_ReturnValue_2;                // 0x05D8(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_4; // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E9[0x7];                                      // 0x05E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x05F0(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_FormatFloat_ReturnValue_3;                // 0x0638(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0648(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0658(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x06A0(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x06B0(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_5; // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C1[0x7];                                      // 0x06C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x06C8(0x0010)()
	class FText                                   CallFunc_FormatFloat_ReturnValue_4;                // 0x06D8(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_6; // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E9[0x7];                                      // 0x06E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x06F0(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_739[0x7];                                      // 0x0739(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0740(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x0750(0x0010)()
	class FText                                   CallFunc_FormatFloat_ReturnValue_5;                // 0x0760(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_7; // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_771[0x7];                                      // 0x0771(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0778(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_FormatFloat_ReturnValue_6;                // 0x07C0(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x07D0(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x07E0(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x0828(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_6;                          // 0x0838(0x0010)(ReferenceParm)
	class FText                                   K2Node_Select_Default;                             // 0x0848(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_6;                     // 0x0858(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_8; // 0x0868(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_9; // 0x0869(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86A[0x6];                                      // 0x086A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatFloat_ReturnValue_7;                // 0x0870(0x0010)()
	class FText                                   CallFunc_FormatFloat_ReturnValue_8;                // 0x0880(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0890(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x08D8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_7;                          // 0x0920(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_8;                          // 0x0930(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_7;                     // 0x0940(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_8;                     // 0x0950(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_10; // 0x0960(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_11; // 0x0961(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_962[0x6];                                      // 0x0962(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatFloat_ReturnValue_9;                // 0x0968(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_9;            // 0x0978(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_9;                          // 0x09C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_FormatFloat_ReturnValue_10;               // 0x09D0(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_9;                     // 0x09E0(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_12; // 0x09F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_13; // 0x09F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F2[0x6];                                      // 0x09F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatFloat_ReturnValue_11;               // 0x09F8(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_14; // 0x0A08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A09[0x7];                                      // 0x0A09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_10;           // 0x0A10(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_15; // 0x0A58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A59[0x7];                                      // 0x0A59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_10;                         // 0x0A60(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_16; // 0x0A70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A71[0x7];                                      // 0x0A71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_10;                    // 0x0A78(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_17; // 0x0A88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_18; // 0x0A89(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A8A[0x6];                                      // 0x0A8A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatFloat_ReturnValue_12;               // 0x0A90(0x0010)()
	class FText                                   CallFunc_FormatFloat_ReturnValue_13;               // 0x0AA0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_11;           // 0x0AB0(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_12;           // 0x0AF8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_11;                         // 0x0B40(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_12;                         // 0x0B50(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_11;                    // 0x0B60(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_12;                    // 0x0B70(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_19; // 0x0B80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_20; // 0x0B81(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B82[0x6];                                      // 0x0B82(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatFloat_ReturnValue_14;               // 0x0B88(0x0010)()
	class FText                                   CallFunc_FormatFloat_ReturnValue_15;               // 0x0B98(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_13;           // 0x0BA8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_14;           // 0x0BF0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_13;                         // 0x0C38(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_14;                         // 0x0C48(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_13;                    // 0x0C58(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_14;                    // 0x0C68(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_21; // 0x0C78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_22; // 0x0C79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C7A[0x6];                                      // 0x0C7A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatFloat_ReturnValue_16;               // 0x0C80(0x0010)()
	class FText                                   CallFunc_FormatFloat_ReturnValue_17;               // 0x0C90(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_15;           // 0x0CA0(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_16;           // 0x0CE8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_15;                         // 0x0D30(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_16;                         // 0x0D40(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_15;                    // 0x0D50(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_16;                    // 0x0D60(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_23; // 0x0D70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_24; // 0x0D71(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D72[0x6];                                      // 0x0D72(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatFloat_ReturnValue_18;               // 0x0D78(0x0010)()
	class FText                                   CallFunc_FormatFloat_ReturnValue_19;               // 0x0D88(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_17;           // 0x0D98(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_18;           // 0x0DE0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_17;                         // 0x0E28(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_18;                         // 0x0E38(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_17;                    // 0x0E48(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_18;                    // 0x0E58(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_25; // 0x0E68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_26; // 0x0E69(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E6A[0x6];                                      // 0x0E6A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatFloat_ReturnValue_20;               // 0x0E70(0x0010)()
	class FText                                   CallFunc_FormatFloat_ReturnValue_21;               // 0x0E80(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_19;           // 0x0E90(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_27; // 0x0ED8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED9[0x7];                                      // 0x0ED9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_19;                         // 0x0EE0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_FormatFloatDuration_ReturnValue;          // 0x0EF0(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_19;                    // 0x0F00(0x0010)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0F10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_28; // 0x0F11(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F12[0x6];                                      // 0x0F12(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0F18(0x0010)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0F28(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_29; // 0x0F38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_30; // 0x0F39(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F3A[0x6];                                      // 0x0F3A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatFloatDuration_ReturnValue_1;        // 0x0F40(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_31; // 0x0F50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_32; // 0x0F51(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F52[0x6];                                      // 0x0F52(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatFloatDuration_ReturnValue_2;        // 0x0F58(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_33; // 0x0F68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_34; // 0x0F69(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_35; // 0x0F6A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F6B[0x5];                                      // 0x0F6B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatFloatDuration_ReturnValue_3;        // 0x0F70(0x0010)()
	class FText                                   CallFunc_FormatFloat_ReturnValue_22;               // 0x0F80(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_36; // 0x0F90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_37; // 0x0F91(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F92[0x6];                                      // 0x0F92(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatFloat_ReturnValue_23;               // 0x0F98(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_38; // 0x0FA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_39; // 0x0FA9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_40; // 0x0FAA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_41; // 0x0FAB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FAC[0x4];                                      // 0x0FAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_MaxGunDepression_ImplicitCast;  // 0x0FB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_MaxGunElevation_ImplicitCast;   // 0x0FB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast;         // 0x0FC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_1;       // 0x0FC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_2;       // 0x0FD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_3;       // 0x0FD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_4;       // 0x0FE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_5;       // 0x0FE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0FF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_6;       // 0x0FF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_7;       // 0x1000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_8;       // 0x1008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_9;       // 0x1010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_10;      // 0x1018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloatDuration_InFloat_ImplicitCast; // 0x1020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloatDuration_InFloat_ImplicitCast_1; // 0x1028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_11;      // 0x1030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_12;      // 0x1038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_13;      // 0x1040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_14;      // 0x1048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_15;      // 0x1050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_16;      // 0x1058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_17;      // 0x1060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_18;      // 0x1068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_19;      // 0x1070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_20;      // 0x1078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_21;      // 0x1080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_22;      // 0x1088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloat_InValue_ImplicitCast_23;      // 0x1090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloatDuration_InFloat_ImplicitCast_2; // 0x1098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatFloatDuration_InFloat_ImplicitCast_3; // 0x10A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VM_Vehicle_Details_C_InitializeFromData;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
