#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VM_Vehicle_Cinematics

#include "Basic.hpp"

#include "DataRegistry_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass VM_Vehicle_Cinematics.VM_Vehicle_Cinematics_C
// 0x0060 (0x00D0 - 0x0070)
class UVM_Vehicle_Cinematics_C final : public UTyrViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0070(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           VehicleTag;                                        // 0x0078(0x0008)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            AbilityMontage;                                    // 0x0080(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   EnterAbilitySection;                               // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ExitAbilitySection;                                // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   AbilityLabel;                                      // 0x00B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsPlayingAbilityMontage;                          // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDisplayingAbilityVisuals;                       // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VM_Vehicle_Cinematics(int32 EntryPoint);
	void OnAbilityMontageFinished();
	void OnAbilityMontageStarted(class FName Section);
	void OnInitialized();
	void ResetAbilityVisuals();

	bool CanPlayAbilityAnimation() const;
	class FName GetAbilitySectionToPlay() const;
	class FText GetAbilityToggleText() const;
	bool HasAbilityAnimation() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VM_Vehicle_Cinematics_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VM_Vehicle_Cinematics_C")
	}
	static class UVM_Vehicle_Cinematics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVM_Vehicle_Cinematics_C>();
	}
};
DUMPER7_ASSERTS_UVM_Vehicle_Cinematics_C;

SDK_NAMESPACE_END
