#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"
#include "ModelViewViewModel_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_MainMenu.WBP_MainMenu_C
// 0x00B8 (0x05E0 - 0x0528)
class UWBP_MainMenu_C final : public UTyrActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_3Slice_DivLine_C*                  WBP_3Slice_DivLine;                                // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0538(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Spinner;                                           // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo;                                              // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_59;                                          // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Text_C*                     Btn_Enter;                                         // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           BottomGradient;                                    // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               BottomBar;                                         // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               BG;                                                // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_ActionBar_C*                ActionBar_Menu;                                    // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UInstanceViewmodel1_IC*                 InstancedViewmodel_0;                              // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class FString                                 SaveSlotName;                                      // 0x05A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UWBP_Modal_GameModes_C*                 GameModeMenu;                                      // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Modal_VideoPlayer_C*               VideoGuideMenu;                                    // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         SpecialCharsArray;                                 // 0x05C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bFirstRunVideoHasPlayed;                           // 0x05D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLoginRequestPending;                            // 0x05D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AfterPush_42C24F7C48985610434D23A0F81A53C1(class UCommonActivatableWidget* UserWidget);
	void AfterPush_5DA11C314E5A4B0E3F3EEDB13D8D429A(class UCommonActivatableWidget* UserWidget);
	void BeforePush_42C24F7C48985610434D23A0F81A53C1(class UCommonActivatableWidget* UserWidget);
	void BeforePush_5DA11C314E5A4B0E3F3EEDB13D8D429A(class UCommonActivatableWidget* UserWidget);
	void BndEvt__WBP_MainMenu_ActionBar_Menu_K2Node_ComponentBoundEvent_3_Btn_OnClicked__DelegateSignature();
	void BndEvt__WBP_MainMenu_WBP_Button_Text_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	bool BP_OnHandleBackAction();
	void Close();
	void ExecuteUbergraph_WBP_MainMenu(int32 EntryPoint);
	class FText GetBuildVersion();
	void OnConfirm();
	void OnFailedLogin_UpdateVisuals();
	void OnInitializationComplete_3C8456624A611CD68DFB8585A7ED134A(const class UTyrOnlineUserInfo* UserInfo, bool bSuccess, const struct FTyrOnlineErrorWrapper& Error, ETyrUserOnlineContext OnlineContext);
	void OnInitializationComplete_F3CBB2BB4530F54DE0BA47AAB68EAD62(const class UTyrOnlineUserInfo* UserInfo, bool bSuccess, const struct FTyrOnlineErrorWrapper& Error, ETyrUserOnlineContext OnlineContext);
	void OnResult_63CE45A44A9788DB1C67C7930DCAEC9A(ETyrMessagingResult Result);
	void OnResult_866ED3C44FCA77BDF4F931BE89A885E2(ETyrMessagingResult Result);
	void OnResult_BFDD3F6F4831AF1DCBD3098F50055A16(ETyrMessagingResult Result);

	ESlateVisibility __1ae4ea15_435d_6228_8869_9f97cc18fadc_SourceToDest() const;
	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_MainMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_MainMenu_C")
	}
	static class UWBP_MainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainMenu_C>();
	}
};
DUMPER7_ASSERTS_UWBP_MainMenu_C;

// MVVMInstancedViewModelGeneratedClass WBP_MainMenu.InstanceViewmodel1_IC
// 0x0000 (0x0068 - 0x0068)
class UInstanceViewmodel1_IC final : public UMVVMViewModelBase
{
public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("InstanceViewmodel1_IC")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InstanceViewmodel1_IC")
	}
	static class UInstanceViewmodel1_IC* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstanceViewmodel1_IC>();
	}
};
DUMPER7_ASSERTS_UInstanceViewmodel1_IC;

SDK_NAMESPACE_END
