#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Loadout_TechTree_NodeLink

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Loadout_TechTree_NodeLink.WBP_Loadout_TechTree_NodeLink_C
// 0x0028 (0x0368 - 0x0340)
class UWBP_Loadout_TechTree_NodeLink_C final : public UUserWidget
{
public:
	class UImage*                                 TopLinks;                                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightLinks;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftLinks;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomLinks;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVM_TechTree_Node_C*                    VM_TechTree_Node;                                  // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void SetLinkColors(TArray<struct FLinearColor>& InColors);
	void SetLinkVisibilities(TArray<ESlateVisibility>& InVisibilities);
	void SetVM_TechTree_Node(class UVM_TechTree_Node_C* ViewModel);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Loadout_TechTree_NodeLink_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Loadout_TechTree_NodeLink_C")
	}
	static class UWBP_Loadout_TechTree_NodeLink_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Loadout_TechTree_NodeLink_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Loadout_TechTree_NodeLink_C;

SDK_NAMESPACE_END
