#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ClaimExperience_LevelProgressGrid

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_ClaimExperience_LevelProgressGrid.WBP_ClaimExperience_LevelProgressGrid_C
// 0x0060 (0x0508 - 0x04A8)
class UWBP_ClaimExperience_LevelProgressGrid_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonActivatableWidgetQueue*          VehicleQueue_02;                                   // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetQueue*          VehicleQueue_01;                                   // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetQueue*          VehicleQueue_00;                                   // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetQueue*          VehicleQueue_12;                                   // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetQueue*          VehicleQueue_11;                                   // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetQueue*          VehicleQueue_10;                                   // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                TopRowSpacer;                                      // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      LevelProgress_Grid;                                // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                BottomRowSpacer;                                   // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UCommonActivatableWidgetQueue*>  VehicleQueues;                                     // 0x04F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void AddClaimLevelExperience(TArray<class UVM_ClaimExperience_VehicleLevel_C*>& InClaimLevels, int32 InRow, int32 InColumn);
	void BP_OnDeactivated();
	bool BP_OnHandleBackAction();
	void ClearEditorPreviewWidgets();
	void ExecuteUbergraph_WBP_ClaimExperience_LevelProgressGrid(int32 EntryPoint);
	ESlateVisibility GetQueueVisibility(int32 InNumRows, int32 InNumColumns, class UWidget* InVehicleQueue);
	void OnInitialized();
	void OnTransitionToNextLevel(class UWBP_ClaimExperience_LevelProgress_C* LevelProgressWidget);
	void PreConstruct(bool IsDesignTime);
	void SetExpectedRowsAndColumns(int32 InNumRows, int32 InNumColumns);

	void GetQueue(int32 InRow, int32 InColumn, class UCommonActivatableWidgetQueue** VehicleQueue) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ClaimExperience_LevelProgressGrid_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ClaimExperience_LevelProgressGrid_C")
	}
	static class UWBP_ClaimExperience_LevelProgressGrid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ClaimExperience_LevelProgressGrid_C>();
	}
};
DUMPER7_ASSERTS_UWBP_ClaimExperience_LevelProgressGrid_C;

SDK_NAMESPACE_END
