#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Ranked_Leaderboard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Ranked_Leaderboard.WBP_Ranked_Leaderboard_C
// 0x0028 (0x0368 - 0x0340)
class UWBP_Ranked_Leaderboard_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             RankingOrder_Text;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTyrListView*                           Leaderboard_ListView;                              // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVM_Leaderboard_C*                      VM_Leaderboard;                                    // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         MaxPlayers;                                        // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Ranked_Leaderboard(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetVM_Leaderboard(class UVM_Leaderboard_C* ViewModel);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Ranked_Leaderboard_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Ranked_Leaderboard_C")
	}
	static class UWBP_Ranked_Leaderboard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Ranked_Leaderboard_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Ranked_Leaderboard_C;

SDK_NAMESPACE_END
