#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleHistory_Entry

#include "Basic.hpp"

#include "UMG_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_BattleHistory_Entry.WBP_BattleHistory_Entry_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_BattleHistory_Entry_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_BattleHistory_Entry_C_BP_OnItemExpansionChanged;

// Function WBP_BattleHistory_Entry.WBP_BattleHistory_Entry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_BattleHistory_Entry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_BattleHistory_Entry_C_BP_OnItemSelectionChanged;

// Function WBP_BattleHistory_Entry.WBP_BattleHistory_Entry_C.ExecuteUbergraph_WBP_BattleHistory_Entry
// 0x0040 (0x0040 - 0x0000)
struct WBP_BattleHistory_Entry_C_ExecuteUbergraph_WBP_BattleHistory_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0004(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0020(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x0030(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_BattleHistory_Entry_C_ExecuteUbergraph_WBP_BattleHistory_Entry;

// Function WBP_BattleHistory_Entry.WBP_BattleHistory_Entry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_BattleHistory_Entry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_BattleHistory_Entry_C_OnListItemObjectSet;

// Function WBP_BattleHistory_Entry.WBP_BattleHistory_Entry_C.SetVM_Battle
// 0x0028 (0x0028 - 0x0000)
struct WBP_BattleHistory_Entry_C_SetVM_Battle final
{
public:
	class UVM_Battle_C*                           ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_BattleHistory_Entry_C_SetVM_Battle;

// Function WBP_BattleHistory_Entry.WBP_BattleHistory_Entry_C.__37c7e3b0-4571-91a1-5350-94949f1aa357_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_BattleHistory_Entry_C___37c7e3b0_4571_91a1_5350_94949f1aa357_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanClaim_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_BattleHistory_Entry_C___37c7e3b0_4571_91a1_5350_94949f1aa357_SourceToDest;

// Function WBP_BattleHistory_Entry.WBP_BattleHistory_Entry_C.__48e6e46c-4eba-7d06-1530-f38b8289c6c1_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_BattleHistory_Entry_C___48e6e46c_4eba_7d06_1530_f38b8289c6c1_SourceToDest final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_AsTimeZoneDateTime_DateTime_ReturnValue;  // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_WBP_BattleHistory_Entry_C___48e6e46c_4eba_7d06_1530_f38b8289c6c1_SourceToDest;

// Function WBP_BattleHistory_Entry.WBP_BattleHistory_Entry_C.__5a46faab-419f-9442-d755-0e9e69cec9cf_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_BattleHistory_Entry_C___5a46faab_419f_9442_d755_0e9e69cec9cf_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInProgress_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_BattleHistory_Entry_C___5a46faab_419f_9442_d755_0e9e69cec9cf_SourceToDest;

// Function WBP_BattleHistory_Entry.WBP_BattleHistory_Entry_C.__a5760a52-480b-f1c2-13a8-eb96bdd6f807_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_BattleHistory_Entry_C___a5760a52_480b_f1c2_13a8_eb96bdd6f807_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanClaim_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_BattleHistory_Entry_C___a5760a52_480b_f1c2_13a8_eb96bdd6f807_SourceToDest;

// Function WBP_BattleHistory_Entry.WBP_BattleHistory_Entry_C.__a822ac98-4eaa-e6af-945f-a796d7264b77_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_BattleHistory_Entry_C___a822ac98_4eaa_e6af_945f_a796d7264b77_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanClaim_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_BattleHistory_Entry_C___a822ac98_4eaa_e6af_945f_a796d7264b77_SourceToDest;

// Function WBP_BattleHistory_Entry.WBP_BattleHistory_Entry_C.__b78a1e6e-4f2f-f541-b0cf-cabd484c3dfc_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_BattleHistory_Entry_C___b78a1e6e_4f2f_f541_b0cf_cabd484c3dfc_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInProgress_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_BattleHistory_Entry_C___b78a1e6e_4f2f_f541_b0cf_cabd484c3dfc_SourceToDest;

// Function WBP_BattleHistory_Entry.WBP_BattleHistory_Entry_C.__dccd60ac-4892-160b-bea2-9cb517821e23_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_BattleHistory_Entry_C___dccd60ac_4892_160b_bea2_9cb517821e23_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_BattleHistory_Entry_C___dccd60ac_4892_160b_bea2_9cb517821e23_SourceToDest;

// Function WBP_BattleHistory_Entry.WBP_BattleHistory_Entry_C.__ddf3b329-423a-a773-303a-948be0a27c00_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_BattleHistory_Entry_C___ddf3b329_423a_a773_303a_948be0a27c00_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInProgress_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_BattleHistory_Entry_C___ddf3b329_423a_a773_303a_948be0a27c00_SourceToDest;

// Function WBP_BattleHistory_Entry.WBP_BattleHistory_Entry_C.GetBonusRenderOpacity
// 0x0028 (0x0028 - 0x0000)
struct WBP_BattleHistory_Entry_C_GetBonusRenderOpacity final
{
public:
	bool                                          bInHasBonus;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RenderOpacity_0;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_BattleHistory_Entry_C_GetBonusRenderOpacity;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
