#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cosmetics_Charm_Button

#include "Basic.hpp"

#include "FieldNotification_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C_BP_OnItemExpansionChanged;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C_BP_OnItemSelectionChanged;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.ExecuteUbergraph_WBP_Cosmetics_Charm_Button
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C_ExecuteUbergraph_WBP_Cosmetics_Charm_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId;             // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_1;           // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0030(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0040(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0050(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0060(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_CanEquip_ReturnValue;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_2;           // 0x0074(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue; // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_3;           // 0x0094(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array_1;                          // 0x00A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue_1; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C_ExecuteUbergraph_WBP_Cosmetics_Charm_Button;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C_OnListItemObjectSet;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.SetVM_Cosmetics_Charm
// 0x0028 (0x0028 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C_SetVM_Cosmetics_Charm final
{
public:
	class UVM_Cosmetics_Charm_C*                  ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C_SetVM_Cosmetics_Charm;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.__1bce5d3f-4ef6-65c9-4b71-e4a0ca5dd4f9_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C___1bce5d3f_4ef6_65c9_4b71_e4a0ca5dd4f9_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_ToCosmeticsForegroundColor_ReturnValue;   // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C___1bce5d3f_4ef6_65c9_4b71_e4a0ca5dd4f9_SourceToDest;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.__2605b33a-4850-a627-4924-16895d286d44_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C___2605b33a_4850_a627_4924_16895d286d44_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorForRarity_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C___2605b33a_4850_a627_4924_16895d286d44_SourceToDest;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.__363e15f7-4455-f246-78b7-3f93caa58411_SourceToDest
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C___363e15f7_4455_f246_78b7_3f93caa58411_SourceToDest final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ToCharmAvailabilityIndex_ReturnValue;     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C___363e15f7_4455_f246_78b7_3f93caa58411_SourceToDest;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.__7e2bfa82-49a1-cc43-da70-498819d69d14_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C___7e2bfa82_49a1_cc43_da70_498819d69d14_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_ToCosmeticsFillBackerColor_ReturnValue;   // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C___7e2bfa82_49a1_cc43_da70_498819d69d14_SourceToDest;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.__ConversionFunction0208b880-fe40-36dd-a831-ceb4b48e2b21
// 0x0018 (0x0018 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C___ConversionFunction0208b880_fe40_36dd_a831_ceb4b48e2b21 final
{
public:
	struct FTyrMaterialScalarParam                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FTyrMaterialScalarParam                CallFunc_ToScalarMaterialParam__Boolean__ReturnValue; // 0x000C(0x000C)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C___ConversionFunction0208b880_fe40_36dd_a831_ceb4b48e2b21;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.__ConversionFunction050abb90-04c0-3a13-8bb2-dd109b2269e4
// 0x0002 (0x0002 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C___ConversionFunction050abb90_04c0_3a13_8bb2_dd109b2269e4 final
{
public:
	ESlateVisibility                              Visibility_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_ShowForValidRarity_Visibility;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C___ConversionFunction050abb90_04c0_3a13_8bb2_dd109b2269e4;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.__ConversionFunction0806ee00-7ecd-3388-8e28-0b8e3cffb938
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C___ConversionFunction0806ee00_7ecd_3388_8e28_0b8e3cffb938 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C___ConversionFunction0806ee00_7ecd_3388_8e28_0b8e3cffb938;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.__ConversionFunction0f518e43-0061-34f5-84d3-4f15428ec1d4
// 0x0002 (0x0002 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C___ConversionFunction0f518e43_0061_34f5_84d3_4f15428ec1d4 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C___ConversionFunction0f518e43_0061_34f5_84d3_4f15428ec1d4;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.__ConversionFunction4fd03b2d-d257-30f8-b2f6-7ca373829f3e
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C___ConversionFunction4fd03b2d_d257_30f8_b2f6_7ca373829f3e final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorForRarity_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C___ConversionFunction4fd03b2d_d257_30f8_b2f6_7ca373829f3e;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.__ConversionFunction50b918f0-0132-3ef2-9901-8abcf1e0cd2a
// 0x0002 (0x0002 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C___ConversionFunction50b918f0_0132_3ef2_9901_8abcf1e0cd2a final
{
public:
	ESlateVisibility                              Visibility_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_ShowForValidRarity_Visibility;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C___ConversionFunction50b918f0_0132_3ef2_9901_8abcf1e0cd2a;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.__ConversionFunction56a11b4d-b516-305f-8a32-04a52c0a8c17
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C___ConversionFunction56a11b4d_b516_305f_8a32_04a52c0a8c17 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorForRarity_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C___ConversionFunction56a11b4d_b516_305f_8a32_04a52c0a8c17;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.__ConversionFunctiona780bde1-29f1-3926-a9a9-05a8796c12dd
// 0x0002 (0x0002 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C___ConversionFunctiona780bde1_29f1_3926_a9a9_05a8796c12dd final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C___ConversionFunctiona780bde1_29f1_3926_a9a9_05a8796c12dd;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.__ConversionFunctiondd2dafdd-89a3-3e32-9f67-ae70d06796ae
// 0x0002 (0x0002 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C___ConversionFunctiondd2dafdd_89a3_3e32_9f67_ae70d06796ae final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C___ConversionFunctiondd2dafdd_89a3_3e32_9f67_ae70d06796ae;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.__f4372d23-4eb1-56ed-1b17-01bddf1aaf78_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C___f4372d23_4eb1_56ed_1b17_01bddf1aaf78_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorForRarity_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C___f4372d23_4eb1_56ed_1b17_01bddf1aaf78_SourceToDest;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.__fcbd62bb-488a-26c9-73e6-2ab11b34c666_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C___fcbd62bb_488a_26c9_73e6_2ab11b34c666_SourceToDest final
{
public:
	ESlateVisibility                              Visibility_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_ShowForValidRarity_Visibility;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C___fcbd62bb_488a_26c9_73e6_2ab11b34c666_SourceToDest;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.ToCharmAvailabilityIndex
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cosmetics_Charm_Button_C_ToCharmAvailabilityIndex final
{
public:
	bool                                          bInEquipped;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInOwned;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInCanPurchase;                                    // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C_ToCharmAvailabilityIndex;

// Function WBP_Cosmetics_Charm_Button.WBP_Cosmetics_Charm_Button_C.ToCharmInfoIndex
// 0x001C (0x001C - 0x0000)
struct WBP_Cosmetics_Charm_Button_C_ToCharmInfoIndex final
{
public:
	struct FGameplayTag                           InCharmTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_Button_C_ToCharmInfoIndex;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
