#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_ListEntryDiscrete

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Settings_ListEntryDiscrete.WBP_Settings_ListEntryDiscrete_C.BndEvt__WBP_SettingsListEntryDiscrete_Button_Decrease_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_ListEntryDiscrete_C_BndEvt__WBP_SettingsListEntryDiscrete_Button_Decrease_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Settings_ListEntryDiscrete_C_BndEvt__WBP_SettingsListEntryDiscrete_Button_Decrease_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Settings_ListEntryDiscrete.WBP_Settings_ListEntryDiscrete_C.BndEvt__WBP_SettingsListEntryDiscrete_Button_Increase_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_ListEntryDiscrete_C_BndEvt__WBP_SettingsListEntryDiscrete_Button_Increase_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Settings_ListEntryDiscrete_C_BndEvt__WBP_SettingsListEntryDiscrete_Button_Increase_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Settings_ListEntryDiscrete.WBP_Settings_ListEntryDiscrete_C.ExecuteUbergraph_WBP_Settings_ListEntryDiscrete
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_Settings_ListEntryDiscrete_C_ExecuteUbergraph_WBP_Settings_ListEntryDiscrete final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0008(0x0080)(ConstParm)
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Settings_Rotator_C*                K2Node_DynamicCast_AsWBP_Settings_Rotator;         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Settings_Rotator_C*                K2Node_DynamicCast_AsWBP_Settings_Rotator_1;       // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x00D8(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00F0(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0100(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0108(0x0008)(NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0110(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0148(0x0080)(ConstParm)
};
DUMPER7_ASSERTS_WBP_Settings_ListEntryDiscrete_C_ExecuteUbergraph_WBP_Settings_ListEntryDiscrete;

// Function WBP_Settings_ListEntryDiscrete.WBP_Settings_ListEntryDiscrete_C.GetPrimaryGamepadFocusWidget
// 0x0018 (0x0018 - 0x0000)
struct WBP_Settings_ListEntryDiscrete_C_GetPrimaryGamepadFocusWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Settings_ListEntryDiscrete_C_GetPrimaryGamepadFocusWidget;

// Function WBP_Settings_ListEntryDiscrete.WBP_Settings_ListEntryDiscrete_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_ListEntryDiscrete_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Settings_ListEntryDiscrete_C_OnAddedToFocusPath;

// Function WBP_Settings_ListEntryDiscrete.WBP_Settings_ListEntryDiscrete_C.OnMouseEnter
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_Settings_ListEntryDiscrete_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_Settings_ListEntryDiscrete_C_OnMouseEnter;

// Function WBP_Settings_ListEntryDiscrete.WBP_Settings_ListEntryDiscrete_C.OnMouseLeave
// 0x0080 (0x0080 - 0x0000)
struct WBP_Settings_ListEntryDiscrete_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_Settings_ListEntryDiscrete_C_OnMouseLeave;

// Function WBP_Settings_ListEntryDiscrete.WBP_Settings_ListEntryDiscrete_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_ListEntryDiscrete_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Settings_ListEntryDiscrete_C_OnRemovedFromFocusPath;

// Function WBP_Settings_ListEntryDiscrete.WBP_Settings_ListEntryDiscrete_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_ListEntryDiscrete_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Settings_ListEntryDiscrete_C_PreConstruct;

// Function WBP_Settings_ListEntryDiscrete.WBP_Settings_ListEntryDiscrete_C.SetSwitcher
// 0x0004 (0x0004 - 0x0000)
struct WBP_Settings_ListEntryDiscrete_C_SetSwitcher final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Settings_ListEntryDiscrete_C_SetSwitcher;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
