#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Loadout_TechTree_Node

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Loadout_TechTree_Node.WBP_Loadout_TechTree_Node_C
// 0x0080 (0x1610 - 0x1590)
class UWBP_Loadout_TechTree_Node_C final : public UTyrButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTyrLazyImage*                          Talent_Icon;                                       // 0x1598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnError;                                           // 0x15A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVM_TechTree_Node_C*                    VM_TechTree_Node;                                  // 0x15A8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UCommonTextBlock*                       PointsAllocated_Text;                              // 0x15B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       PointsMax_Text;                                    // 0x15B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Corner_Indicator;                                  // 0x15C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Points_Panel;                                      // 0x15C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BtnGlow;                                           // 0x15D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTyrLazyImage*                          BtnShape;                                          // 0x15D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Gak_Text;                                          // 0x15E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTyrLazyImage*                          BtnShapeError;                                     // 0x15E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          bPreviewNodeLink;                                  // 0x15F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15F1[0x7];                                     // 0x15F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UVM_TechTree_Node_C* Node)> OnNodeFocused;                   // 0x15F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnClicked();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_WBP_Loadout_TechTree_Node(int32 EntryPoint);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SetupTalentNode(class UVM_TechTree_Node_C* InNodeViewModel, const TDelegate<void(class UVM_TechTree_Node_C* Node)>& InNodeFocusedDelegate);
	void SetVM_TechTree_Node(class UVM_TechTree_Node_C* ViewModel);
	void TryAddPoint();
	void TryRemovePoint();

	struct FLinearColor __08eb53de_4bda_d1a7_30a5_ff9e60765363_SourceToDest() const;
	ESlateVisibility __09e229d6_4134_df7e_be23_4e9be8ba1915_SourceToDest() const;
	struct FTyrMaterialTextureParam __5666077b_4d0e_3e8f_d1e1_69a08825628e_SourceToDest() const;
	struct FTyrMaterialScalarParam __7238e57e_453a_644a_cf26_529c0d16efea_SourceToDest() const;
	class FText __93a1be49_4d22_8dbf_18c0_b9bb0d558b64_SourceToDest() const;
	ESlateVisibility __99c47ba6_40e8_17fa_c942_b88c4c655967_SourceToDest() const;
	ESlateVisibility __f32494cb_4b87_2a6c_92c5_72b7a021b974_SourceToDest() const;
	class FText __fc7b476f_4a89_5423_0f8e_61ac3fd6441e_SourceToDest() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Loadout_TechTree_Node_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Loadout_TechTree_Node_C")
	}
	static class UWBP_Loadout_TechTree_Node_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Loadout_TechTree_Node_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Loadout_TechTree_Node_C;

SDK_NAMESPACE_END
