#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Loadout

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FieldNotification_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Loadout.WBP_Loadout_C.BndEvt__WBP_Loadout_Ammunition_K2Node_ComponentBoundEvent_4_OnShellClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Loadout_C_BndEvt__WBP_Loadout_Ammunition_K2Node_ComponentBoundEvent_4_OnShellClicked__DelegateSignature final
{
public:
	class UVM_Ammunition_Shell_C*                 Shell;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_BndEvt__WBP_Loadout_Ammunition_K2Node_ComponentBoundEvent_4_OnShellClicked__DelegateSignature;

// Function WBP_Loadout.WBP_Loadout_C.BndEvt__WBP_Loadout_Clear_Button_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Loadout_C_BndEvt__WBP_Loadout_Clear_Button_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_BndEvt__WBP_Loadout_Clear_Button_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Loadout.WBP_Loadout_C.BndEvt__WBP_Loadout_Components_K2Node_ComponentBoundEvent_6_OnComponentClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Loadout_C_BndEvt__WBP_Loadout_Components_K2Node_ComponentBoundEvent_6_OnComponentClicked__DelegateSignature final
{
public:
	class UVM_Vehicle_Component_C*                Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_BndEvt__WBP_Loadout_Components_K2Node_ComponentBoundEvent_6_OnComponentClicked__DelegateSignature;

// Function WBP_Loadout.WBP_Loadout_C.BndEvt__WBP_Loadout_Export_Button_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Loadout_C_BndEvt__WBP_Loadout_Export_Button_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_BndEvt__WBP_Loadout_Export_Button_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Loadout.WBP_Loadout_C.BndEvt__WBP_Loadout_Import_Button_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Loadout_C_BndEvt__WBP_Loadout_Import_Button_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_BndEvt__WBP_Loadout_Import_Button_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Loadout.WBP_Loadout_C.BndEvt__WBP_Loadout_Loadout_Switcher_K2Node_ComponentBoundEvent_10_OnActiveIndexChangedDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Loadout_C_BndEvt__WBP_Loadout_Loadout_Switcher_K2Node_ComponentBoundEvent_10_OnActiveIndexChangedDelegate__DelegateSignature final
{
public:
	class UWidget*                                ActiveWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ActiveIndex;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_BndEvt__WBP_Loadout_Loadout_Switcher_K2Node_ComponentBoundEvent_10_OnActiveIndexChangedDelegate__DelegateSignature;

// Function WBP_Loadout.WBP_Loadout_C.BndEvt__WBP_Loadout_Loadout_Tabs_K2Node_ComponentBoundEvent_2_OnComponentSlotSelected__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Loadout_C_BndEvt__WBP_Loadout_Loadout_Tabs_K2Node_ComponentBoundEvent_2_OnComponentSlotSelected__DelegateSignature final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_BndEvt__WBP_Loadout_Loadout_Tabs_K2Node_ComponentBoundEvent_2_OnComponentSlotSelected__DelegateSignature;

// Function WBP_Loadout.WBP_Loadout_C.BndEvt__WBP_Loadout_Loadout_Tabs_K2Node_ComponentBoundEvent_3_OnAmmoSlotSelected__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Loadout_C_BndEvt__WBP_Loadout_Loadout_Tabs_K2Node_ComponentBoundEvent_3_OnAmmoSlotSelected__DelegateSignature final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_BndEvt__WBP_Loadout_Loadout_Tabs_K2Node_ComponentBoundEvent_3_OnAmmoSlotSelected__DelegateSignature;

// Function WBP_Loadout.WBP_Loadout_C.BndEvt__WBP_Loadout_Rename_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Loadout_C_BndEvt__WBP_Loadout_Rename_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_BndEvt__WBP_Loadout_Rename_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Loadout.WBP_Loadout_C.BndEvt__WBP_Loadout_SlotTabs_K2Node_ComponentBoundEvent_5_OnSlotSelected__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Loadout_C_BndEvt__WBP_Loadout_SlotTabs_K2Node_ComponentBoundEvent_5_OnSlotSelected__DelegateSignature final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_BndEvt__WBP_Loadout_SlotTabs_K2Node_ComponentBoundEvent_5_OnSlotSelected__DelegateSignature;

// Function WBP_Loadout.WBP_Loadout_C.CreateAmmunitionPurchaseDescriptor
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_Loadout_C_CreateAmmunitionPurchaseDescriptor final
{
public:
	class UVM_Ammunition_Shell_C*                 InShell;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrGameDialogDescriptor*               Descriptor;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrGameDialogDescriptor*               CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Currency_Purchase_C*                CallFunc_CreatePurchaseViewModel_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FConfirmationDialogAction              K2Node_MakeStruct_ConfirmationDialogAction;        // 0x0020(0x0018)()
	struct FConfirmationDialogAction              K2Node_MakeStruct_ConfirmationDialogAction_1;      // 0x0038(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	TArray<struct FConfirmationDialogAction>      K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0010)()
};
DUMPER7_ASSERTS_WBP_Loadout_C_CreateAmmunitionPurchaseDescriptor;

// Function WBP_Loadout.WBP_Loadout_C.CreateComponentPurchaseDescriptor
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_Loadout_C_CreateComponentPurchaseDescriptor final
{
public:
	class UVM_Vehicle_Component_C*                InComponent;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrGameDialogDescriptor*               Descriptor;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrGameDialogDescriptor*               CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Currency_Purchase_C*                CallFunc_CreatePurchaseViewModel_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FConfirmationDialogAction              K2Node_MakeStruct_ConfirmationDialogAction;        // 0x0020(0x0018)()
	struct FConfirmationDialogAction              K2Node_MakeStruct_ConfirmationDialogAction_1;      // 0x0038(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	TArray<struct FConfirmationDialogAction>      K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0010)()
};
DUMPER7_ASSERTS_WBP_Loadout_C_CreateComponentPurchaseDescriptor;

// Function WBP_Loadout.WBP_Loadout_C.CreatePurchaseViewModel
// 0x0078 (0x0078 - 0x0000)
struct WBP_Loadout_C_CreatePurchaseViewModel final
{
public:
	int32                                         InSoftCurrencyCost;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Currency_Purchase_C*                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UVM_Currency_Purchase_C*                Loc_PurchaseViewModel;                             // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId;             // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_1;           // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	class UVM_Currency_Purchase_C*                CallFunc_SpawnObject_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Currency_C*                         CallFunc_GetCurrencyViewModel_ViewModel;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_2;           // 0x004C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_3;           // 0x0054(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array_1;                          // 0x0060(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue_1; // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_CreatePurchaseViewModel;

// Function WBP_Loadout.WBP_Loadout_C.CreateSlotNameDialogDescriptor
// 0x0068 (0x0068 - 0x0000)
struct WBP_Loadout_C_CreateSlotNameDialogDescriptor final
{
public:
	class UTyrGameDialogDescriptor*               Descriptor;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Dialog_TextInput_C*                 TextInputViewModel;                                // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Dialog_TextInput_C*                 Loc_TextInputViewModel;                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrGameDialogDescriptor*               CallFunc_SpawnObject_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Dialog_TextInput_C*                 CallFunc_CreateTextInputViewModel_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FConfirmationDialogAction              K2Node_MakeStruct_ConfirmationDialogAction;        // 0x0028(0x0018)()
	struct FConfirmationDialogAction              K2Node_MakeStruct_ConfirmationDialogAction_1;      // 0x0040(0x0018)()
	TArray<struct FConfirmationDialogAction>      K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
};
DUMPER7_ASSERTS_WBP_Loadout_C_CreateSlotNameDialogDescriptor;

// Function WBP_Loadout.WBP_Loadout_C.CreateTextInputViewModel
// 0x0040 (0x0040 - 0x0000)
struct WBP_Loadout_C_CreateTextInputViewModel final
{
public:
	class UVM_Dialog_TextInput_C*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UVM_Dialog_TextInput_C*                 Loc_TextInputViewModel;                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Dialog_TextInput_C*                 CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId;             // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_CreateTextInputViewModel;

// Function WBP_Loadout.WBP_Loadout_C.ExecuteUbergraph_WBP_Loadout
// 0x0450 (0x0450 - 0x0000)
struct WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrMessagingResult                           K2Node_CustomEvent_Result_3;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ETyrMessagingResult Result)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETyrMessagingResult                           Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrAsyncActionShowError*               CallFunc_ShowErrorOk_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ETyrMessagingResult Result)>   K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETyrMessagingResult                           K2Node_CustomEvent_Result_2;                       // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrMessagingResult                           Temp_byte_Variable_1;                              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ETyrMessagingResult Result)>   K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETyrMessagingResult                           K2Node_CustomEvent_Result_1;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrMessagingResult                           Temp_byte_Variable_2;                              // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ETyrMessagingResult Result)>   K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETyrMessagingResult                           K2Node_CustomEvent_Result;                         // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrMessagingResult                           Temp_byte_Variable_3;                              // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrAsyncActionShowError*               CallFunc_ShowErrorOk_ReturnValue_1;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_SlotIndex_2;            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SlotIndex_1;            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Ammunition_C*                       CallFunc_GetAmmunitionViewModel_ViewModel;         // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Ammunition_C*                       CallFunc_GetAmmunitionViewModel_ViewModel_1;       // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SlotIndex;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Vehicle_Components_C*               CallFunc_GetComponentsViewModel_ViewModel;         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Component_C*                K2Node_ComponentBoundEvent_Component;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrGameDialogDescriptor*               CallFunc_CreateComponentPurchaseDescriptor_Descriptor; // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanUnlockWithCurrency_ReturnValue;        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrAsyncActionShowConfirmation*        CallFunc_ShowConfirmationCustom_ReturnValue;       // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryEquipComponent_bDidEquip;              // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TryEquipComponent_ErrorMessage;           // 0x0108(0x0010)()
	struct FGameplayTag                           CallFunc_GetEquippedComponent_ReturnValue;         // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0128(0x0010)()
	class UVM_Ammunition_Shell_C*                 K2Node_ComponentBoundEvent_Shell;                  // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0140(0x0048)(HasGetValueTypeHash)
	class UTyrGameDialogDescriptor*               CallFunc_CreateAmmunitionPurchaseDescriptor_Descriptor; // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0190(0x0010)(ReferenceParm)
	class UTyrAsyncActionShowConfirmation*        CallFunc_ShowConfirmationCustom_ReturnValue_1;     // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01A8(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanUnlockWithCurrency_ReturnValue_1;      // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryEquipShell_bDidEquip;                  // 0x01BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TryEquipShell_ErrorMessage;               // 0x01C0(0x0010)()
	class UTyrGameDialogDescriptor*               CallFunc_CreateSlotNameDialogDescriptor_Descriptor; // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Dialog_TextInput_C*                 CallFunc_CreateSlotNameDialogDescriptor_TextInputViewModel; // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrAsyncActionShowConfirmation*        CallFunc_ShowConfirmationCustom_ReturnValue_2;     // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrMessagingResult                           Temp_byte_Variable_4;                              // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrMessagingResult                           Temp_byte_Variable_5;                              // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrMessagingResult                           K2Node_CustomEvent_Result_4;                       // 0x01EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EF[0x1];                                      // 0x01EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x01F0(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0200(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ETyrMessagingResult Result)>   K2Node_CreateDelegate_OutputDelegate_5;            // 0x0214(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSuccess, const struct FTyrOnlineErrorWrapper& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate_6; // 0x0224(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrMessagingResult                           Temp_byte_Variable_6;                              // 0x0235(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0236(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_237[0x1];                                      // 0x0237(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrProgressionSubsystem*               CallFunc_GetProgressionSubsystem_ReturnValue;      // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVehicleUnlocked_ReturnValue;            // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrMessagingResult                           K2Node_CustomEvent_Result_5;                       // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242[0x2];                                      // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ETyrMessagingResult Result)>   K2Node_CreateDelegate_OutputDelegate_7;            // 0x0244(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrBreadcrumbSubsystem*                CallFunc_GetBreadcrumbSubsystem_ReturnValue;       // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrBreadcrumbSubsystem*                CallFunc_GetBreadcrumbSubsystem_ReturnValue_1;     // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FItemBreadcrumb                        K2Node_MakeStruct_ItemBreadcrumb;                  // 0x0268(0x0010)(NoDestructor, HasGetValueTypeHash)
	struct FItemBreadcrumb                        K2Node_MakeStruct_ItemBreadcrumb_1;                // 0x0278(0x0010)(NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_ActiveWidget;           // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ActiveIndex;            // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrMessagingResult                           K2Node_CustomEvent_Result_7;                       // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_DynamicCast_AsCommon_Activatable_Widget;    // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ETyrMessagingResult Result)>   K2Node_CreateDelegate_OutputDelegate_8;            // 0x02B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Modal_MenuOptions_C*               CallFunc_PushContentToLayerForPlayer_ReturnValue;  // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_PasteTextFromClipboard_OutText;           // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_PasteTextFromClipboard_ReturnValue;       // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTyrLoadoutSubsystem*                   CallFunc_GetLoadoutSubsystem_ReturnValue;          // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_1;                    // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_2;                    // 0x0318(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_3;                    // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetVehicleTagFromShareCode_OutVehicleTag; // 0x0340(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetVehicleTagFromShareCode_ReturnValue;   // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidLoadoutShareCode_ReturnValue;      // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34A[0x6];                                      // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0350(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrOnlineErrorWrapper                 K2Node_CustomEvent_ErrorMessage;                   // 0x0360(0x0028)(ConstParm)
	class UTyrAsyncActionShowError*               CallFunc_ShowErrorOkWithError_ReturnValue;         // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrAsyncActionShowError*               CallFunc_ShowErrorOkWithError_ReturnValue_1;       // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSuccess_ReturnValue;                    // 0x039A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39B[0x5];                                      // 0x039B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x03A0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x03E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x03F8(0x0010)()
	class FString                                 CallFunc_ExportLoadoutDataToShareCode_OutShareCode; // 0x0408(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExportLoadoutDataToShareCode_ReturnValue; // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrAsyncActionShowConfirmation*        CallFunc_ShowConfirmationYesNo_ReturnValue;        // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CopyTextToClipboardChecked_ReturnValue;   // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrMessagingResult                           Temp_byte_Variable_7;                              // 0x042A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x042B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x042C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrMessagingResult                           K2Node_CustomEvent_Result_6;                       // 0x042D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42E[0x2];                                      // 0x042E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ETyrMessagingResult Result)>   K2Node_CreateDelegate_OutputDelegate_9;            // 0x0430(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Components_C*               CallFunc_GetComponentsViewModel_ViewModel_1;       // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Ammunition_C*                       CallFunc_GetAmmunitionViewModel_ViewModel_2;       // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout;

// Function WBP_Loadout.WBP_Loadout_C.OnImportComplete
// 0x0030 (0x0030 - 0x0000)
struct WBP_Loadout_C_OnImportComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrOnlineErrorWrapper                 ErrorMessage;                                      // 0x0008(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_Loadout_C_OnImportComplete;

// Function WBP_Loadout.WBP_Loadout_C.OnMessageReceived_4A3A87AC2844F38F82BEB38AC8D47CBD
// 0x0010 (0x0010 - 0x0000)
struct WBP_Loadout_C_OnMessageReceived_4A3A87AC2844F38F82BEB38AC8D47CBD final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_OnMessageReceived_4A3A87AC2844F38F82BEB38AC8D47CBD;

// Function WBP_Loadout.WBP_Loadout_C.OnResult_09143424468BD09309DAFCB412907332
// 0x0001 (0x0001 - 0x0000)
struct WBP_Loadout_C_OnResult_09143424468BD09309DAFCB412907332 final
{
public:
	ETyrMessagingResult                           Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_OnResult_09143424468BD09309DAFCB412907332;

// Function WBP_Loadout.WBP_Loadout_C.OnResult_1ECB274941C9C2EC3395B9A5EF441FEE
// 0x0001 (0x0001 - 0x0000)
struct WBP_Loadout_C_OnResult_1ECB274941C9C2EC3395B9A5EF441FEE final
{
public:
	ETyrMessagingResult                           Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_OnResult_1ECB274941C9C2EC3395B9A5EF441FEE;

// Function WBP_Loadout.WBP_Loadout_C.OnResult_2F5011C64483335A861F07BD47F82CC9
// 0x0001 (0x0001 - 0x0000)
struct WBP_Loadout_C_OnResult_2F5011C64483335A861F07BD47F82CC9 final
{
public:
	ETyrMessagingResult                           Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_OnResult_2F5011C64483335A861F07BD47F82CC9;

// Function WBP_Loadout.WBP_Loadout_C.OnResult_9359CA8D43316B468D574C884EDF2530
// 0x0001 (0x0001 - 0x0000)
struct WBP_Loadout_C_OnResult_9359CA8D43316B468D574C884EDF2530 final
{
public:
	ETyrMessagingResult                           Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_OnResult_9359CA8D43316B468D574C884EDF2530;

// Function WBP_Loadout.WBP_Loadout_C.OnResult_A21CB97641B9A88D6FDDEFBE90EF9562
// 0x0001 (0x0001 - 0x0000)
struct WBP_Loadout_C_OnResult_A21CB97641B9A88D6FDDEFBE90EF9562 final
{
public:
	ETyrMessagingResult                           Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_OnResult_A21CB97641B9A88D6FDDEFBE90EF9562;

// Function WBP_Loadout.WBP_Loadout_C.OnResult_B3767ADF4BDFE42A9741D0ABB74385F1
// 0x0001 (0x0001 - 0x0000)
struct WBP_Loadout_C_OnResult_B3767ADF4BDFE42A9741D0ABB74385F1 final
{
public:
	ETyrMessagingResult                           Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_OnResult_B3767ADF4BDFE42A9741D0ABB74385F1;

// Function WBP_Loadout.WBP_Loadout_C.OnResult_B8CE8D7B432C52E8AEFBC4B220E33D92
// 0x0001 (0x0001 - 0x0000)
struct WBP_Loadout_C_OnResult_B8CE8D7B432C52E8AEFBC4B220E33D92 final
{
public:
	ETyrMessagingResult                           Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_OnResult_B8CE8D7B432C52E8AEFBC4B220E33D92;

// Function WBP_Loadout.WBP_Loadout_C.OnResult_D273D5A24290CC3606CEF5B9CDF091A1
// 0x0001 (0x0001 - 0x0000)
struct WBP_Loadout_C_OnResult_D273D5A24290CC3606CEF5B9CDF091A1 final
{
public:
	ETyrMessagingResult                           Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_OnResult_D273D5A24290CC3606CEF5B9CDF091A1;

// Function WBP_Loadout.WBP_Loadout_C.RefreshImportButtonState
// 0x0050 (0x0050 - 0x0000)
struct WBP_Loadout_C_RefreshImportButtonState final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0018(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0028(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0038(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_1; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetButtonEnabled_NewParam;                // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_RefreshImportButtonState;

// Function WBP_Loadout.WBP_Loadout_C.SetLoadoutSlotIndex
// 0x0010 (0x0010 - 0x0000)
struct WBP_Loadout_C_SetLoadoutSlotIndex final
{
public:
	int32                                         InSlotIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Vehicle_Loadout_C*                  CallFunc_GetLoadoutAtIndex_LoadoutViewModel;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_SetLoadoutSlotIndex;

// Function WBP_Loadout.WBP_Loadout_C.SetViewModels
// 0x0050 (0x0050 - 0x0000)
struct WBP_Loadout_C_SetViewModels final
{
public:
	class UVM_Vehicle_LoadoutSlots_C*             InLoadoutSlotsViewModel;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_C*                          InVehicleViewModel;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Levels_C*                   InVehicleLevelsModel;                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         InSlotIndex;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVM_Ammunition_C*                       CallFunc_GetAmmunitionViewModel_ViewModel;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Components_C*               CallFunc_GetComponentsViewModel_ViewModel;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Level_C*                    CallFunc_GetCurrentLevel_LevelViewModel;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Loadout_C*                  CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_SetViewModels;

// Function WBP_Loadout.WBP_Loadout_C.SetVM_Vehicle
// 0x0028 (0x0028 - 0x0000)
struct WBP_Loadout_C_SetVM_Vehicle final
{
public:
	class UVM_Vehicle_C*                          ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_SetVM_Vehicle;

// Function WBP_Loadout.WBP_Loadout_C.SetVM_Vehicle_Level
// 0x0028 (0x0028 - 0x0000)
struct WBP_Loadout_C_SetVM_Vehicle_Level final
{
public:
	class UVM_Vehicle_Level_C*                    ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_SetVM_Vehicle_Level;

// Function WBP_Loadout.WBP_Loadout_C.SetVM_Vehicle_Loadout
// 0x0028 (0x0028 - 0x0000)
struct WBP_Loadout_C_SetVM_Vehicle_Loadout final
{
public:
	class UVM_Vehicle_Loadout_C*                  ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_SetVM_Vehicle_Loadout;

// Function WBP_Loadout.WBP_Loadout_C.SetVM_Vehicle_LoadoutSlots
// 0x0028 (0x0028 - 0x0000)
struct WBP_Loadout_C_SetVM_Vehicle_LoadoutSlots final
{
public:
	class UVM_Vehicle_LoadoutSlots_C*             ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_SetVM_Vehicle_LoadoutSlots;

// Function WBP_Loadout.WBP_Loadout_C.TryClearCurrentAmmoSlotBreadcrumbs
// 0x0018 (0x0018 - 0x0000)
struct WBP_Loadout_C_TryClearCurrentAmmoSlotBreadcrumbs final
{
public:
	class UVM_Ammunition_C*                       CallFunc_GetAmmunitionViewModel_ViewModel;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Ammunition_C*                       CallFunc_GetAmmunitionViewModel_ViewModel_1;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_TryClearCurrentAmmoSlotBreadcrumbs;

// Function WBP_Loadout.WBP_Loadout_C.TryClearCurrentComponentSlotBreadcrumbs
// 0x0010 (0x0010 - 0x0000)
struct WBP_Loadout_C_TryClearCurrentComponentSlotBreadcrumbs final
{
public:
	class UVM_Vehicle_Components_C*               CallFunc_GetComponentsViewModel_ViewModel;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_C_TryClearCurrentComponentSlotBreadcrumbs;

// Function WBP_Loadout.WBP_Loadout_C.TryShowEquippedAmmunitionDetails
// 0x0018 (0x0018 - 0x0000)
struct WBP_Loadout_C_TryShowEquippedAmmunitionDetails final
{
public:
	class UVM_Ammunition_C*                       CallFunc_GetAmmunitionViewModel_ViewModel;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasEquippedSlotShell_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
