#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Button_Text_Icon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "WBP_Button_Text_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Button_Text_Icon.WBP_Button_Text_Icon_C
// 0x00E0 (0x16F0 - 0x1610)
class UWBP_Button_Text_Icon_C final : public UWBP_Button_Text_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Button_Text_Icon_C;             // 0x1610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_1618[0x8];                                     // 0x1618(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Icon;                                              // 0x1620(0x00B0)(Edit, BlueprintVisible)
	class UImage*                                 IconImage;                                         // 0x16D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                IconPadding;                                       // 0x16D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               IconDynamicMaterial;                               // 0x16E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime_PreConstruct);
	void ExecuteUbergraph_WBP_Button_Text_Icon(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Button_Text_Icon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Button_Text_Icon_C")
	}
	static class UWBP_Button_Text_Icon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Button_Text_Icon_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Button_Text_Icon_C;

SDK_NAMESPACE_END
