#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Lobby_Player_Entry_Left

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Tyr_structs.hpp"
#include "CommonInput_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Lobby_Player_Entry_Left.WBP_Lobby_Player_Entry_Left_C.BndEvt__WBP_Lobby_Player_Entry_Left_Btn_JoinTeam_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Player_Entry_Left_C_BndEvt__WBP_Lobby_Player_Entry_Left_Btn_JoinTeam_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Player_Entry_Left_C_BndEvt__WBP_Lobby_Player_Entry_Left_Btn_JoinTeam_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Player_Entry_Left.WBP_Lobby_Player_Entry_Left_C.BndEvt__WBP_Lobby_Player_Entry_Left_Btn_JoinTeam_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Player_Entry_Left_C_BndEvt__WBP_Lobby_Player_Entry_Left_Btn_JoinTeam_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Player_Entry_Left_C_BndEvt__WBP_Lobby_Player_Entry_Left_Btn_JoinTeam_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Player_Entry_Left.WBP_Lobby_Player_Entry_Left_C.BndEvt__WBP_Lobby_Player_Entry_Left_Btn_JoinTeam_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Player_Entry_Left_C_BndEvt__WBP_Lobby_Player_Entry_Left_Btn_JoinTeam_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Player_Entry_Left_C_BndEvt__WBP_Lobby_Player_Entry_Left_Btn_JoinTeam_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Player_Entry_Left.WBP_Lobby_Player_Entry_Left_C.BndEvt__WBP_Lobby_Player_Entry_Left_PlayerDetails_ContextMenuAnchor_K2Node_ComponentBoundEvent_1_OnShowContextMenu__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Player_Entry_Left_C_BndEvt__WBP_Lobby_Player_Entry_Left_PlayerDetails_ContextMenuAnchor_K2Node_ComponentBoundEvent_1_OnShowContextMenu__DelegateSignature final
{
public:
	class UTyrContextMenuWidget*                  MenuWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Player_Entry_Left_C_BndEvt__WBP_Lobby_Player_Entry_Left_PlayerDetails_ContextMenuAnchor_K2Node_ComponentBoundEvent_1_OnShowContextMenu__DelegateSignature;

// Function WBP_Lobby_Player_Entry_Left.WBP_Lobby_Player_Entry_Left_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Lobby_Player_Entry_Left_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Player_Entry_Left_C_BP_OnItemExpansionChanged;

// Function WBP_Lobby_Player_Entry_Left.WBP_Lobby_Player_Entry_Left_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Lobby_Player_Entry_Left_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Player_Entry_Left_C_BP_OnItemSelectionChanged;

// Function WBP_Lobby_Player_Entry_Left.WBP_Lobby_Player_Entry_Left_C.ExecuteUbergraph_WBP_Lobby_Player_Entry_Left
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Lobby_Player_Entry_Left_C_ExecuteUbergraph_WBP_Lobby_Player_Entry_Left final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTyrContextMenuWidget*                  K2Node_ComponentBoundEvent_MenuWidget;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0020(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0028(0x0008)(NoDestructor)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0038(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x0048(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0060(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x0070(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0080(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0090(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Player_Entry_Left_C_ExecuteUbergraph_WBP_Lobby_Player_Entry_Left;

// Function WBP_Lobby_Player_Entry_Left.WBP_Lobby_Player_Entry_Left_C.GetUserMenuContent
// 0x0018 (0x0018 - 0x0000)
struct WBP_Lobby_Player_Entry_Left_C_GetUserMenuContent final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tooltip_ItemDetail_C*              CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Player_Entry_Left_C_GetUserMenuContent;

// Function WBP_Lobby_Player_Entry_Left.WBP_Lobby_Player_Entry_Left_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Player_Entry_Left_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Lobby_Player_Entry_Left_C_OnAddedToFocusPath;

// Function WBP_Lobby_Player_Entry_Left.WBP_Lobby_Player_Entry_Left_C.OnFocusReceived
// 0x0288 (0x0288 - 0x0000)
struct WBP_Lobby_Player_Entry_Left_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	int32                                         Temp_int_Variable;                                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0110(0x00B8)()
	class UWidget*                                K2Node_Select_Default;                             // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_SetUserFocus_ReturnValue;                 // 0x01D0(0x00B8)()
};
DUMPER7_ASSERTS_WBP_Lobby_Player_Entry_Left_C_OnFocusReceived;

// Function WBP_Lobby_Player_Entry_Left.WBP_Lobby_Player_Entry_Left_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Player_Entry_Left_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Player_Entry_Left_C_OnListItemObjectSet;

// Function WBP_Lobby_Player_Entry_Left.WBP_Lobby_Player_Entry_Left_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Player_Entry_Left_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Lobby_Player_Entry_Left_C_OnRemovedFromFocusPath;

// Function WBP_Lobby_Player_Entry_Left.WBP_Lobby_Player_Entry_Left_C.SetVM_Lobby_Player
// 0x0028 (0x0028 - 0x0000)
struct WBP_Lobby_Player_Entry_Left_C_SetVM_Lobby_Player final
{
public:
	class UVM_Lobby_Player_C*                     ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Player_Entry_Left_C_SetVM_Lobby_Player;

// Function WBP_Lobby_Player_Entry_Left.WBP_Lobby_Player_Entry_Left_C.UpdateIsReady
// 0x0020 (0x0020 - 0x0000)
struct WBP_Lobby_Player_Entry_Left_C_UpdateIsReady final
{
public:
	bool                                          bInIsReady;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Player_Entry_Left_C_UpdateIsReady;

// Function WBP_Lobby_Player_Entry_Left.WBP_Lobby_Player_Entry_Left_C.__09bb7f2d-48b2-97d2-dcf7-b58d5915606a_SourceToDest
// 0x0010 (0x0010 - 0x0000)
struct WBP_Lobby_Player_Entry_Left_C___09bb7f2d_48b2_97d2_dcf7_b58d5915606a_SourceToDest final
{
public:
	class UTexture2D*                             Icon;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_ToTankClassIcon_Icon;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Player_Entry_Left_C___09bb7f2d_48b2_97d2_dcf7_b58d5915606a_SourceToDest;

// Function WBP_Lobby_Player_Entry_Left.WBP_Lobby_Player_Entry_Left_C.__89542b1a-4b89-9d81-d04b-11bd1d753b1f_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Lobby_Player_Entry_Left_C___89542b1a_4b89_9d81_d04b_11bd1d753b1f_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Player_Entry_Left_C___89542b1a_4b89_9d81_d04b_11bd1d753b1f_SourceToDest;

// Function WBP_Lobby_Player_Entry_Left.WBP_Lobby_Player_Entry_Left_C.__9722d86f-4133-4f5c-34b4-4aa8703dac61_SourceToDest
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_Lobby_Player_Entry_Left_C___9722d86f_4133_4f5c_34b4_4aa8703dac61_SourceToDest final
{
public:
	struct FTyrMaterialTextureParam               ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm)
	struct FTyrMaterialTextureParam               CallFunc_ToTextureMaterialParam__Texture__ReturnValue; // 0x0060(0x0060)()
};
DUMPER7_ASSERTS_WBP_Lobby_Player_Entry_Left_C___9722d86f_4133_4f5c_34b4_4aa8703dac61_SourceToDest;

// Function WBP_Lobby_Player_Entry_Left.WBP_Lobby_Player_Entry_Left_C.__9f2a67f8-4b7f-06bb-826e-8193ad1ca033_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Lobby_Player_Entry_Left_C___9f2a67f8_4b7f_06bb_826e_8193ad1ca033_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Player_Entry_Left_C___9f2a67f8_4b7f_06bb_826e_8193ad1ca033_SourceToDest;

// Function WBP_Lobby_Player_Entry_Left.WBP_Lobby_Player_Entry_Left_C.__cb439777-4043-ad96-7346-b49ca0dd30a3_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Lobby_Player_Entry_Left_C___cb439777_4043_ad96_7346_b49ca0dd30a3_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Player_Entry_Left_C___cb439777_4043_ad96_7346_b49ca0dd30a3_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
