#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_Scoreboard_Horizontal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_HUD_Scoreboard_Horizontal.WBP_HUD_Scoreboard_Horizontal_C
// 0x0098 (0x03D8 - 0x0340)
class UWBP_HUD_Scoreboard_Horizontal_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_HUD_LastStand_Scoreboard_C*        WBP_HUD_LastStand_Enemy;                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_LastStand_Scoreboard_C*        WBP_HUD_LastStand_Ally;                            // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_GameStateInfo1_C*              WBP_GameStateInfo1;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_81;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_59;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListView*                              EnemyDetailedList;                                 // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListView*                              AllyDetailedList;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimIn;                                            // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVM_Scoreboard_InGame_C*                VM_Scoreboard_InGame;                              // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        CurrentHealth_Ally;                                // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentHealth_Enemy;                               // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxHealth_Ally;                                    // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxHealth_Enemy;                                   // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsScoreboardActive;                               // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrAsyncActionGetGameStateViewModel*   AsyncAction_GameStateViewModel;                    // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTyrAsyncActionWaitForGameStateReady*   AsyncAction_GameStateReady;                        // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  TargetPawn;                                        // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Completed_EE7E44ED4073E0979D1A028AE8EAB986(class UTyrGameStateViewModel* ViewModel);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_HUD_Scoreboard_Horizontal(int32 EntryPoint);
	float Get_AllyHealthBar_Percent();
	float Get_EnemyHealthBar_Percent();
	void GetHealthBarPercentByTeamId(bool bInLookForSameTeam, int32 InTeamId, double* OutPercent);
	void HandleLastStandMessage(const struct FTyrGameActionMessage& InPayload);
	void OnInitialized();
	void OnMessageReceived_201134624380AD4C8A1E04A93DB56492(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_3C7FEFC34F7C24A95757EF9DC8697ED7(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_8318D90F402AE31B89CE569DBBFD3465(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_CAFCD24E48602F51F9958DBC3FB930AD(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_D2A6BB8948FD9E737C371C8AD1303383(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_EC588CAF4BB4D251D46ED5BCFA340A8E(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnReady_265AA0774962DC5B6639DD8EDDB98D22(class ATyrGameStateBase* GameState);
	void OnScoreboardToggled(bool bIsScoreboardVisible);
	void OnTeamChanged_FACA35264F091930F221228DBDBA3DDF(bool bTeamSet, int32 TeamId);
	void Populate_Initial_Health_Values();
	void PreConstruct(bool IsDesignTime);
	void SetVM_Scoreboard_InGame(class UVM_Scoreboard_InGame_C* ViewModel);
	void UpdateAllPlayerLists();
	void UpdateCurrentHealthForTeam(class ATyrTeamPublicInfo* InTeamPublicInfo, double InHealth);
	void UpdateMaxHealthForTeam(class ATyrTeamPublicInfo* InTeamPublicInfo, double InHealth);
	void UpdateStatsListVisibilityFromLocalSettings();

	void __18bce08f_4666_6018_429f_34b7fb58d67f_SourceToDest(TArray<class UObject*>* OutReversedList) const;
	void __b4dc07f3_4129_db52_a56a_d79d5b041b1f_SourceToDest(TArray<class UObject*>* OutReversedList) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_HUD_Scoreboard_Horizontal_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_HUD_Scoreboard_Horizontal_C")
	}
	static class UWBP_HUD_Scoreboard_Horizontal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_Scoreboard_Horizontal_C>();
	}
};
DUMPER7_ASSERTS_UWBP_HUD_Scoreboard_Horizontal_C;

SDK_NAMESPACE_END
