#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Loadout_TechTree

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FieldNotification_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.AddNodeDelegates
// 0x0040 (0x0040 - 0x0000)
struct WBP_Loadout_TechTree_C_AddNodeDelegates final
{
public:
	class UVM_TechTree_Node_C*                    InNode;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> InDescriptionChanged; // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> InPointsChanged; // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> InErrorChanged; // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_AddNodeDelegates;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.AddTierToGrid
// 0x0030 (0x0030 - 0x0000)
struct WBP_Loadout_TechTree_C_AddTierToGrid final
{
public:
	int32                                         InTier;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Loadout_TechTree_Tier_C*           TierWidget;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Loadout_TechTree_Tier_C*           Loc_TierWidget;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Loadout_TechTree_Tier_C*           CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_AddTierToGrid;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.BindToNodeClicked
// 0x0018 (0x0018 - 0x0000)
struct WBP_Loadout_TechTree_C_BindToNodeClicked final
{
public:
	class UWBP_Loadout_TechTree_Tier_C*           InTier;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVM_TechTree_Node_C* Node)> InNodeClickedDelegate;                          // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_BindToNodeClicked;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.BndEvt__WBP_Loadout_TechTree_WBP_Button_Text_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Loadout_TechTree_C_BndEvt__WBP_Loadout_TechTree_WBP_Button_Text_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_BndEvt__WBP_Loadout_TechTree_WBP_Button_Text_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.ExecuteUbergraph_WBP_Loadout_TechTree
// 0x0148 (0x0148 - 0x0000)
struct WBP_Loadout_TechTree_C_ExecuteUbergraph_WBP_Loadout_TechTree final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId;             // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_1;           // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_2;           // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_3;           // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_4;           // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_5;           // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_6;           // 0x0044(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_7;           // 0x004C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UVM_TechTree_Node_C*                    K2Node_CustomEvent_NodeViewModel;                  // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Loadout_TechTree_Tier_C*           K2Node_DynamicCast_AsWBP_Loadout_Tech_Tree_Tier;   // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_8;           // 0x008C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate; // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object_2;                       // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_CustomEvent_Field_2;                        // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object_1;                       // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_CustomEvent_Field_1;                        // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate_1; // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_9;           // 0x00D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_10;          // 0x00E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_11;          // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_12;          // 0x00F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_13;          // 0x00F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_CustomEvent_Field;                          // 0x0108(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_14;          // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array;                            // 0x0128(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue; // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_ExecuteUbergraph_WBP_Loadout_TechTree;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.On Node Selected
// 0x0008 (0x0008 - 0x0000)
struct WBP_Loadout_TechTree_C_On_Node_Selected final
{
public:
	class UVM_TechTree_Node_C*                    NodeViewModel;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_On_Node_Selected;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.On Selected Node Description Changed
// 0x0010 (0x0010 - 0x0000)
struct WBP_Loadout_TechTree_C_On_Selected_Node_Description_Changed final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   Field;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_On_Selected_Node_Description_Changed;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.On Selected Node Error Changed
// 0x0010 (0x0010 - 0x0000)
struct WBP_Loadout_TechTree_C_On_Selected_Node_Error_Changed final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   Field;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_On_Selected_Node_Error_Changed;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.On Selected Node Points Changed
// 0x0010 (0x0010 - 0x0000)
struct WBP_Loadout_TechTree_C_On_Selected_Node_Points_Changed final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   Field;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_On_Selected_Node_Points_Changed;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Loadout_TechTree_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_PreConstruct;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.RemoveNodeDelegates
// 0x0040 (0x0040 - 0x0000)
struct WBP_Loadout_TechTree_C_RemoveNodeDelegates final
{
public:
	class UVM_TechTree_Node_C*                    InNode;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> InDescriptionChanged; // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> InPointsChanged; // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> InErrorChanged; // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_RemoveNodeDelegates;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.SetupTechTree
// 0x0030 (0x0030 - 0x0000)
struct WBP_Loadout_TechTree_C_SetupTechTree final
{
public:
	class UVM_Vehicle_Loadout_C*                  InLoadoutViewModel;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_C*                          InVehicleViewModel;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVM_TechTree_Tier_C*                    CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_SetupTechTree;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.SetupTechTreeTier
// 0x0060 (0x0060 - 0x0000)
struct WBP_Loadout_TechTree_C_SetupTechTreeTier final
{
public:
	class UVM_TechTree_Tier_C*                    InTierViewModel;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         InTier;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Loadout_TechTree_Tier_C*           CallFunc_AddTierToGrid_TierWidget;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UVM_TechTree_Node_C* Node)> K2Node_CreateDelegate_OutputDelegate;           // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVM_TechTree_Node_C* Node)> K2Node_CreateDelegate_OutputDelegate_1;         // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Loadout_TechTree_Tier_C*           K2Node_DynamicCast_AsWBP_Loadout_Tech_Tree_Tier;   // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_SetupTechTreeTier;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.SetVM_TechTree
// 0x0028 (0x0028 - 0x0000)
struct WBP_Loadout_TechTree_C_SetVM_TechTree final
{
public:
	class UVM_TechTree_C*                         ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_SetVM_TechTree;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.SetVM_Vehicle
// 0x0028 (0x0028 - 0x0000)
struct WBP_Loadout_TechTree_C_SetVM_Vehicle final
{
public:
	class UVM_Vehicle_C*                          ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_SetVM_Vehicle;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.SetVM_Vehicle_Loadout
// 0x0028 (0x0028 - 0x0000)
struct WBP_Loadout_TechTree_C_SetVM_Vehicle_Loadout final
{
public:
	class UVM_Vehicle_Loadout_C*                  ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_SetVM_Vehicle_Loadout;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.__1c0c957f-400b-fabd-675d-9292e5b4223b_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Loadout_TechTree_C___1c0c957f_400b_fabd_675d_9292e5b4223b_SourceToDest final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C___1c0c957f_400b_fabd_675d_9292e5b4223b_SourceToDest;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.__50eb541b-46a2-534f-f32f-018d6542b274_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_Loadout_TechTree_C___50eb541b_46a2_534f_f32f_018d6542b274_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelectedNodePointsRequiredVisibility_bIsTierUnlocked; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C___50eb541b_46a2_534f_f32f_018d6542b274_SourceToDest;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.__63403f16-4bc4-2256-a732-d48fff40dcda_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_Loadout_TechTree_C___63403f16_4bc4_2256_a732_d48fff40dcda_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLMBVisibility_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C___63403f16_4bc4_2256_a732_d48fff40dcda_SourceToDest;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.__63751708-40a4-138d-acc1-2dae64e015b5_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_Loadout_TechTree_C___63751708_40a4_138d_acc1_2dae64e015b5_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelectedNodePointsVisibility_bIsKeystone; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C___63751708_40a4_138d_acc1_2dae64e015b5_SourceToDest;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.__6b1e5fcd-4bf9-5b46-3e41-328eb5a11d25_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_Loadout_TechTree_C___6b1e5fcd_4bf9_5b46_3e41_328eb5a11d25_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActiveTextVisibility_ReturnValue;      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C___6b1e5fcd_4bf9_5b46_3e41_328eb5a11d25_SourceToDest;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.__af28037f-4954-cce9-0360-92946f940dcd_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Loadout_TechTree_C___af28037f_4954_cce9_0360_92946f940dcd_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C___af28037f_4954_cce9_0360_92946f940dcd_SourceToDest;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.__badb4a83-4780-b2c6-00f9-2fb3331485a1_SourceToDest
// 0x0008 (0x0008 - 0x0000)
struct WBP_Loadout_TechTree_C___badb4a83_4780_b2c6_00f9_2fb3331485a1_SourceToDest final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C___badb4a83_4780_b2c6_00f9_2fb3331485a1_SourceToDest;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.__bc124c9b-4db0-514c-0297-ccb012295265_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_Loadout_TechTree_C___bc124c9b_4db0_514c_0297_ccb012295265_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSelectedNode_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C___bc124c9b_4db0_514c_0297_ccb012295265_SourceToDest;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.__c28e06af-42bd-0c00-8515-f780957bf75e_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_Loadout_TechTree_C___c28e06af_42bd_0c00_8515_f780957bf75e_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRMBVisibility_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C___c28e06af_42bd_0c00_8515_f780957bf75e_SourceToDest;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_Loadout_TechTree_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_BP_GetDesiredFocusTarget;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.GetActiveTextVisibility
// 0x0004 (0x0004 - 0x0000)
struct WBP_Loadout_TechTree_C_GetActiveTextVisibility final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelectedNodeActive_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_GetActiveTextVisibility;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.GetLMBVisibility
// 0x0003 (0x0003 - 0x0000)
struct WBP_Loadout_TechTree_C_GetLMBVisibility final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMaxPoints_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_GetLMBVisibility;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.GetRMBVisibility
// 0x0003 (0x0003 - 0x0000)
struct WBP_Loadout_TechTree_C_GetRMBVisibility final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyPoints_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_GetRMBVisibility;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.GetSelectedNodeDescriptionText
// 0x0018 (0x0018 - 0x0000)
struct WBP_Loadout_TechTree_C_GetSelectedNodeDescriptionText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_GetSelectedNodeDescriptionText;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.GetSelectedNodePointsRequiredText
// 0x0018 (0x0018 - 0x0000)
struct WBP_Loadout_TechTree_C_GetSelectedNodePointsRequiredText final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0010)(Parm, OutParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_GetSelectedNodePointsRequiredText;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.GetSelectedNodePointsRequiredVisibility
// 0x0004 (0x0004 - 0x0000)
struct WBP_Loadout_TechTree_C_GetSelectedNodePointsRequiredVisibility final
{
public:
	bool                                          bIsTierUnlocked;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_GetSelectedNodePointsRequiredVisibility;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.GetSelectedNodePointsText
// 0x0130 (0x0130 - 0x0000)
struct WBP_Loadout_TechTree_C_GetSelectedNodePointsText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0010)()
	bool                                          CallFunc_IsSelectedNodeActive_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0030(0x0010)()
	bool                                          Temp_bool_Variable_1;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0048(0x0010)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0110(0x0010)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0120(0x0010)()
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_GetSelectedNodePointsText;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.GetSelectedNodePointsTextColor
// 0x0070 (0x0070 - 0x0000)
struct WBP_Loadout_TechTree_C_GetSelectedNodePointsTextColor final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0034(0x0014)()
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMaxPoints_ReturnValue;                 // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x005C(0x0014)()
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_GetSelectedNodePointsTextColor;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.GetSelectedNodePointsVisibility
// 0x0002 (0x0002 - 0x0000)
struct WBP_Loadout_TechTree_C_GetSelectedNodePointsVisibility final
{
public:
	bool                                          bIsKeystone;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_GetSelectedNodePointsVisibility;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.GetSelectedNodeRequirementText
// 0x0018 (0x0018 - 0x0000)
struct WBP_Loadout_TechTree_C_GetSelectedNodeRequirementText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_GetSelectedNodeRequirementText;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.GetSelectedNodeSupplementalDescriptionText
// 0x0018 (0x0018 - 0x0000)
struct WBP_Loadout_TechTree_C_GetSelectedNodeSupplementalDescriptionText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_GetSelectedNodeSupplementalDescriptionText;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.GetSelectedNodeSupplementalDescriptionVisibility
// 0x0007 (0x0007 - 0x0000)
struct WBP_Loadout_TechTree_C_GetSelectedNodeSupplementalDescriptionVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSupplementalDescription_ReturnValue;   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_GetSelectedNodeSupplementalDescriptionVisibility;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.GetSelectedNodeTitleText
// 0x0018 (0x0018 - 0x0000)
struct WBP_Loadout_TechTree_C_GetSelectedNodeTitleText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_GetSelectedNodeTitleText;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.HasSelectedNode
// 0x0002 (0x0002 - 0x0000)
struct WBP_Loadout_TechTree_C_HasSelectedNode final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_HasSelectedNode;

// Function WBP_Loadout_TechTree.WBP_Loadout_TechTree_C.IsSelectedNodeActive
// 0x0003 (0x0003 - 0x0000)
struct WBP_Loadout_TechTree_C_IsSelectedNodeActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyPoints_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_C_IsSelectedNodeActive;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
