#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleHistory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_BattleHistory.WBP_BattleHistory_C
// 0x0068 (0x0590 - 0x0528)
class UWBP_BattleHistory_C final : public UTyrActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OuterGlow2;                                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OuterGlow1;                                        // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonListView*                        Battles_ListView;                                  // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVM_Battles_C*                          VM_Battles;                                        // 0x0558(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVM_Replays_C*                          VM_Replays;                                        // 0x0560(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVM_Matchmaking_C*                      VM_Matchmaking;                                    // 0x0568(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             UnclaimedMatches_Title;                            // 0x0570(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                UnclaimedMatchesCount;                             // 0x0578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             NumUnclaimed_Text;                                 // 0x0580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReplayMetadataSuspendInputToken;                   // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AfterPush_5D2DD8D94E5CA73140D03EAA5EF2AFDE(class UCommonActivatableWidget* UserWidget);
	void AfterPush_5EC410B745EDDF954BA136A28C4CC5C7(class UCommonActivatableWidget* UserWidget);
	void BeforePush_5D2DD8D94E5CA73140D03EAA5EF2AFDE(class UCommonActivatableWidget* UserWidget);
	void BeforePush_5EC410B745EDDF954BA136A28C4CC5C7(class UCommonActivatableWidget* UserWidget);
	void BndEvt__WBP_BattleHistory_Battles_ListView_K2Node_ComponentBoundEvent_2_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BP_OnActivated();
	bool BP_OnHandleBackAction();
	void Construct();
	void CreateOldReplayDialogDescriptor(class UTyrGameDialogDescriptor** NewParam);
	void ExecuteUbergraph_WBP_BattleHistory(int32 EntryPoint);
	void InputAction_DT_InputActions_Battles_ClaimBattleRewards_Clicked();
	void InputAction_DT_InputActions_Battles_PlayReplay_Clicked();
	void InputAction_DT_UniversalAction_OpenEscMenuHidden_Clicked();
	void OnGetMetadataComplete(const struct FReplayMetadata& MetaData, bool bSuccess);
	void OnMatchmakingOrPartyChanged(class UObject* Object, const struct FFieldNotificationId& Field);
	void OnResult_0E1AB81149F2EC369FF8ADB24D0F7644(ETyrMessagingResult Result);

	int32 __06509d41_416a_0a17_d862_27bf3d84d680_SourceToDest() const;
	struct FTyrInputActionLabelParam __066d89a6_4ef9_6319_3ad5_5d9ac4f398fc_SourceToDest() const;
	class FText __58657b7b_438e_6223_fdfb_3d84a1c64814_SourceToDest() const;
	struct FTyrInputActionLabelParam __6046e0e3_4eb1_9699_9802_4db9e173e647_SourceToDest() const;
	struct FTyrInputActionEnableParam __6c413bda_46d6_df8c_7db7_7ebe05655591_SourceToDest() const;
	ESlateVisibility __78f04778_49c3_a09b_7462_699066067b43_SourceToDest() const;
	struct FTyrInputActionEnableParam __8e8977c9_4168_01d5_8ec7_1ead17e10a93_SourceToDest() const;
	struct FTyrInputActionListenParam __ba5bfd9f_41b3_13c9_6d58_83858e22dccb_SourceToDest() const;
	struct FTyrInputActionListenParam __ConversionFunction680ba473_c65f_3a4a_af59_f1be8f3506a3() const;
	class UWidget* BP_GetDesiredFocusTarget() const;
	void CanWatchReplay(bool* CanWatchReplay_0) const;
	void GetWatchReplayButtonText(class FText* Text) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_BattleHistory_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_BattleHistory_C")
	}
	static class UWBP_BattleHistory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BattleHistory_C>();
	}
};
DUMPER7_ASSERTS_UWBP_BattleHistory_C;

SDK_NAMESPACE_END
