#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Loadout_TechTreeSlot_Button

#include "Basic.hpp"

#include "Tyr_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Loadout_TechTreeSlot_Button.WBP_Loadout_TechTreeSlot_Button_C.SetVM_TechTree
// 0x0028 (0x0028 - 0x0000)
struct WBP_Loadout_TechTreeSlot_Button_C_SetVM_TechTree final
{
public:
	class UVM_TechTree_C*                         ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTreeSlot_Button_C_SetVM_TechTree;

// Function WBP_Loadout_TechTreeSlot_Button.WBP_Loadout_TechTreeSlot_Button_C.ExecuteUbergraph_WBP_Loadout_TechTreeSlot_Button
// 0x0004 (0x0004 - 0x0000)
struct WBP_Loadout_TechTreeSlot_Button_C_ExecuteUbergraph_WBP_Loadout_TechTreeSlot_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTreeSlot_Button_C_ExecuteUbergraph_WBP_Loadout_TechTreeSlot_Button;

// Function WBP_Loadout_TechTreeSlot_Button.WBP_Loadout_TechTreeSlot_Button_C.__a33e7cc1-45af-073c-1077-eebb96ba4aeb_SourceToDest
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_Loadout_TechTreeSlot_Button_C___a33e7cc1_45af_073c_1077_eebb96ba4aeb_SourceToDest final
{
public:
	struct FTyrMaterialTextureParam               ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetActiveKeystoneIcon_Icon;               // 0x0060(0x0028)(HasGetValueTypeHash)
	struct FTyrMaterialTextureParam               CallFunc_ToTextureMaterialParam__Texture__ReturnValue; // 0x0088(0x0060)()
};
DUMPER7_ASSERTS_WBP_Loadout_TechTreeSlot_Button_C___a33e7cc1_45af_073c_1077_eebb96ba4aeb_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
