#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ClaimBattle_Stats

#include "Basic.hpp"

#include "UMG_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_ClaimBattle_Stats.WBP_ClaimBattle_Stats_C.SetVM_Battle
// 0x0028 (0x0028 - 0x0000)
struct WBP_ClaimBattle_Stats_C_SetVM_Battle final
{
public:
	class UVM_Battle_C*                           ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimBattle_Stats_C_SetVM_Battle;

// Function WBP_ClaimBattle_Stats.WBP_ClaimBattle_Stats_C.__26f91eee-4a2f-bcdd-0614-4fb6ef0debbe_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_ClaimBattle_Stats_C___26f91eee_4a2f_bcdd_0614_4fb6ef0debbe_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVictory_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimBattle_Stats_C___26f91eee_4a2f_bcdd_0614_4fb6ef0debbe_SourceToDest;

// Function WBP_ClaimBattle_Stats.WBP_ClaimBattle_Stats_C.__2f32c9ad-4fb4-5c31-5059-7d9efaffc84f_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_ClaimBattle_Stats_C___2f32c9ad_4fb4_5c31_5059_7d9efaffc84f_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DidAnyAssistDamage_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimBattle_Stats_C___2f32c9ad_4fb4_5c31_5059_7d9efaffc84f_SourceToDest;

// Function WBP_ClaimBattle_Stats.WBP_ClaimBattle_Stats_C.__406f82b2-49d0-f7c3-5667-a8b2a195ffaf_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_ClaimBattle_Stats_C___406f82b2_49d0_f7c3_5667_a8b2a195ffaf_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimBattle_Stats_C___406f82b2_49d0_f7c3_5667_a8b2a195ffaf_SourceToDest;

// Function WBP_ClaimBattle_Stats.WBP_ClaimBattle_Stats_C.__45d07eab-402e-2a83-5678-b7b1f4432c70_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_ClaimBattle_Stats_C___45d07eab_402e_2a83_5678_b7b1f4432c70_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVictory_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimBattle_Stats_C___45d07eab_402e_2a83_5678_b7b1f4432c70_SourceToDest;

// Function WBP_ClaimBattle_Stats.WBP_ClaimBattle_Stats_C.__813198b9-44e1-b171-045f-7fbde37dc3de_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_ClaimBattle_Stats_C___813198b9_44e1_b171_045f_7fbde37dc3de_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimBattle_Stats_C___813198b9_44e1_b171_045f_7fbde37dc3de_SourceToDest;

// Function WBP_ClaimBattle_Stats.WBP_ClaimBattle_Stats_C.__cd54d711-4062-55fb-8b6b-b89e2085ae75_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_ClaimBattle_Stats_C___cd54d711_4062_55fb_8b6b_b89e2085ae75_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DidAnyAssistDamage_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimBattle_Stats_C___cd54d711_4062_55fb_8b6b_b89e2085ae75_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
