#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Horizontal_Tabs_UniformWidth

#include "Basic.hpp"

#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Horizontal_Tabs_UniformWidth.WBP_Horizontal_Tabs_UniformWidth_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Horizontal_Tabs_UniformWidth_C_PreConstruct final
{
public:
	bool                                          IsDesignTime_PreConstruct;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Horizontal_Tabs_UniformWidth_C_PreConstruct;

// Function WBP_Horizontal_Tabs_UniformWidth.WBP_Horizontal_Tabs_UniformWidth_C.HandleTabCreation
// 0x0010 (0x0010 - 0x0000)
struct WBP_Horizontal_Tabs_UniformWidth_C_HandleTabCreation final
{
public:
	class FName                                   TabNameID_HandleTabCreation;                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      TabButton_HandleTabCreation;                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Horizontal_Tabs_UniformWidth_C_HandleTabCreation;

// Function WBP_Horizontal_Tabs_UniformWidth.WBP_Horizontal_Tabs_UniformWidth_C.ExecuteUbergraph_WBP_Horizontal_Tabs_UniformWidth
// 0x0038 (0x0038 - 0x0000)
struct WBP_Horizontal_Tabs_UniformWidth_C_ExecuteUbergraph_WBP_Horizontal_Tabs_UniformWidth final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_TabNameID;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_Event_TabButton;                            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetButtonIndexForID_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrButtonBase*                         CallFunc_CreatePreviewTab_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Horizontal_Tabs_UniformWidth_C_ExecuteUbergraph_WBP_Horizontal_Tabs_UniformWidth;

// Function WBP_Horizontal_Tabs_UniformWidth.WBP_Horizontal_Tabs_UniformWidth_C.CreatePreviewTab
// 0x0038 (0x0038 - 0x0000)
struct WBP_Horizontal_Tabs_UniformWidth_C_CreatePreviewTab final
{
public:
	class UTyrButtonBase*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    Temp_struct_Variable;                              // 0x0010(0x0010)(ConstParm, NoDestructor)
	struct FDataTableRowHandle                    Temp_struct_Variable_1;                            // 0x0020(0x0010)(ConstParm, NoDestructor)
	class UTyrButtonBase*                         CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Horizontal_Tabs_UniformWidth_C_CreatePreviewTab;

// Function WBP_Horizontal_Tabs_UniformWidth.WBP_Horizontal_Tabs_UniformWidth_C.AddTabToPanel
// 0x0018 (0x0018 - 0x0000)
struct WBP_Horizontal_Tabs_UniformWidth_C_AddTabToPanel final
{
public:
	class UWidget*                                InTab;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         InColumn;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Horizontal_Tabs_UniformWidth_C_AddTabToPanel;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
