#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Loadout_Slots

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Loadout_Slots.WBP_Loadout_Slots_C.AddButtonForLoadoutSlot
// 0x0020 (0x0020 - 0x0000)
struct WBP_Loadout_Slots_C_AddButtonForLoadoutSlot final
{
public:
	class UVM_Vehicle_Loadout_C*                  InLoadoutViewModel;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_BP_CreateEntry_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Loadout_SlotButton_C*              K2Node_DynamicCast_AsWBP_Loadout_Slot_Button;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_Slots_C_AddButtonForLoadoutSlot;

// Function WBP_Loadout_Slots.WBP_Loadout_Slots_C.ExecuteUbergraph_WBP_Loadout_Slots
// 0x0010 (0x0010 - 0x0000)
struct WBP_Loadout_Slots_C_ExecuteUbergraph_WBP_Loadout_Slots final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_Event_SlotButton;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_Slots_C_ExecuteUbergraph_WBP_Loadout_Slots;

// Function WBP_Loadout_Slots.WBP_Loadout_Slots_C.OnRemoveSlotButton
// 0x0008 (0x0008 - 0x0000)
struct WBP_Loadout_Slots_C_OnRemoveSlotButton final
{
public:
	class UCommonButtonBase*                      SlotButton;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_Slots_C_OnRemoveSlotButton;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
