#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Clan_JoinOrCreate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Clan_JoinOrCreate.WBP_Clan_JoinOrCreate_C
// 0x0048 (0x0570 - 0x0528)
class UWBP_Clan_JoinOrCreate_C final : public UTyrActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 OuterGlow2;                                        // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OuterGlow1;                                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Text_C*                     Join_WithCode_Button;                              // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Text_C*                     Join_Auto_Button;                                  // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DiscordInvite_Message_Text;                        // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Text_C*                     Create_Clan_Button;                                // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Text_C*                     ClansInfo_Button;                                  // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVM_Currency_C*                         VM_Currency;                                       // 0x0568(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void AfterPush_73DCED744DBEAE5CEF3083B9D46EB092(class UCommonActivatableWidget* UserWidget);
	void AfterPush_FC69538F4FB0A6702D7CBF86E9123832(class UCommonActivatableWidget* UserWidget);
	void BeforePush_73DCED744DBEAE5CEF3083B9D46EB092(class UCommonActivatableWidget* UserWidget);
	void BeforePush_FC69538F4FB0A6702D7CBF86E9123832(class UCommonActivatableWidget* UserWidget);
	void BndEvt__WBP_Clan_JoinOrCreate_ClansInfo_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Clan_JoinOrCreate_Create_Clan_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Clan_JoinOrCreate_Join_Auto_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Clan_JoinOrCreate_Join_WithCode_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_Clan_JoinOrCreate(int32 EntryPoint);
	void InputAction_DT_InputActions_Clans_ViewClansInfo_Clicked();
	void OnInitialized();
	void RefreshCreateClanButton(int32 InPlayerSoftCurrencyTotal);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Clan_JoinOrCreate_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Clan_JoinOrCreate_C")
	}
	static class UWBP_Clan_JoinOrCreate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Clan_JoinOrCreate_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Clan_JoinOrCreate_C;

SDK_NAMESPACE_END
