#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ClaimBattle_Stats

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_ClaimBattle_Stats.WBP_ClaimBattle_Stats_C
// 0x0050 (0x0390 - 0x0340)
class UWBP_ClaimBattle_Stats_C final : public UUserWidget
{
public:
	class UWBP_CombatStat_C*                      Victory_Multiplier;                                // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CombatStat_C*                      Party_Multiplier;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CombatStat_C*                      DamageDone_Stat;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CombatStat_C*                      DamageAssist_Stat;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVM_Battle_C*                           VM_Battle;                                         // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UImage*                                 Add_Stats;                                         // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Multiply_Victory;                                  // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Multiply_Party;                                    // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             XP_Text;                                           // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             SLVR_Text;                                         // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void SetVM_Battle(class UVM_Battle_C* ViewModel);

	ESlateVisibility __26f91eee_4a2f_bcdd_0614_4fb6ef0debbe_SourceToDest() const;
	ESlateVisibility __2f32c9ad_4fb4_5c31_5059_7d9efaffc84f_SourceToDest() const;
	ESlateVisibility __406f82b2_49d0_f7c3_5667_a8b2a195ffaf_SourceToDest() const;
	ESlateVisibility __45d07eab_402e_2a83_5678_b7b1f4432c70_SourceToDest() const;
	ESlateVisibility __813198b9_44e1_b171_045f_7fbde37dc3de_SourceToDest() const;
	ESlateVisibility __cd54d711_4062_55fb_8b6b_b89e2085ae75_SourceToDest() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ClaimBattle_Stats_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ClaimBattle_Stats_C")
	}
	static class UWBP_ClaimBattle_Stats_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ClaimBattle_Stats_C>();
	}
};
DUMPER7_ASSERTS_UWBP_ClaimBattle_Stats_C;

SDK_NAMESPACE_END
