#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Old_Replay_ConfirmationDialog

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Old_Replay_ConfirmationDialog.WBP_Old_Replay_ConfirmationDialog_C.ExecuteUbergraph_WBP_Old_Replay_ConfirmationDialog
// 0x0050 (0x0050 - 0x0000)
struct WBP_Old_Replay_ConfirmationDialog_C_ExecuteUbergraph_WBP_Old_Replay_ConfirmationDialog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTyrSettingsShared*                     CallFunc_GetLocalSharedSettings_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrSettingsShared*                     CallFunc_GetLocalSharedSettings_ReturnValue_1;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0028(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x003C(0x0014)()
};
DUMPER7_ASSERTS_WBP_Old_Replay_ConfirmationDialog_C_ExecuteUbergraph_WBP_Old_Replay_ConfirmationDialog;

// Function WBP_Old_Replay_ConfirmationDialog.WBP_Old_Replay_ConfirmationDialog_C.BndEvt__WBP_Old_Replay_ConfirmationDialog_Btn_DoNotShow_1_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Old_Replay_ConfirmationDialog_C_BndEvt__WBP_Old_Replay_ConfirmationDialog_Btn_DoNotShow_1_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Old_Replay_ConfirmationDialog_C_BndEvt__WBP_Old_Replay_ConfirmationDialog_Btn_DoNotShow_1_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
