#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Filter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Filter.WBP_Filter_C
// 0x0040 (0x0380 - 0x0340)
class UWBP_Filter_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         Options_Box;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVM_Selector_Option_C*                  VM_FilterOption;                                   // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_77;                                // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon_Image;                                        // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnOptionSelected;                                  // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UCommonButtonGroupBase*                 ButtonGroup;                                       // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetVM_FilterOption(class UVM_Selector_Option_C* ViewModel);
	void SetFilterOptions(TArray<class UVM_Selector_Option_C*>& InOptions);
	void SelectOption(class UVM_Selector_Option_C* InFilterOption);
	void PreConstruct(bool IsDesignTime_PreConstruct);
	void OnOptionButtonSelected(class UVM_Selector_Option_C* Option);
	void OnInitialized();
	class UWBP_Button_Selector_Option_C* GetOptionButton(int32 InIndex);
	void ExecuteUbergraph_WBP_Filter(int32 EntryPoint);
	void AddOptionButtonToSelectionGroup(const class UCommonButtonBase* InButton);
	class UWBP_Button_Selector_Option_C* AddOptionButton();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Filter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Filter_C")
	}
	static class UWBP_Filter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Filter_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Filter_C;

SDK_NAMESPACE_END
