#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Lobby_Loadout_SlotDetail_LockableSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Lobby_Loadout_SlotDetail_LockableSlot.WBP_Lobby_Loadout_SlotDetail_LockableSlot_C.SetLockableSlotViewModel
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Loadout_SlotDetail_LockableSlot_C_SetLockableSlotViewModel final
{
public:
	class UVM_Vehicle_Loadout_LockableSlot_C*     InViewModel;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_SlotDetail_LockableSlot_C_SetLockableSlotViewModel;

// Function WBP_Lobby_Loadout_SlotDetail_LockableSlot.WBP_Lobby_Loadout_SlotDetail_LockableSlot_C.UpdateForLockedSlot
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_Lobby_Loadout_SlotDetail_LockableSlot_C_UpdateForLockedSlot final
{
public:
	class UVM_Vehicle_Loadout_LockableSlot_C*     InLockableSlot;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   InPilotName;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bLoc_IsUnlocked;                                   // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0068(0x0010)()
	class FText                                   CallFunc_GetUnlockLevelText_ReturnValue;           // 0x0078(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0010)()
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_SlotDetail_LockableSlot_C_UpdateForLockedSlot;

// Function WBP_Lobby_Loadout_SlotDetail_LockableSlot.WBP_Lobby_Loadout_SlotDetail_LockableSlot_C.UpdateForUnlockedSlot
// 0x0030 (0x0030 - 0x0000)
struct WBP_Lobby_Loadout_SlotDetail_LockableSlot_C_UpdateForUnlockedSlot final
{
public:
	class UVM_Vehicle_Loadout_LockableSlot_C*     InLockableSlot;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   InSlotTitle;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InSlotDescription;                                 // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bLoc_IsUnlocked;                                   // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_SlotDetail_LockableSlot_C_UpdateForUnlockedSlot;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
