#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cosmetics_Charm_List

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Cosmetics_Charm_List.WBP_Cosmetics_Charm_List_C.BndEvt__WBP_Cosmetics_Charm_List_Charms_TileView_K2Node_ComponentBoundEvent_2_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cosmetics_Charm_List_C_BndEvt__WBP_Cosmetics_Charm_List_Charms_TileView_K2Node_ComponentBoundEvent_2_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_List_C_BndEvt__WBP_Cosmetics_Charm_List_Charms_TileView_K2Node_ComponentBoundEvent_2_SimpleListItemEventDynamic__DelegateSignature;

// Function WBP_Cosmetics_Charm_List.WBP_Cosmetics_Charm_List_C.BndEvt__WBP_Cosmetics_Charm_List_WBP_Button_Text_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cosmetics_Charm_List_C_BndEvt__WBP_Cosmetics_Charm_List_WBP_Button_Text_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_List_C_BndEvt__WBP_Cosmetics_Charm_List_WBP_Button_Text_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Cosmetics_Charm_List.WBP_Cosmetics_Charm_List_C.ExecuteUbergraph_WBP_Cosmetics_Charm_List
// 0x0038 (0x0038 - 0x0000)
struct WBP_Cosmetics_Charm_List_C_ExecuteUbergraph_WBP_Cosmetics_Charm_List final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x0004(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Cosmetics_Charm_C*                  K2Node_DynamicCast_AsVM_Cosmetics_Charm;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryEquipCharm_bDidEquip;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_List_C_ExecuteUbergraph_WBP_Cosmetics_Charm_List;

// Function WBP_Cosmetics_Charm_List.WBP_Cosmetics_Charm_List_C.SaveAndOrClose
// 0x0010 (0x0010 - 0x0000)
struct WBP_Cosmetics_Charm_List_C_SaveAndOrClose final
{
public:
	class UWBP_Cosmetics_C*                       CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_List_C_SaveAndOrClose;

// Function WBP_Cosmetics_Charm_List.WBP_Cosmetics_Charm_List_C.SetVM_Cosmetics_Vehicle
// 0x0028 (0x0028 - 0x0000)
struct WBP_Cosmetics_Charm_List_C_SetVM_Cosmetics_Vehicle final
{
public:
	class UVM_Cosmetics_Vehicle_C*                ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_List_C_SetVM_Cosmetics_Vehicle;

// Function WBP_Cosmetics_Charm_List.WBP_Cosmetics_Charm_List_C.UpdateConfirmStyleVisibility
// 0x0068 (0x0068 - 0x0000)
struct WBP_Cosmetics_Charm_List_C_UpdateConfirmStyleVisibility final
{
public:
	struct FTyrInputActionListenParam             CallFunc_ToInputActionListenParam_ReturnValue;     // 0x0000(0x0020)(NoDestructor)
	struct FTyrInputActionListenParam             CallFunc_ToInputActionListenParam_ReturnValue_1;   // 0x0020(0x0020)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrInputActionListenParam             CallFunc_ToInputActionListenParam_ReturnValue_2;   // 0x0048(0x0020)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_List_C_UpdateConfirmStyleVisibility;

// Function WBP_Cosmetics_Charm_List.WBP_Cosmetics_Charm_List_C.__18b29822-4c3c-fd8f-2ff8-828b08ad1fa5_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Cosmetics_Charm_List_C___18b29822_4c3c_fd8f_2ff8_828b08ad1fa5_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_List_C___18b29822_4c3c_fd8f_2ff8_828b08ad1fa5_SourceToDest;

// Function WBP_Cosmetics_Charm_List.WBP_Cosmetics_Charm_List_C.__aa4c0a8c-4255-4d0b-30b3-9cbee0cb85a0_SourceToDest
// 0x0010 (0x0010 - 0x0000)
struct WBP_Cosmetics_Charm_List_C___aa4c0a8c_4255_4d0b_30b3_9cbee0cb85a0_SourceToDest final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_List_C___aa4c0a8c_4255_4d0b_30b3_9cbee0cb85a0_SourceToDest;

// Function WBP_Cosmetics_Charm_List.WBP_Cosmetics_Charm_List_C.__ConversionFunction0717c59e-7e31-3026-8477-491540b3dbe2
// 0x0003 (0x0003 - 0x0000)
struct WBP_Cosmetics_Charm_List_C___ConversionFunction0717c59e_7e31_3026_8477_491540b3dbe2 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNotUnequipCharm_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_List_C___ConversionFunction0717c59e_7e31_3026_8477_491540b3dbe2;

// Function WBP_Cosmetics_Charm_List.WBP_Cosmetics_Charm_List_C.__defc4b01-4062-27d2-140c-c69b88491e09_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Cosmetics_Charm_List_C___defc4b01_4062_27d2_140c_c69b88491e09_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_List_C___defc4b01_4062_27d2_140c_c69b88491e09_SourceToDest;

// Function WBP_Cosmetics_Charm_List.WBP_Cosmetics_Charm_List_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cosmetics_Charm_List_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Charm_List_C_BP_GetDesiredFocusTarget;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
