#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Loadout_TechTree_KeystoneNode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Loadout_TechTree_KeystoneNode.WBP_Loadout_TechTree_KeystoneNode_C
// 0x0050 (0x15E0 - 0x1590)
class UWBP_Loadout_TechTree_KeystoneNode_C final : public UTyrButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTyrLazyImage*                          Talent_Icon;                                       // 0x1598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnError;                                           // 0x15A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVM_TechTree_Node_C*                    VM_TechTree_Node;                                  // 0x15A8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UImage*                                 Corner_Indicator;                                  // 0x15B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTyrLazyImage*                          BtnShape;                                          // 0x15B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BtnGlow;                                           // 0x15C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UVM_TechTree_Node_C* Node)> OnNodeFocused;                   // 0x15C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnClicked();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_WBP_Loadout_TechTree_KeystoneNode(int32 EntryPoint);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SetupTalentNode(class UVM_TechTree_Node_C* InNodeViewModel, const TDelegate<void(class UVM_TechTree_Node_C* Node)>& InNodeFocusedDelegate);
	void SetVM_TechTree_Node(class UVM_TechTree_Node_C* ViewModel);
	void TryAddPoint();
	void TryRemovePoint();

	ESlateVisibility __09e229d6_4134_df7e_be23_4e9be8ba1915_SourceToDest() const;
	struct FTyrMaterialTextureParam __92b69b8d_4848_d489_74df_7da3ac3be763_SourceToDest() const;
	struct FTyrMaterialScalarParam __f02602e9_4f16_e75a_0923_65a22bce960d_SourceToDest() const;
	ESlateVisibility __f9ceae88_4d11_7d87_d2a0_8799e7235ee9_SourceToDest() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Loadout_TechTree_KeystoneNode_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Loadout_TechTree_KeystoneNode_C")
	}
	static class UWBP_Loadout_TechTree_KeystoneNode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Loadout_TechTree_KeystoneNode_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Loadout_TechTree_KeystoneNode_C;

SDK_NAMESPACE_END
