#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Lobby_MapSelect

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Lobby_MapSelect.WBP_Lobby_MapSelect_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_Lobby_MapSelect_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_MapSelect_C_BP_OnHandleBackAction;

// Function WBP_Lobby_MapSelect.WBP_Lobby_MapSelect_C.ExecuteUbergraph_WBP_Lobby_MapSelect
// 0x0020 (0x0020 - 0x0000)
struct WBP_Lobby_MapSelect_C_ExecuteUbergraph_WBP_Lobby_MapSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Lobby_Map_C*                        K2Node_DynamicCast_AsVM_Lobby_Map;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_MapSelect_C_ExecuteUbergraph_WBP_Lobby_MapSelect;

// Function WBP_Lobby_MapSelect.WBP_Lobby_MapSelect_C.SetLobbyViewModel
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_MapSelect_C_SetLobbyViewModel final
{
public:
	class UVM_Lobby_C*                            InViewModel;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_MapSelect_C_SetLobbyViewModel;

// Function WBP_Lobby_MapSelect.WBP_Lobby_MapSelect_C.SetVM_Lobby
// 0x0028 (0x0028 - 0x0000)
struct WBP_Lobby_MapSelect_C_SetVM_Lobby final
{
public:
	class UVM_Lobby_C*                            ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_MapSelect_C_SetVM_Lobby;

// Function WBP_Lobby_MapSelect.WBP_Lobby_MapSelect_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_MapSelect_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_MapSelect_C_BP_GetDesiredFocusTarget;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
