#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CurrencyBalance

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_CurrencyBalance.WBP_CurrencyBalance_C.ExecuteUbergraph_WBP_CurrencyBalance
// 0x0004 (0x0004 - 0x0000)
struct WBP_CurrencyBalance_C_ExecuteUbergraph_WBP_CurrencyBalance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CurrencyBalance_C_ExecuteUbergraph_WBP_CurrencyBalance;

// Function WBP_CurrencyBalance.WBP_CurrencyBalance_C.OnGetUserMenuContent
// 0x0028 (0x0028 - 0x0000)
struct WBP_CurrencyBalance_C_OnGetUserMenuContent final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)(ConstParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tooltip_C*                         CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CurrencyBalance_C_OnGetUserMenuContent;

// Function WBP_CurrencyBalance.WBP_CurrencyBalance_C.OnGetUserMenuContent_0
// 0x0028 (0x0028 - 0x0000)
struct WBP_CurrencyBalance_C_OnGetUserMenuContent_0 final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)(ConstParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tooltip_C*                         CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CurrencyBalance_C_OnGetUserMenuContent_0;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
