#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Home_PartyListEntry_Empty

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Home_PartyListEntry_Empty.WBP_Home_PartyListEntry_Empty_C
// 0x0030 (0x0370 - 0x0340)
class UWBP_Home_PartyListEntry_Empty_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               PlayerContainer1;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Backing1;                                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnCreation;                                        // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsMe;                                             // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrPartyMember*                        TyrPartyMember;                                    // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void OnListItemObjectSet(class UObject* ListItemObject);
	ESlateVisibility GetSpinnerVisibility();
	ESlateVisibility GetReadyCheckVisibility();
	struct FLinearColor Get_Spinner1_ColorAndOpacity();
	struct FLinearColor Get_Is_Ready_Opacity();
	struct FLinearColor Get_Is_Ready_Color();
	void ExecuteUbergraph_WBP_Home_PartyListEntry_Empty(int32 EntryPoint);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Home_PartyListEntry_Empty_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Home_PartyListEntry_Empty_C")
	}
	static class UWBP_Home_PartyListEntry_Empty_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Home_PartyListEntry_Empty_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Home_PartyListEntry_Empty_C;

SDK_NAMESPACE_END
