#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MinimapIconLayer

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_MinimapIconLayer.WBP_MinimapIconLayer_C.ExecuteUbergraph_WBP_MinimapIconLayer
// 0x0020 (0x0020 - 0x0000)
struct WBP_MinimapIconLayer_C_ExecuteUbergraph_WBP_MinimapIconLayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_MiniMap_C*                         K2Node_DynamicCast_AsWBP_Mini_Map;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bExpanded;                            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MinimapIconLayer_C_ExecuteUbergraph_WBP_MinimapIconLayer;

// Function WBP_MinimapIconLayer.WBP_MinimapIconLayer_C.OnExpandedStateChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_MinimapIconLayer_C_OnExpandedStateChanged final
{
public:
	bool                                          bExpanded;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MinimapIconLayer_C_OnExpandedStateChanged;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
