#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Lobby_JoinCode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Lobby_JoinCode.WBP_Lobby_JoinCode_C
// 0x0030 (0x0370 - 0x0340)
class UWBP_Lobby_JoinCode_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Tooltip_C*                         ToggleCodeVisibility_Tooltip;                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisualAttachment*                ToggleCodeVisibility_Attachment;                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Icon_C*                     Btn_ToggleCodeVisibility;                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Text_C*                     Btn_CopyCode;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVM_Lobby_C*                            VM_Lobby;                                          // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Lobby_JoinCode_Btn_CopyCode_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Lobby_JoinCode_Btn_ToggleCodeVisibility_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Lobby_JoinCode_Btn_ToggleCodeVisibility_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Lobby_JoinCode_Btn_ToggleCodeVisibility_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_Lobby_JoinCode(int32 EntryPoint);
	void SetLobbyViewModel(class UVM_Lobby_C* InViewModel);
	void SetVM_Lobby(class UVM_Lobby_C* ViewModel);

	ESlateVisibility __effb50bb_44bf_4f76_d279_ca853bb87df7_SourceToDest() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Lobby_JoinCode_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Lobby_JoinCode_C")
	}
	static class UWBP_Lobby_JoinCode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Lobby_JoinCode_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Lobby_JoinCode_C;

SDK_NAMESPACE_END
