#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modal_Menu_Options

#include "Basic.hpp"

#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Modal_Menu_Options.WBP_Modal_Menu_Options_C.ExecuteUbergraph_WBP_Modal_Menu_Options
// 0x0020 (0x0020 - 0x0000)
struct WBP_Modal_Menu_Options_C_ExecuteUbergraph_WBP_Modal_Menu_Options final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0008(0x0010)(NoDestructor)
	class UTyrButtonBase*                         K2Node_Event_Button;                               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Modal_Menu_Options_C_ExecuteUbergraph_WBP_Modal_Menu_Options;

// Function WBP_Modal_Menu_Options.WBP_Modal_Menu_Options_C.OnOptionAdded
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modal_Menu_Options_C_OnOptionAdded final
{
public:
	class UTyrButtonBase*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Modal_Menu_Options_C_OnOptionAdded;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
