#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Clan

#include "Basic.hpp"

#include "FieldNotification_structs.hpp"
#include "UMG_structs.hpp"
#include "Tyr_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Clan.WBP_Clan_C.__289f7722-4e1d-d040-c13b-61b208a547f3
// 0x0018 (0x0018 - 0x0000)
struct WBP_Clan_C___289f7722_4e1d_d040_c13b_61b208a547f3 final
{
public:
	class UMVVMSubsystem*                         CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_K2_GetViewFromUserWidget_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreSourcesValidForEvent_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_C___289f7722_4e1d_d040_c13b_61b208a547f3;

// Function WBP_Clan.WBP_Clan_C.AfterPush_0F288AC74E7EB6F44998409C47A84D38
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_C_AfterPush_0F288AC74E7EB6F44998409C47A84D38 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_C_AfterPush_0F288AC74E7EB6F44998409C47A84D38;

// Function WBP_Clan.WBP_Clan_C.AfterPush_2B8B03594666CD0EF7F55392A96B6FE8
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_C_AfterPush_2B8B03594666CD0EF7F55392A96B6FE8 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_C_AfterPush_2B8B03594666CD0EF7F55392A96B6FE8;

// Function WBP_Clan.WBP_Clan_C.BeforePush_0F288AC74E7EB6F44998409C47A84D38
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_C_BeforePush_0F288AC74E7EB6F44998409C47A84D38 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_C_BeforePush_0F288AC74E7EB6F44998409C47A84D38;

// Function WBP_Clan.WBP_Clan_C.BeforePush_2B8B03594666CD0EF7F55392A96B6FE8
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_C_BeforePush_2B8B03594666CD0EF7F55392A96B6FE8 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_C_BeforePush_2B8B03594666CD0EF7F55392A96B6FE8;

// Function WBP_Clan.WBP_Clan_C.BndEvt__WBP_Clan_ClanCode_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_C_BndEvt__WBP_Clan_ClanCode_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_C_BndEvt__WBP_Clan_ClanCode_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Clan.WBP_Clan_C.BndEvt__WBP_Clan_ClanSettings_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_C_BndEvt__WBP_Clan_ClanSettings_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_C_BndEvt__WBP_Clan_ClanSettings_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Clan.WBP_Clan_C.BndEvt__WBP_Clan_ClansInfo_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_C_BndEvt__WBP_Clan_ClansInfo_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_C_BndEvt__WBP_Clan_ClansInfo_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Clan.WBP_Clan_C.ExecuteUbergraph_WBP_Clan
// 0x0150 (0x0150 - 0x0000)
struct WBP_Clan_C_ExecuteUbergraph_WBP_Clan final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Clan_TerritoryScans_Claim_C*       K2Node_DynamicCast_AsWBP_Clan_Territory_Scans_Claim; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bSuccess)>                Temp_delegate_Variable;                            // 0x001C(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_1;                   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate; // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               Temp_object_Variable_1;                            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrAsyncActionPushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_CustomEvent_Field;                          // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate_3; // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_ContentWidget;                  // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Clan_TerritoryScans_ReadyToClaim_C* K2Node_DynamicCast_AsWBP_Clan_Territory_Scans_Ready_to_Claim; // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_2;                   // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_3;                   // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue_1;       // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Clans_C*                            CallFunc_GetClansViewModel_ViewModel;              // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Clans_C*                            CallFunc_GetClansViewModel_ViewModel_1;            // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Clans_C*                            CallFunc_GetClansViewModel_ViewModel_2;            // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrAsyncActionPushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue_1; // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_C_ExecuteUbergraph_WBP_Clan;

// Function WBP_Clan.WBP_Clan_C.InitializeFromViewModel
// 0x0048 (0x0048 - 0x0000)
struct WBP_Clan_C_InitializeFromViewModel final
{
public:
	class UVM_Clan_C*                             InViewModel;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate_1; // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_C_InitializeFromViewModel;

// Function WBP_Clan.WBP_Clan_C.OnReadyToClaimWidgetConstruct
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_C_OnReadyToClaimWidgetConstruct final
{
public:
	class UUserWidget*                            ContentWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_C_OnReadyToClaimWidgetConstruct;

// Function WBP_Clan.WBP_Clan_C.OnUnclaimedScansChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_Clan_C_OnUnclaimedScansChanged final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   Field;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_C_OnUnclaimedScansChanged;

// Function WBP_Clan.WBP_Clan_C.RefreshClaimScansButton
// 0x0090 (0x0090 - 0x0000)
struct WBP_Clan_C_RefreshClaimScansButton final
{
public:
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_1; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_2; // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatCountdownToTime_ReturnValue;        // 0x0008(0x0010)()
	bool                                          CallFunc_HasAnyScansToClaim_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0010)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue_3; // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_C_RefreshClaimScansButton;

// Function WBP_Clan.WBP_Clan_C.RefreshReadyToClaimTrayWidget
// 0x0030 (0x0030 - 0x0000)
struct WBP_Clan_C_RefreshReadyToClaimTrayWidget final
{
public:
	bool                                          CallFunc_IsValidTrayHandle_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUserWidget* ContentWidget)> K2Node_CreateDelegate_OutputDelegate;          // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTyrActionBarTrayHandle                CallFunc_AddContentToTray_ReturnValue;             // 0x0014(0x0018)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyScansToClaim_ReturnValue;           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_C_RefreshReadyToClaimTrayWidget;

// Function WBP_Clan.WBP_Clan_C.SetClanWidgetActive
// 0x0002 (0x0002 - 0x0000)
struct WBP_Clan_C_SetClanWidgetActive final
{
public:
	bool                                          bInIsActive;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_C_SetClanWidgetActive;

// Function WBP_Clan.WBP_Clan_C.SetVM_Clan
// 0x0028 (0x0028 - 0x0000)
struct WBP_Clan_C_SetVM_Clan final
{
public:
	class UVM_Clan_C*                             ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_C_SetVM_Clan;

// Function WBP_Clan.WBP_Clan_C.__09a78331-4d39-7d16-ca31-b095df43b5df_SourceToDest
// 0x0040 (0x0040 - 0x0000)
struct WBP_Clan_C___09a78331_4d39_7d16_ca31_b095df43b5df_SourceToDest final
{
public:
	struct FTyrInputActionListenParam             ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FTyrInputActionListenParam             CallFunc_ToInputActionListenParam_ReturnValue;     // 0x0020(0x0020)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Clan_C___09a78331_4d39_7d16_ca31_b095df43b5df_SourceToDest;

// Function WBP_Clan.WBP_Clan_C.__117e3681-41cf-01a7-9f09-dd87181e06b2_SourceToDest
// 0x0050 (0x0050 - 0x0000)
struct WBP_Clan_C___117e3681_41cf_01a7_9f09_dd87181e06b2_SourceToDest final
{
public:
	struct FTyrInputActionLabelParam              ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm)
	struct FTyrInputActionLabelParam              CallFunc_ToInputActionLabelParam_ReturnValue;      // 0x0028(0x0028)()
};
DUMPER7_ASSERTS_WBP_Clan_C___117e3681_41cf_01a7_9f09_dd87181e06b2_SourceToDest;

// Function WBP_Clan.WBP_Clan_C.__43c373fe-4a18-10be-8acc-c2a2c1d76681_SourceToDest
// 0x0040 (0x0040 - 0x0000)
struct WBP_Clan_C___43c373fe_4a18_10be_8acc_c2a2c1d76681_SourceToDest final
{
public:
	struct FTyrInputActionEnableParam             ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FTyrInputActionEnableParam             CallFunc_ToInputActionEnableParam_ReturnValue;     // 0x0020(0x0020)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Clan_C___43c373fe_4a18_10be_8acc_c2a2c1d76681_SourceToDest;

// Function WBP_Clan.WBP_Clan_C.__46a4b2c5-4a7c-d8d9-96a9-0e806ce56339_SourceToDest
// 0x0048 (0x0048 - 0x0000)
struct WBP_Clan_C___46a4b2c5_4a7c_d8d9_96a9_0e806ce56339_SourceToDest final
{
public:
	struct FTyrInputActionListenParam             ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	bool                                          CallFunc_CanJoinLinkedDiscordServer_ReturnValue;   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrInputActionListenParam             CallFunc_ToInputActionListenParam_ReturnValue;     // 0x0028(0x0020)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Clan_C___46a4b2c5_4a7c_d8d9_96a9_0e806ce56339_SourceToDest;

// Function WBP_Clan.WBP_Clan_C.__b0b9ec36-4ed5-1019-68c3-958c995cc074_SourceToDest
// 0x0048 (0x0048 - 0x0000)
struct WBP_Clan_C___b0b9ec36_4ed5_1019_68c3_958c995cc074_SourceToDest final
{
public:
	struct FTyrInputActionListenParam             ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	bool                                          CallFunc_CanPossiblyClaimScans_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrInputActionListenParam             CallFunc_ToInputActionListenParam_ReturnValue;     // 0x0028(0x0020)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Clan_C___b0b9ec36_4ed5_1019_68c3_958c995cc074_SourceToDest;

// Function WBP_Clan.WBP_Clan_C.__b9b328e1-4d98-3ab8-f24c-f8bceebbc213_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Clan_C___b9b328e1_4d98_3ab8_f24c_f8bceebbc213_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_C___b9b328e1_4d98_3ab8_f24c_f8bceebbc213_SourceToDest;

// Function WBP_Clan.WBP_Clan_C.__fc2f30da-41f1-880c-b49a-bfb7fe8327ce_SourceToDest
// 0x0048 (0x0048 - 0x0000)
struct WBP_Clan_C___fc2f30da_41f1_880c_b49a_bfb7fe8327ce_SourceToDest final
{
public:
	struct FTyrInputActionListenParam             ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	bool                                          CallFunc_CanRelinkDiscordServer_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrInputActionListenParam             CallFunc_ToInputActionListenParam_ReturnValue;     // 0x0028(0x0020)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Clan_C___fc2f30da_41f1_880c_b49a_bfb7fe8327ce_SourceToDest;

// Function WBP_Clan.WBP_Clan_C.__fe82e588-44e0-69a7-5cbd-8fb388dd946f_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Clan_C___fe82e588_44e0_69a7_5cbd_8fb388dd946f_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_C___fe82e588_44e0_69a7_5cbd_8fb388dd946f_SourceToDest;

// Function WBP_Clan.WBP_Clan_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_C_BP_GetDesiredFocusTarget;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
