#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ClaimExperience_UnlockProgress

#include "Basic.hpp"

#include "Tyr_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FieldNotification_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_ClaimExperience_UnlockProgress.WBP_ClaimExperience_UnlockProgress_C.ExecuteUbergraph_WBP_ClaimExperience_UnlockProgress
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_ClaimExperience_UnlockProgress_C_ExecuteUbergraph_WBP_ClaimExperience_UnlockProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x0040(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId;             // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_1;           // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpEaseInOut_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_1;               // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_2;           // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasGainedNonBonusXP_ReturnValue;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimExperience_UnlockProgress_C_ExecuteUbergraph_WBP_ClaimExperience_UnlockProgress;

// Function WBP_ClaimExperience_UnlockProgress.WBP_ClaimExperience_UnlockProgress_C.PlayNextBonusGainAnimation
// 0x0014 (0x0014 - 0x0000)
struct WBP_ClaimExperience_UnlockProgress_C_PlayNextBonusGainAnimation final
{
public:
	bool                                          DidPlayBonusAnimation;                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleNextBonusGain_bDidHandleBonusGain;  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0004(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimExperience_UnlockProgress_C_PlayNextBonusGainAnimation;

// Function WBP_ClaimExperience_UnlockProgress.WBP_ClaimExperience_UnlockProgress_C.SetUnlockViewModel
// 0x0008 (0x0008 - 0x0000)
struct WBP_ClaimExperience_UnlockProgress_C_SetUnlockViewModel final
{
public:
	class UVM_ClaimExperience_VehicleUnlock_C*    InViewModel;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimExperience_UnlockProgress_C_SetUnlockViewModel;

// Function WBP_ClaimExperience_UnlockProgress.WBP_ClaimExperience_UnlockProgress_C.SetVM_ClaimExperience_VehicleUnlock
// 0x0028 (0x0028 - 0x0000)
struct WBP_ClaimExperience_UnlockProgress_C_SetVM_ClaimExperience_VehicleUnlock final
{
public:
	class UVM_ClaimExperience_VehicleUnlock_C*    ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimExperience_UnlockProgress_C_SetVM_ClaimExperience_VehicleUnlock;

// Function WBP_ClaimExperience_UnlockProgress.WBP_ClaimExperience_UnlockProgress_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_ClaimExperience_UnlockProgress_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimExperience_UnlockProgress_C_Tick;

// Function WBP_ClaimExperience_UnlockProgress.WBP_ClaimExperience_UnlockProgress_C.__c3b40209-4e05-7616-bce8-3a8f6ff23293_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_ClaimExperience_UnlockProgress_C___c3b40209_4e05_7616_bce8_3a8f6ff23293_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimExperience_UnlockProgress_C___c3b40209_4e05_7616_bce8_3a8f6ff23293_SourceToDest;

// Function WBP_ClaimExperience_UnlockProgress.WBP_ClaimExperience_UnlockProgress_C.__ConversionFunctiond833d061-2459-3e0f-b947-c8a574e2f642
// 0x0040 (0x0040 - 0x0000)
struct WBP_ClaimExperience_UnlockProgress_C___ConversionFunctiond833d061_2459_3e0f_b947_c8a574e2f642 final
{
public:
	struct FTyrMaterialVectorParam                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FLinearColor                           CallFunc_ResetMaterialOffset_ReturnValue;          // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTyrMaterialVectorParam                CallFunc_ToVectorMaterialParam__LinearColor__ReturnValue; // 0x0028(0x0018)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_ClaimExperience_UnlockProgress_C___ConversionFunctiond833d061_2459_3e0f_b947_c8a574e2f642;

// Function WBP_ClaimExperience_UnlockProgress.WBP_ClaimExperience_UnlockProgress_C.HasHandledBonusGains
// 0x0003 (0x0003 - 0x0000)
struct WBP_ClaimExperience_UnlockProgress_C_HasHandledBonusGains final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyRemainingBonusToHandle_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimExperience_UnlockProgress_C_HasHandledBonusGains;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
