#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Clan_Chat_MessageEntry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Clan_Chat_MessageEntry.WBP_Clan_Chat_MessageEntry_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Clan_Chat_MessageEntry_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Chat_MessageEntry_C_BP_OnItemExpansionChanged;

// Function WBP_Clan_Chat_MessageEntry.WBP_Clan_Chat_MessageEntry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Clan_Chat_MessageEntry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Chat_MessageEntry_C_BP_OnItemSelectionChanged;

// Function WBP_Clan_Chat_MessageEntry.WBP_Clan_Chat_MessageEntry_C.ExecuteUbergraph_WBP_Clan_Chat_MessageEntry
// 0x0030 (0x0030 - 0x0000)
struct WBP_Clan_Chat_MessageEntry_C_ExecuteUbergraph_WBP_Clan_Chat_MessageEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0008(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0010(0x0008)(NoDestructor)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Clan_Chat_Message_C*                K2Node_DynamicCast_AsVM_Clan_Chat_Message;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Chat_MessageEntry_C_ExecuteUbergraph_WBP_Clan_Chat_MessageEntry;

// Function WBP_Clan_Chat_MessageEntry.WBP_Clan_Chat_MessageEntry_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_Chat_MessageEntry_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Clan_Chat_MessageEntry_C_OnAddedToFocusPath;

// Function WBP_Clan_Chat_MessageEntry.WBP_Clan_Chat_MessageEntry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_Chat_MessageEntry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Chat_MessageEntry_C_OnListItemObjectSet;

// Function WBP_Clan_Chat_MessageEntry.WBP_Clan_Chat_MessageEntry_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_Chat_MessageEntry_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Clan_Chat_MessageEntry_C_OnRemovedFromFocusPath;

// Function WBP_Clan_Chat_MessageEntry.WBP_Clan_Chat_MessageEntry_C.SetAvatarIcon
// 0x0010 (0x0010 - 0x0000)
struct WBP_Clan_Chat_MessageEntry_C_SetAvatarIcon final
{
public:
	class UTexture*                               InIconTexture;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Chat_MessageEntry_C_SetAvatarIcon;

// Function WBP_Clan_Chat_MessageEntry.WBP_Clan_Chat_MessageEntry_C.SetVM_Clan_Chat_Message
// 0x0028 (0x0028 - 0x0000)
struct WBP_Clan_Chat_MessageEntry_C_SetVM_Clan_Chat_Message final
{
public:
	class UVM_Clan_Chat_Message_C*                ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Chat_MessageEntry_C_SetVM_Clan_Chat_Message;

// Function WBP_Clan_Chat_MessageEntry.WBP_Clan_Chat_MessageEntry_C.__3ac146a2-4958-19dd-3be7-4fbf59647acc_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Clan_Chat_MessageEntry_C___3ac146a2_4958_19dd_3be7_4fbf59647acc_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Chat_MessageEntry_C___3ac146a2_4958_19dd_3be7_4fbf59647acc_SourceToDest;

// Function WBP_Clan_Chat_MessageEntry.WBP_Clan_Chat_MessageEntry_C.__7f653ef4-4467-d43c-9ed3-a7a4270f6fc5_SourceToDest
// 0x0028 (0x0028 - 0x0000)
struct WBP_Clan_Chat_MessageEntry_C___7f653ef4_4467_d43c_9ed3_a7a4270f6fc5_SourceToDest final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            CallFunc_SelectSlateColor_ReturnValue;             // 0x0014(0x0014)()
};
DUMPER7_ASSERTS_WBP_Clan_Chat_MessageEntry_C___7f653ef4_4467_d43c_9ed3_a7a4270f6fc5_SourceToDest;

// Function WBP_Clan_Chat_MessageEntry.WBP_Clan_Chat_MessageEntry_C.__ConversionFunction3b4d6fef-06b2-3505-b7ef-2ef3be59bc81
// 0x0002 (0x0002 - 0x0000)
struct WBP_Clan_Chat_MessageEntry_C___ConversionFunction3b4d6fef_06b2_3505_b7ef_2ef3be59bc81 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Chat_MessageEntry_C___ConversionFunction3b4d6fef_06b2_3505_b7ef_2ef3be59bc81;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
