#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Selector_Segmented

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Selector_Segmented.WBP_Selector_Segmented_C
// 0x0050 (0x0390 - 0x0340)
class UWBP_Selector_Segmented_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         Options_Box;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Label_Text;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnOptionSelected;                                  // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UCommonButtonGroupBase*                 ButtonGroup;                                       // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   SelectorLabel;                                     // 0x0370(0x0010)(Edit, BlueprintVisible)
	int32                                         PreviewOptions;                                    // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Selector_Option_C*                  SelectedOption;                                    // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetOptions(TArray<class UVM_Selector_Option_C*>& InOptions);
	void SelectOption(class UVM_Selector_Option_C* InFilterOption);
	void PreConstruct(bool IsDesignTime_PreConstruct);
	void OnOptionButtonSelected(class UVM_Selector_Option_C* Option);
	void OnInitialized();
	class UWBP_Button_Selector_Option_C* GetOptionButton(int32 InIndex);
	void ExecuteUbergraph_WBP_Selector_Segmented(int32 EntryPoint);
	void AddOptionButtonToSelectionGroup(const class UCommonButtonBase* InButton);
	class UWBP_Button_Selector_Option_C* AddOptionButton();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Selector_Segmented_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Selector_Segmented_C")
	}
	static class UWBP_Selector_Segmented_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Selector_Segmented_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Selector_Segmented_C;

SDK_NAMESPACE_END
