#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActionButton_Secondary

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_ActionButton_Secondary.WBP_ActionButton_Secondary_C.ExecuteUbergraph_WBP_ActionButton_Secondary
// 0x0040 (0x0040 - 0x0000)
struct WBP_ActionButton_Secondary_C_ExecuteUbergraph_WBP_ActionButton_Secondary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	class FText                                   K2Node_Event_InText;                               // 0x0018(0x0010)(ConstParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0028(0x0014)()
};
DUMPER7_ASSERTS_WBP_ActionButton_Secondary_C_ExecuteUbergraph_WBP_ActionButton_Secondary;

// Function WBP_ActionButton_Secondary.WBP_ActionButton_Secondary_C.UpdateButtonText
// 0x0010 (0x0010 - 0x0000)
struct WBP_ActionButton_Secondary_C_UpdateButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_ActionButton_Secondary_C_UpdateButtonText;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
