#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Lobby_Loadout_Slots

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C
// 0x00B0 (0x0418 - 0x0368)
class UWBP_Lobby_Loadout_Slots_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       SlotAction_Text;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LoadoutSlotName_Text;                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            KeystoneSlot_MenuAnchor;                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Loadout_TechTreeSlot_Button_C*     KeystoneSlot_Button;                               // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Fallback_Button;                                   // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            ComponentSlot2_MenuAnchor;                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Loadout_LockableSlot_Button_C*     ComponentSlot2_Button;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            ComponentSlot1_MenuAnchor;                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Loadout_LockableSlot_Button_C*     ComponentSlot1_Button;                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            ComponentSlot0_MenuAnchor;                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Loadout_LockableSlot_Button_C*     ComponentSlot0_Button;                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            AmmoSlot1_MenuAnchor;                              // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Loadout_LockableSlot_Button_C*     AmmoSlot1_Button;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            AmmoSlot0_MenuAnchor;                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Loadout_LockableSlot_Button_C*     AmmoSlot0_Button;                                  // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_LoadoutSlots_C*             VM_Vehicle_LoadoutSlots;                           // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UBorder*                                Incompatible_Icon;                                 // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_Lobby_Loadout_Overview_C* LoadoutOverviewWidget)> OnLoadoutOverviewCreated; // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UVM_Vehicle_Loadout_C*                  PreviousLoadout;                                   // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AfterPush_57BF47DC4F43659B4181F9BD9F69F6C3(class UCommonActivatableWidget* UserWidget);
	void BeforePush_57BF47DC4F43659B4181F9BD9F69F6C3(class UCommonActivatableWidget* UserWidget);
	void BndEvt__WBP_Lobby_Loadout_Slots_AmmoSlot0_Button_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Lobby_Loadout_Slots_AmmoSlot0_Button_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Lobby_Loadout_Slots_AmmoSlot1_Button_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Lobby_Loadout_Slots_AmmoSlot1_Button_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Lobby_Loadout_Slots_Button_240_K2Node_ComponentBoundEvent_12_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_Lobby_Loadout_Slots_Button_240_K2Node_ComponentBoundEvent_13_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_Lobby_Loadout_Slots_Button_240_K2Node_ComponentBoundEvent_14_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot0_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot0_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot1_Button_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot1_Button_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot2_Button_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot2_Button_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Lobby_Loadout_Slots_KeystoneSlot_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Lobby_Loadout_Slots_KeystoneSlot_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void CreateTooltipForLockableSlot(class UWBP_Loadout_LockableSlot_Button_C* InLockableSlotButton, class UWBP_Tooltip_ItemDetail_C** ToolTipWidget_0);
	void ExecuteUbergraph_WBP_Lobby_Loadout_Slots(int32 EntryPoint);
	void HideTooltipOnUnhover(class UMenuAnchor* InSlotAnchor);
	class UUserWidget* On_AmmoSlot0_MenuAnchor_GetUserMenuContent();
	class UUserWidget* On_AmmoSlot1_MenuAnchor_GetUserMenuContent();
	class UUserWidget* On_ComponentSlot0_MenuAnchor_GetUserMenuContent();
	class UUserWidget* On_ComponentSlot1_MenuAnchor_GetUserMenuContent();
	class UUserWidget* On_ComponentSlot2_MenuAnchor_GetUserMenuContent();
	class UUserWidget* On_KeystoneSlot_MenuAnchor_GetUserMenuContent();
	void On_TechTreeKeystoneChange(class UObject* Object, const struct FFieldNotificationId& Field);
	void OnInitialized();
	void OnLoadoutButtonHovered();
	void OnLoadoutButtonUnhovered();
	void OnSlotButtonClicked(class UCommonButtonBase* Button);
	void PreConstruct(bool IsDesignTime);
	void SetLoadout(class UVM_Vehicle_Loadout_C* InLoadout);
	void SetVM_Vehicle_LoadoutSlots(class UVM_Vehicle_LoadoutSlots_C* ViewModel);
	void ShowTooltipOnHover(class UMenuAnchor* InSlotAnchor);

	ESlateVisibility __88d8538c_4e08_ebe2_ea73_5da9fb81b5e1_SourceToDest() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Lobby_Loadout_Slots_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Lobby_Loadout_Slots_C")
	}
	static class UWBP_Lobby_Loadout_Slots_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Lobby_Loadout_Slots_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Lobby_Loadout_Slots_C;

SDK_NAMESPACE_END
