#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Vehicles

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Vehicles.WBP_Vehicles_C.AfterPush_65DC87A04BC4E4CD2266F0B8D3C59F43
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicles_C_AfterPush_65DC87A04BC4E4CD2266F0B8D3C59F43 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicles_C_AfterPush_65DC87A04BC4E4CD2266F0B8D3C59F43;

// Function WBP_Vehicles.WBP_Vehicles_C.BeforePush_65DC87A04BC4E4CD2266F0B8D3C59F43
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicles_C_BeforePush_65DC87A04BC4E4CD2266F0B8D3C59F43 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicles_C_BeforePush_65DC87A04BC4E4CD2266F0B8D3C59F43;

// Function WBP_Vehicles.WBP_Vehicles_C.BP_OnHandleBackAction
// 0x0018 (0x0018 - 0x0000)
struct WBP_Vehicles_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ReturnToVehicleSelection_bDidReturnToSelection; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Home_C*                            CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleBackAction_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicles_C_BP_OnHandleBackAction;

// Function WBP_Vehicles.WBP_Vehicles_C.ExecuteUbergraph_WBP_Vehicles
// 0x0148 (0x0148 - 0x0000)
struct WBP_Vehicles_C_ExecuteUbergraph_WBP_Vehicles final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Vehicle_Loadouts_C*                 CallFunc_GetLoadoutsViewModel_ViewModel;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVM_Vehicle_C* VehicleViewModel)> K2Node_CreateDelegate_OutputDelegate_1;   // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVM_Vehicle_C* VehicleViewModel)> K2Node_CreateDelegate_OutputDelegate_2;   // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Progression_C*                      CallFunc_GetProgressionViewModel_ViewModel;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_C*                          K2Node_CustomEvent_VehicleViewModel_1;             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectedPilotIndex;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_GetActiveWidget_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Vehicle_Grid_C*                    K2Node_DynamicCast_AsWBP_Vehicle_Grid;             // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrAsyncActionPushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Vehicle_C*                          K2Node_CustomEvent_VehicleViewModel_2;             // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Levels_C*                   CallFunc_GetVehicleMasteryTrack_MasteryTrack;      // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Vehicle_Detail_C*                  CallFunc_BP_AddWidget_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_LoadoutSlots_C*             CallFunc_GetLoadoutSlots_LoadoutViewModel;         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_Event_RootContent;                          // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Vehicle_Grid_C*                    K2Node_DynamicCast_AsWBP_Vehicle_Grid_1;           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UVM_Vehicle_C* VehicleViewModel, int32 SelectedPilotIndex)> K2Node_CreateDelegate_OutputDelegate_3; // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Modal_MenuOptions_C*               CallFunc_PushContentToLayerForPlayer_ReturnValue_1; // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               Temp_object_Variable;                              // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget;                     // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Loadout_C*                         K2Node_DynamicCast_AsWBP_Loadout;                  // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Vehicle_C*                          K2Node_CustomEvent_VehicleViewModel;               // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Cosmetics_C*                        CallFunc_GetCosmeticsViewModel_ViewModel;          // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Cosmetics_C*                       CallFunc_BP_AddWidget_ReturnValue_1;               // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVM_Cosmetics_Vehicle_C*                CallFunc_GetVehicleCosmetics_VehicleCosmetics;     // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVM_Vehicle_C* VehicleViewModel)> K2Node_CreateDelegate_OutputDelegate_5;   // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_1;                   // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicles_C_ExecuteUbergraph_WBP_Vehicles;

// Function WBP_Vehicles.WBP_Vehicles_C.On Vehicle Loadout
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicles_C_On_Vehicle_Loadout final
{
public:
	class UVM_Vehicle_C*                          VehicleViewModel;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicles_C_On_Vehicle_Loadout;

// Function WBP_Vehicles.WBP_Vehicles_C.On Vehicle Overview
// 0x0010 (0x0010 - 0x0000)
struct WBP_Vehicles_C_On_Vehicle_Overview final
{
public:
	class UVM_Vehicle_C*                          VehicleViewModel;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectedPilotIndex;                                // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicles_C_On_Vehicle_Overview;

// Function WBP_Vehicles.WBP_Vehicles_C.On Vehicle Style
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicles_C_On_Vehicle_Style final
{
public:
	class UVM_Vehicle_C*                          VehicleViewModel;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicles_C_On_Vehicle_Style;

// Function WBP_Vehicles.WBP_Vehicles_C.OnVehiclesRootContentInitialized
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicles_C_OnVehiclesRootContentInitialized final
{
public:
	class UCommonActivatableWidget*               RootContent;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicles_C_OnVehiclesRootContentInitialized;

// Function WBP_Vehicles.WBP_Vehicles_C.ReturnToVehicleSelection
// 0x0020 (0x0020 - 0x0000)
struct WBP_Vehicles_C_ReturnToVehicleSelection final
{
public:
	bool                                          bDidReturnToSelection;                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLoc_AlreadyAtVehicleSelection;                    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicles_C_ReturnToVehicleSelection;

// Function WBP_Vehicles.WBP_Vehicles_C.SetVehicleOverviewViewModels
// 0x0030 (0x0030 - 0x0000)
struct WBP_Vehicles_C_SetVehicleOverviewViewModels final
{
public:
	class UWBP_Vehicle_Detail_C*                  InVehicleOverview;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_C*                          InVehicleViewModel;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicles_C*                         CallFunc_GetVehiclesViewModel_ViewModel;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Progression_C*                      CallFunc_GetProgressionViewModel_ViewModel;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Details_C*                  CallFunc_GetVehicleDetails_Value;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Levels_C*                   CallFunc_GetVehicleMasteryTrack_MasteryTrack;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicles_C_SetVehicleOverviewViewModels;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
