#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ContextMenu_OptionButton

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_ContextMenu_OptionButton.WBP_ContextMenu_OptionButton_C.ExecuteUbergraph_WBP_ContextMenu_OptionButton
// 0x0020 (0x0020 - 0x0000)
struct WBP_ContextMenu_OptionButton_C_ExecuteUbergraph_WBP_ContextMenu_OptionButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Event_InIcon;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InText;                               // 0x0010(0x0010)(ConstParm)
};
DUMPER7_ASSERTS_WBP_ContextMenu_OptionButton_C_ExecuteUbergraph_WBP_ContextMenu_OptionButton;

// Function WBP_ContextMenu_OptionButton.WBP_ContextMenu_OptionButton_C.UpdateButtonIcon
// 0x0008 (0x0008 - 0x0000)
struct WBP_ContextMenu_OptionButton_C_UpdateButtonIcon final
{
public:
	class UTexture2D*                             InIcon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ContextMenu_OptionButton_C_UpdateButtonIcon;

// Function WBP_ContextMenu_OptionButton.WBP_ContextMenu_OptionButton_C.UpdateButtonText
// 0x0010 (0x0010 - 0x0000)
struct WBP_ContextMenu_OptionButton_C_UpdateButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_ContextMenu_OptionButton_C_UpdateButtonText;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
