#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cosmetics_VFX_Button

#include "Basic.hpp"

#include "FieldNotification_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C_BP_OnItemExpansionChanged;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C_BP_OnItemSelectionChanged;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.ExecuteUbergraph_WBP_Cosmetics_VFX_Button
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C_ExecuteUbergraph_WBP_Cosmetics_VFX_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId;             // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0028(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0038(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0048(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0058(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_CanEquip_ReturnValue;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_1;           // 0x006C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue; // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_2;           // 0x008C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_3;           // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array_1;                          // 0x00A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue_1; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C_ExecuteUbergraph_WBP_Cosmetics_VFX_Button;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C_OnListItemObjectSet;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.SetVM_Cosmetics_VFX
// 0x0028 (0x0028 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C_SetVM_Cosmetics_VFX final
{
public:
	class UVM_Cosmetics_VFX_C*                    ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C_SetVM_Cosmetics_VFX;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.__1bce5d3f-4ef6-65c9-4b71-e4a0ca5dd4f9_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C___1bce5d3f_4ef6_65c9_4b71_e4a0ca5dd4f9_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_ToCosmeticsForegroundColor_ReturnValue;   // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C___1bce5d3f_4ef6_65c9_4b71_e4a0ca5dd4f9_SourceToDest;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.__2605b33a-4850-a627-4924-16895d286d44_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C___2605b33a_4850_a627_4924_16895d286d44_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorForRarity_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C___2605b33a_4850_a627_4924_16895d286d44_SourceToDest;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.__363e15f7-4455-f246-78b7-3f93caa58411_SourceToDest
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C___363e15f7_4455_f246_78b7_3f93caa58411_SourceToDest final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ToVfxAvailabilityIndex_ReturnValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C___363e15f7_4455_f246_78b7_3f93caa58411_SourceToDest;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.__7e2bfa82-49a1-cc43-da70-498819d69d14_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C___7e2bfa82_49a1_cc43_da70_498819d69d14_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_ToCosmeticsFillBackerColor_ReturnValue;   // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C___7e2bfa82_49a1_cc43_da70_498819d69d14_SourceToDest;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.__ConversionFunction2a1365b6-dbb4-3881-905b-2477702a7354
// 0x0002 (0x0002 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C___ConversionFunction2a1365b6_dbb4_3881_905b_2477702a7354 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C___ConversionFunction2a1365b6_dbb4_3881_905b_2477702a7354;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.__ConversionFunction38e15988-6a79-3652-8571-b69f8c846657
// 0x0002 (0x0002 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C___ConversionFunction38e15988_6a79_3652_8571_b69f8c846657 final
{
public:
	ESlateVisibility                              Visibility_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_ShowForValidRarity_Visibility;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C___ConversionFunction38e15988_6a79_3652_8571_b69f8c846657;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.__ConversionFunction4ea220e8-8871-36dc-adda-9f2bd30211c8
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C___ConversionFunction4ea220e8_8871_36dc_adda_9f2bd30211c8 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorForRarity_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C___ConversionFunction4ea220e8_8871_36dc_adda_9f2bd30211c8;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.__ConversionFunction8ec5456a-b51c-3424-83f8-c1d6e071ceaa
// 0x0002 (0x0002 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C___ConversionFunction8ec5456a_b51c_3424_83f8_c1d6e071ceaa final
{
public:
	ESlateVisibility                              Visibility_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_ShowForValidRarity_Visibility;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C___ConversionFunction8ec5456a_b51c_3424_83f8_c1d6e071ceaa;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.__ConversionFunctionc1a5c1e3-5e28-3f2c-a87c-575d700611b6
// 0x0002 (0x0002 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C___ConversionFunctionc1a5c1e3_5e28_3f2c_a87c_575d700611b6 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C___ConversionFunctionc1a5c1e3_5e28_3f2c_a87c_575d700611b6;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.__ConversionFunctioncc7bb124-af3f-3cdc-8dae-6d70976fbdd3
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C___ConversionFunctioncc7bb124_af3f_3cdc_8dae_6d70976fbdd3 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorForRarity_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C___ConversionFunctioncc7bb124_af3f_3cdc_8dae_6d70976fbdd3;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.__ConversionFunctiond680fbd8-fa07-370e-9751-e39565661a1c
// 0x0018 (0x0018 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C___ConversionFunctiond680fbd8_fa07_370e_9751_e39565661a1c final
{
public:
	struct FTyrMaterialScalarParam                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FTyrMaterialScalarParam                CallFunc_ToScalarMaterialParam__Boolean__ReturnValue; // 0x000C(0x000C)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C___ConversionFunctiond680fbd8_fa07_370e_9751_e39565661a1c;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.__ConversionFunctiond81f1270-e875-3f81-8cfb-370b5d675370
// 0x0002 (0x0002 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C___ConversionFunctiond81f1270_e875_3f81_8cfb_370b5d675370 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C___ConversionFunctiond81f1270_e875_3f81_8cfb_370b5d675370;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.__ConversionFunctionfd8fb600-2feb-3631-8a47-37fac365e5f0
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C___ConversionFunctionfd8fb600_2feb_3631_8a47_37fac365e5f0 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C___ConversionFunctionfd8fb600_2feb_3631_8a47_37fac365e5f0;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.__f4372d23-4eb1-56ed-1b17-01bddf1aaf78_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C___f4372d23_4eb1_56ed_1b17_01bddf1aaf78_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorForRarity_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C___f4372d23_4eb1_56ed_1b17_01bddf1aaf78_SourceToDest;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.__fcbd62bb-488a-26c9-73e6-2ab11b34c666_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C___fcbd62bb_488a_26c9_73e6_2ab11b34c666_SourceToDest final
{
public:
	ESlateVisibility                              Visibility_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_ShowForValidRarity_Visibility;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C___fcbd62bb_488a_26c9_73e6_2ab11b34c666_SourceToDest;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.ToVfxAvailabilityIndex
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cosmetics_VFX_Button_C_ToVfxAvailabilityIndex final
{
public:
	bool                                          bInEquipped;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInOwned;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInCanPurchase;                                    // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C_ToVfxAvailabilityIndex;

// Function WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C.ToVfxInfoIndex
// 0x001C (0x001C - 0x0000)
struct WBP_Cosmetics_VFX_Button_C_ToVfxInfoIndex final
{
public:
	struct FGameplayTag                           InCharmTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_VFX_Button_C_ToVfxInfoIndex;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
