#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Clan_Member_Entry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Clan_Member_Entry.WBP_Clan_Member_Entry_C.BndEvt__WBP_Clan_Member_Entry_ClanMember_ContextMenuAnchor_K2Node_ComponentBoundEvent_0_OnShowContextMenu__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_Member_Entry_C_BndEvt__WBP_Clan_Member_Entry_ClanMember_ContextMenuAnchor_K2Node_ComponentBoundEvent_0_OnShowContextMenu__DelegateSignature final
{
public:
	class UTyrContextMenuWidget*                  MenuWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Member_Entry_C_BndEvt__WBP_Clan_Member_Entry_ClanMember_ContextMenuAnchor_K2Node_ComponentBoundEvent_0_OnShowContextMenu__DelegateSignature;

// Function WBP_Clan_Member_Entry.WBP_Clan_Member_Entry_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Clan_Member_Entry_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Member_Entry_C_BP_OnItemExpansionChanged;

// Function WBP_Clan_Member_Entry.WBP_Clan_Member_Entry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Clan_Member_Entry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Member_Entry_C_BP_OnItemSelectionChanged;

// Function WBP_Clan_Member_Entry.WBP_Clan_Member_Entry_C.ExecuteUbergraph_WBP_Clan_Member_Entry
// 0x0028 (0x0028 - 0x0000)
struct WBP_Clan_Member_Entry_C_ExecuteUbergraph_WBP_Clan_Member_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrContextMenuWidget*                  K2Node_ComponentBoundEvent_MenuWidget;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0018(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0020(0x0008)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Clan_Member_Entry_C_ExecuteUbergraph_WBP_Clan_Member_Entry;

// Function WBP_Clan_Member_Entry.WBP_Clan_Member_Entry_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_Member_Entry_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Clan_Member_Entry_C_OnAddedToFocusPath;

// Function WBP_Clan_Member_Entry.WBP_Clan_Member_Entry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_Member_Entry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Member_Entry_C_OnListItemObjectSet;

// Function WBP_Clan_Member_Entry.WBP_Clan_Member_Entry_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_Member_Entry_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Clan_Member_Entry_C_OnRemovedFromFocusPath;

// Function WBP_Clan_Member_Entry.WBP_Clan_Member_Entry_C.SetVM_Clan_Member
// 0x0028 (0x0028 - 0x0000)
struct WBP_Clan_Member_Entry_C_SetVM_Clan_Member final
{
public:
	class UVM_Clan_Member_C*                      ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Member_Entry_C_SetVM_Clan_Member;

// Function WBP_Clan_Member_Entry.WBP_Clan_Member_Entry_C.__402806d4-4bed-e246-86cc-a2bada6ed277_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Clan_Member_Entry_C___402806d4_4bed_e246_86cc_a2bada6ed277_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Member_Entry_C___402806d4_4bed_e246_86cc_a2bada6ed277_SourceToDest;

// Function WBP_Clan_Member_Entry.WBP_Clan_Member_Entry_C.__44a64ffb-4b28-60e7-9c7f-b68a5e897ce9_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Clan_Member_Entry_C___44a64ffb_4b28_60e7_9c7f_b68a5e897ce9_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Member_Entry_C___44a64ffb_4b28_60e7_9c7f_b68a5e897ce9_SourceToDest;

// Function WBP_Clan_Member_Entry.WBP_Clan_Member_Entry_C.__7cfd9b35-41ee-24ff-4c8a-3088d28eb40c_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Clan_Member_Entry_C___7cfd9b35_41ee_24ff_4c8a_3088d28eb40c_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Member_Entry_C___7cfd9b35_41ee_24ff_4c8a_3088d28eb40c_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
