#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Vehicles_Button_Tank

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_Button_NamedSlot_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Vehicles_Button_Tank.WBP_Vehicles_Button_Tank_C
// 0x00C0 (0x1690 - 0x15D0)
class UWBP_Vehicles_Button_Tank_C final : public UWBP_Button_NamedSlot_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Vehicles_Button_Tank_C;         // 0x15D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressBar*                           XP_ProgressBar;                                    // 0x15D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             VehicleName;                                       // 0x15E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ProgressBarSwitcher;                               // 0x15E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PilotUnlocked_Panel;                               // 0x15F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PilotLocked_Panel;                                 // 0x15F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTyrLazyImage*                          Image_Tank;                                        // 0x1600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Disabled_Dimmer;                                   // 0x1608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Career_ProgressBar;                                // 0x1610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Icon_C*                     Btn_EditLoadout;                                   // 0x1618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVM_Vehicle_C*                          VM_Vehicle;                                        // 0x1620(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UVM_Vehicle_Levels_C*                   VM_Vehicle_Levels;                                 // 0x1628(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UVM_Vehicle_Level_C*                    VM_Vehicle_Level;                                  // 0x1630(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UVM_Vehicle_LoadoutSlots_C*             VM_Vehicle_LoadoutSlots;                           // 0x1638(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidgetSwitcher*                        PilotInfo_Switcher;                                // 0x1640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             VehicleName_Locked;                                // 0x1648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             PilotLevel_Text;                                   // 0x1650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Incompatible_Icon;                                 // 0x1658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_Breadcrumb_C*                      Breadcrumb;                                        // 0x1660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               AlphaLabel;                                        // 0x1668(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UVM_Vehicle_C* VehicleViewModel)> OnViewLoadout;             // 0x1670(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UVM_Vehicle_C* VehicleViewModel)> OnViewOverview;            // 0x1680(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_Vehicles_Button_Tank_Btn_EditLoadout_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnClicked();
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ClickLoadoutButton();
	void ExecuteUbergraph_WBP_Vehicles_Button_Tank(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void RefreshCurrentLevel();
	void SetVM_Vehicle(class UVM_Vehicle_C* ViewModel);
	void SetVM_Vehicle_Level(class UVM_Vehicle_Level_C* ViewModel);
	void SetVM_Vehicle_Levels(class UVM_Vehicle_Levels_C* ViewModel);
	void SetVM_Vehicle_LoadoutSlots(class UVM_Vehicle_LoadoutSlots_C* ViewModel);

	struct FTyrMaterialScalarParam __8e172aad_4e35_4022_7330_908b4c70e216_SourceToDest() const;
	ESlateVisibility __ConversionFunction5a686733_cc38_318b_87af_ae3b9f596d09() const;
	ESlateVisibility __ConversionFunction72977d71_5946_383e_b931_d084475cc9c0() const;
	ESlateVisibility __ConversionFunction9771baf7_935d_3a0a_a1cd_cd136cb14521() const;
	ESlateVisibility __ConversionFunctiondce2547a_db3a_33ce_bb2a_5b1bc20e3b40() const;
	ESlateVisibility __ConversionFunctione7899fd4_807e_3a9b_8858_741c91290ff2() const;
	class UWidget* SwitchProgressBar(bool bInIsAtMaxLevel) const;
	class UWidget* ToPilotNamePanel(bool bInIsUnlocked) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Vehicles_Button_Tank_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Vehicles_Button_Tank_C")
	}
	static class UWBP_Vehicles_Button_Tank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Vehicles_Button_Tank_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Vehicles_Button_Tank_C;

SDK_NAMESPACE_END
