#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActionButton_Primary

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_ActionButton_Primary.WBP_ActionButton_Primary_C.ExecuteUbergraph_WBP_ActionButton_Primary
// 0x0140 (0x0140 - 0x0000)
struct WBP_ActionButton_Primary_C_ExecuteUbergraph_WBP_ActionButton_Primary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings;             // 0x0030(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0050(0x0060)(HasGetValueTypeHash)
	class FText                                   K2Node_Event_InText;                               // 0x00B0(0x0010)(ConstParm)
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings_1;           // 0x00C0(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x00E0(0x0060)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ActionButton_Primary_C_ExecuteUbergraph_WBP_ActionButton_Primary;

// Function WBP_ActionButton_Primary.WBP_ActionButton_Primary_C.UpdateButtonText
// 0x0010 (0x0010 - 0x0000)
struct WBP_ActionButton_Primary_C_UpdateButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_ActionButton_Primary_C_UpdateButtonText;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
