#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Lobby_JoinCode

#include "Basic.hpp"

#include "UMG_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Lobby_JoinCode.WBP_Lobby_JoinCode_C.BndEvt__WBP_Lobby_JoinCode_Btn_CopyCode_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_JoinCode_C_BndEvt__WBP_Lobby_JoinCode_Btn_CopyCode_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_JoinCode_C_BndEvt__WBP_Lobby_JoinCode_Btn_CopyCode_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_JoinCode.WBP_Lobby_JoinCode_C.BndEvt__WBP_Lobby_JoinCode_Btn_ToggleCodeVisibility_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_JoinCode_C_BndEvt__WBP_Lobby_JoinCode_Btn_ToggleCodeVisibility_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_JoinCode_C_BndEvt__WBP_Lobby_JoinCode_Btn_ToggleCodeVisibility_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_JoinCode.WBP_Lobby_JoinCode_C.BndEvt__WBP_Lobby_JoinCode_Btn_ToggleCodeVisibility_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_JoinCode_C_BndEvt__WBP_Lobby_JoinCode_Btn_ToggleCodeVisibility_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_JoinCode_C_BndEvt__WBP_Lobby_JoinCode_Btn_ToggleCodeVisibility_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_JoinCode.WBP_Lobby_JoinCode_C.BndEvt__WBP_Lobby_JoinCode_Btn_ToggleCodeVisibility_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_JoinCode_C_BndEvt__WBP_Lobby_JoinCode_Btn_ToggleCodeVisibility_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_JoinCode_C_BndEvt__WBP_Lobby_JoinCode_Btn_ToggleCodeVisibility_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_JoinCode.WBP_Lobby_JoinCode_C.ExecuteUbergraph_WBP_Lobby_JoinCode
// 0x0030 (0x0030 - 0x0000)
struct WBP_Lobby_JoinCode_C_ExecuteUbergraph_WBP_Lobby_JoinCode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_JoinCode_C_ExecuteUbergraph_WBP_Lobby_JoinCode;

// Function WBP_Lobby_JoinCode.WBP_Lobby_JoinCode_C.SetLobbyViewModel
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_JoinCode_C_SetLobbyViewModel final
{
public:
	class UVM_Lobby_C*                            InViewModel;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_JoinCode_C_SetLobbyViewModel;

// Function WBP_Lobby_JoinCode.WBP_Lobby_JoinCode_C.SetVM_Lobby
// 0x0028 (0x0028 - 0x0000)
struct WBP_Lobby_JoinCode_C_SetVM_Lobby final
{
public:
	class UVM_Lobby_C*                            ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_JoinCode_C_SetVM_Lobby;

// Function WBP_Lobby_JoinCode.WBP_Lobby_JoinCode_C.__effb50bb-44bf-4f76-d279-ca853bb87df7_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_Lobby_JoinCode_C___effb50bb_44bf_4f76_d279_ca853bb87df7_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanChangeMatchSettings_ReturnValue;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_JoinCode_C___effb50bb_44bf_4f76_d279_ca853bb87df7_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
