#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Ranked

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Ranked.WBP_Ranked_C.AfterPush_E9BB249F4311B0089FE936A766363B29
// 0x0008 (0x0008 - 0x0000)
struct WBP_Ranked_C_AfterPush_E9BB249F4311B0089FE936A766363B29 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_C_AfterPush_E9BB249F4311B0089FE936A766363B29;

// Function WBP_Ranked.WBP_Ranked_C.BeforePush_E9BB249F4311B0089FE936A766363B29
// 0x0008 (0x0008 - 0x0000)
struct WBP_Ranked_C_BeforePush_E9BB249F4311B0089FE936A766363B29 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_C_BeforePush_E9BB249F4311B0089FE936A766363B29;

// Function WBP_Ranked.WBP_Ranked_C.BndEvt__WBP_Ranked_Info_Button_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Ranked_C_BndEvt__WBP_Ranked_Info_Button_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_C_BndEvt__WBP_Ranked_Info_Button_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Ranked.WBP_Ranked_C.BndEvt__WBP_Ranked_TeamsLeaderboard_K2Node_ComponentBoundEvent_8_OnSelectedLeaderboardChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Ranked_C_BndEvt__WBP_Ranked_TeamsLeaderboard_K2Node_ComponentBoundEvent_8_OnSelectedLeaderboardChanged__DelegateSignature final
{
public:
	class UVM_Leaderboard_C*                      Leaderboard_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_C_BndEvt__WBP_Ranked_TeamsLeaderboard_K2Node_ComponentBoundEvent_8_OnSelectedLeaderboardChanged__DelegateSignature;

// Function WBP_Ranked.WBP_Ranked_C.BP_OnHandleBackAction
// 0x0018 (0x0018 - 0x0000)
struct WBP_Ranked_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Home_C*                            CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleBackAction_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_C_BP_OnHandleBackAction;

// Function WBP_Ranked.WBP_Ranked_C.ExecuteUbergraph_WBP_Ranked
// 0x0110 (0x0110 - 0x0000)
struct WBP_Ranked_C_ExecuteUbergraph_WBP_Ranked final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_1;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTyrOnlineSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Ranked_Info_C*                     K2Node_DynamicCast_AsWBP_Ranked_Info;              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrOnlineSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Leaderboards_C*                     CallFunc_GetLeaderboardsViewModel_ViewModel;       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrAsyncActionPushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Leaderboard_C*                      K2Node_ComponentBoundEvent_Leaderboard;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTyrGameModeEntry                      CallFunc_GetGameModeEntry_ReturnValue;             // 0x0098(0x0038)(ConstParm)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_1;     // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTyrGameModeEntry                      CallFunc_GetGameModeEntry_ReturnValue_1;           // 0x00D8(0x0038)(ConstParm)
};
DUMPER7_ASSERTS_WBP_Ranked_C_ExecuteUbergraph_WBP_Ranked;

// Function WBP_Ranked.WBP_Ranked_C.SetVM_Leaderboard
// 0x0028 (0x0028 - 0x0000)
struct WBP_Ranked_C_SetVM_Leaderboard final
{
public:
	class UVM_Leaderboard_C*                      ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_C_SetVM_Leaderboard;

// Function WBP_Ranked.WBP_Ranked_C.__ConversionFunctione147edf7-3658-3cd1-b29a-c6fc2612d621
// 0x0002 (0x0002 - 0x0000)
struct WBP_Ranked_C___ConversionFunctione147edf7_3658_3cd1_b29a_c6fc2612d621 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_C___ConversionFunctione147edf7_3658_3cd1_b29a_c6fc2612d621;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
