#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Clan_Chat

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Clan_Chat.WBP_Clan_Chat_C.BndEvt__WBP_Clan_Chat_Chat_ListView_K2Node_ComponentBoundEvent_2_OnListItemScrolledIntoViewDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Clan_Chat_C_BndEvt__WBP_Clan_Chat_Chat_ListView_K2Node_ComponentBoundEvent_2_OnListItemScrolledIntoViewDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Chat_C_BndEvt__WBP_Clan_Chat_Chat_ListView_K2Node_ComponentBoundEvent_2_OnListItemScrolledIntoViewDynamic__DelegateSignature;

// Function WBP_Clan_Chat.WBP_Clan_Chat_C.BndEvt__WBP_Clan_Chat_Entry_TextBox_K2Node_ComponentBoundEvent_1_OnChatMessageSubmitted__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Clan_Chat_C_BndEvt__WBP_Clan_Chat_Entry_TextBox_K2Node_ComponentBoundEvent_1_OnChatMessageSubmitted__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_Clan_Chat_C_BndEvt__WBP_Clan_Chat_Entry_TextBox_K2Node_ComponentBoundEvent_1_OnChatMessageSubmitted__DelegateSignature;

// Function WBP_Clan_Chat.WBP_Clan_Chat_C.BndEvt__WBP_Clan_Chat_Send_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_Chat_C_BndEvt__WBP_Clan_Chat_Send_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Chat_C_BndEvt__WBP_Clan_Chat_Send_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Clan_Chat.WBP_Clan_Chat_C.ExecuteUbergraph_WBP_Clan_Chat
// 0x0098 (0x0098 - 0x0000)
struct WBP_Clan_Chat_C_ExecuteUbergraph_WBP_Clan_Chat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0030(0x0010)(ConstParm)
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UVM_Clan_Chat_Message_C*                K2Node_DynamicCast_AsVM_Clan_Chat_Message;         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrBreadcrumbSubsystem*                CallFunc_GetBreadcrumbSubsystem_ReturnValue;       // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGenericBreadcrumb                     K2Node_MakeStruct_GenericBreadcrumb;               // 0x0078(0x0018)(HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Chat_C_ExecuteUbergraph_WBP_Clan_Chat;

// Function WBP_Clan_Chat.WBP_Clan_Chat_C.OnFocusReceived
// 0x0268 (0x0268 - 0x0000)
struct WBP_Clan_Chat_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	struct FEventReply                            CallFunc_SetUserFocus_ReturnValue;                 // 0x01B0(0x00B8)()
};
DUMPER7_ASSERTS_WBP_Clan_Chat_C_OnFocusReceived;

// Function WBP_Clan_Chat.WBP_Clan_Chat_C.ScrollToLastChatMessage
// 0x0018 (0x0018 - 0x0000)
struct WBP_Clan_Chat_C_ScrollToLastChatMessage final
{
public:
	TArray<class UVM_Clan_Chat_Message_C*>        InMessages;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Chat_C_ScrollToLastChatMessage;

// Function WBP_Clan_Chat.WBP_Clan_Chat_C.SetVM_Clan
// 0x0028 (0x0028 - 0x0000)
struct WBP_Clan_Chat_C_SetVM_Clan final
{
public:
	class UVM_Clan_C*                             ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Chat_C_SetVM_Clan;

// Function WBP_Clan_Chat.WBP_Clan_Chat_C.__5053422e-4ad2-0161-44b7-e88e4e9b383d_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_Clan_Chat_C___5053422e_4ad2_0161_44b7_e88e4e9b383d_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasChatErrorMessage_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Chat_C___5053422e_4ad2_0161_44b7_e88e4e9b383d_SourceToDest;

// Function WBP_Clan_Chat.WBP_Clan_Chat_C.__826640b1-49e0-af23-734c-1d87d1c2bfda_SourceToDest
// 0x000C (0x000C - 0x0000)
struct WBP_Clan_Chat_C___826640b1_49e0_af23_734c_1d87d1c2bfda_SourceToDest final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasJoinedLinkedChannelAndServer_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Chat_C___826640b1_49e0_af23_734c_1d87d1c2bfda_SourceToDest;

// Function WBP_Clan_Chat.WBP_Clan_Chat_C.__9c605409-4ff2-8b36-ffc5-5187bc287c9c_SourceToDest
// 0x000C (0x000C - 0x0000)
struct WBP_Clan_Chat_C___9c605409_4ff2_8b36_ffc5_5187bc287c9c_SourceToDest final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChatMessages_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Chat_C___9c605409_4ff2_8b36_ffc5_5187bc287c9c_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
