#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Lobby_Spectator_Left

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Lobby_Spectator_Left.WBP_Lobby_Spectator_Left_C.BndEvt__WBP_Lobby_Spectator_Left_Btn_SpectateTeam_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Spectator_Left_C_BndEvt__WBP_Lobby_Spectator_Left_Btn_SpectateTeam_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Left_C_BndEvt__WBP_Lobby_Spectator_Left_Btn_SpectateTeam_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Spectator_Left.WBP_Lobby_Spectator_Left_C.BndEvt__WBP_Lobby_Spectator_Left_Btn_SpectateTeam_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Spectator_Left_C_BndEvt__WBP_Lobby_Spectator_Left_Btn_SpectateTeam_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Left_C_BndEvt__WBP_Lobby_Spectator_Left_Btn_SpectateTeam_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Spectator_Left.WBP_Lobby_Spectator_Left_C.BndEvt__WBP_Lobby_Spectator_Left_Btn_SpectateTeam_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Spectator_Left_C_BndEvt__WBP_Lobby_Spectator_Left_Btn_SpectateTeam_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Left_C_BndEvt__WBP_Lobby_Spectator_Left_Btn_SpectateTeam_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Spectator_Left.WBP_Lobby_Spectator_Left_C.BndEvt__WBP_Lobby_Spectator_Left_SpectatorDetails_MenuAnchor_K2Node_ComponentBoundEvent_1_OnShowContextMenu__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Spectator_Left_C_BndEvt__WBP_Lobby_Spectator_Left_SpectatorDetails_MenuAnchor_K2Node_ComponentBoundEvent_1_OnShowContextMenu__DelegateSignature final
{
public:
	class UTyrContextMenuWidget*                  MenuWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Left_C_BndEvt__WBP_Lobby_Spectator_Left_SpectatorDetails_MenuAnchor_K2Node_ComponentBoundEvent_1_OnShowContextMenu__DelegateSignature;

// Function WBP_Lobby_Spectator_Left.WBP_Lobby_Spectator_Left_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Lobby_Spectator_Left_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Left_C_BP_OnItemExpansionChanged;

// Function WBP_Lobby_Spectator_Left.WBP_Lobby_Spectator_Left_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Lobby_Spectator_Left_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Left_C_BP_OnItemSelectionChanged;

// Function WBP_Lobby_Spectator_Left.WBP_Lobby_Spectator_Left_C.ExecuteUbergraph_WBP_Lobby_Spectator_Left
// 0x0090 (0x0090 - 0x0000)
struct WBP_Lobby_Spectator_Left_C_ExecuteUbergraph_WBP_Lobby_Spectator_Left final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTyrContextMenuWidget*                  K2Node_ComponentBoundEvent_MenuWidget;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0040(0x0008)(NoDestructor)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0048(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x0058(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0068(0x0008)(NoDestructor)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0070(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0080(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Left_C_ExecuteUbergraph_WBP_Lobby_Spectator_Left;

// Function WBP_Lobby_Spectator_Left.WBP_Lobby_Spectator_Left_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Spectator_Left_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Left_C_OnAddedToFocusPath;

// Function WBP_Lobby_Spectator_Left.WBP_Lobby_Spectator_Left_C.OnFocusReceived
// 0x0288 (0x0288 - 0x0000)
struct WBP_Lobby_Spectator_Left_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	int32                                         Temp_int_Variable;                                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0110(0x00B8)()
	class UWidget*                                K2Node_Select_Default;                             // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_SetUserFocus_ReturnValue;                 // 0x01D0(0x00B8)()
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Left_C_OnFocusReceived;

// Function WBP_Lobby_Spectator_Left.WBP_Lobby_Spectator_Left_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Spectator_Left_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Left_C_OnListItemObjectSet;

// Function WBP_Lobby_Spectator_Left.WBP_Lobby_Spectator_Left_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Spectator_Left_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Left_C_OnRemovedFromFocusPath;

// Function WBP_Lobby_Spectator_Left.WBP_Lobby_Spectator_Left_C.SetVM_Lobby_Player
// 0x0028 (0x0028 - 0x0000)
struct WBP_Lobby_Spectator_Left_C_SetVM_Lobby_Player final
{
public:
	class UVM_Lobby_Player_C*                     ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Left_C_SetVM_Lobby_Player;

// Function WBP_Lobby_Spectator_Left.WBP_Lobby_Spectator_Left_C.__6802c73d-42d4-7db1-9d73-62af3ab30495_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Lobby_Spectator_Left_C___6802c73d_42d4_7db1_9d73_62af3ab30495_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Left_C___6802c73d_42d4_7db1_9d73_62af3ab30495_SourceToDest;

// Function WBP_Lobby_Spectator_Left.WBP_Lobby_Spectator_Left_C.__6d085b5b-49f1-a562-25df-2286e1895c96_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Lobby_Spectator_Left_C___6d085b5b_49f1_a562_25df_2286e1895c96_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Left_C___6d085b5b_49f1_a562_25df_2286e1895c96_SourceToDest;

// Function WBP_Lobby_Spectator_Left.WBP_Lobby_Spectator_Left_C.__7fe5cf4d-46ec-d348-5e96-45aa4a1ffa0d_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Lobby_Spectator_Left_C___7fe5cf4d_46ec_d348_5e96_45aa4a1ffa0d_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Left_C___7fe5cf4d_46ec_d348_5e96_45aa4a1ffa0d_SourceToDest;

// Function WBP_Lobby_Spectator_Left.WBP_Lobby_Spectator_Left_C.__c1d5a0f0-40f8-ba31-8cdc-269a493b8a26_SourceToDest
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Spectator_Left_C___c1d5a0f0_40f8_ba31_8cdc_269a493b8a26_SourceToDest final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Left_C___c1d5a0f0_40f8_ba31_8cdc_269a493b8a26_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
