#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Scoreboard_InGame_PlayerEntry

#include "Basic.hpp"

#include "FieldNotification_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Tyr_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C_BP_OnItemExpansionChanged;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C_BP_OnItemSelectionChanged;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.ExecuteUbergraph_WBP_Scoreboard_InGame_PlayerEntry
// 0x0068 (0x0068 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C_ExecuteUbergraph_WBP_Scoreboard_InGame_PlayerEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_CustomEvent_Field;                          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ATyrPlayerRecord*                       K2Node_DynamicCast_AsTyr_Player_Record;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_InListItemObject;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_PlayerScoreboard_InGame_C*          K2Node_DynamicCast_AsVM_Player_Scoreboard_in_Game; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate; // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATyrPlayerStateBase*                    CallFunc_GetOwningPlayerState_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATyrPlayerRecord*                       CallFunc_GetPlayerRecord_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C_ExecuteUbergraph_WBP_Scoreboard_InGame_PlayerEntry;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C_OnListItemObjectSet;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.OnListItemObjectSet_New
// 0x0008 (0x0008 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C_OnListItemObjectSet_New final
{
public:
	class UObject*                                InListItemObject;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C_OnListItemObjectSet_New;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.OnPlayerRecordChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C_OnPlayerRecordChanged final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   Field;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C_OnPlayerRecordChanged;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.SetVM_PlayerScoreboard_InGame
// 0x0028 (0x0028 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C_SetVM_PlayerScoreboard_InGame final
{
public:
	class UVM_PlayerScoreboard_InGame_C*          ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C_SetVM_PlayerScoreboard_InGame;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.__143b11f1-457e-90e6-6d9f-df9e4cdd6ec5_SourceToDest
// 0x0028 (0x0028 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C___143b11f1_457e_90e6_6d9f_df9e4cdd6ec5_SourceToDest final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            CallFunc_SelectSlateColor_ReturnValue;             // 0x0014(0x0014)()
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C___143b11f1_457e_90e6_6d9f_df9e4cdd6ec5_SourceToDest;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.__15a5f656-48bd-9e49-1c67-0ab4b5c5529c_SourceToDest
// 0x0010 (0x0010 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C___15a5f656_48bd_9e49_1c67_0ab4b5c5529c_SourceToDest final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C___15a5f656_48bd_9e49_1c67_0ab4b5c5529c_SourceToDest;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.__19e0b124-4885-1ff1-b3fa-d78833d64026_SourceToDest
// 0x0010 (0x0010 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C___19e0b124_4885_1ff1_b3fa_d78833d64026_SourceToDest final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C___19e0b124_4885_1ff1_b3fa_d78833d64026_SourceToDest;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.__20692238-43a2-9af5-854e-edb180c36659_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C___20692238_43a2_9af5_854e_edb180c36659_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C___20692238_43a2_9af5_854e_edb180c36659_SourceToDest;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.__235afc51-446a-66d8-fe76-9fb06f66c74b_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C___235afc51_446a_66d8_fe76_9fb06f66c74b_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldPlusBeVisible_bOutResult;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C___235afc51_446a_66d8_fe76_9fb06f66c74b_SourceToDest;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.__823bca15-4fdf-7c91-ce11-b5885095c9cf_SourceToDest
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C___823bca15_4fdf_7c91_ce11_b5885095c9cf_SourceToDest final
{
public:
	struct FTyrMaterialTextureParam               ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm)
	struct FTyrMaterialTextureParam               CallFunc_ToTextureMaterialParam__Texture__ReturnValue; // 0x0060(0x0060)()
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C___823bca15_4fdf_7c91_ce11_b5885095c9cf_SourceToDest;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.__8300d2c1-4198-85ec-1a6e-82a4980386bb_SourceToDest
// 0x0010 (0x0010 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C___8300d2c1_4198_85ec_1a6e_82a4980386bb_SourceToDest final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C___8300d2c1_4198_85ec_1a6e_82a4980386bb_SourceToDest;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.__a5f490f4-437b-ab17-4e46-368c4be1b0f4_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C___a5f490f4_437b_ab17_4e46_368c4be1b0f4_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C___a5f490f4_437b_ab17_4e46_368c4be1b0f4_SourceToDest;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.__ConversionFunction10ad4790-7907-34b8-a150-07bc953090a9
// 0x0028 (0x0028 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C___ConversionFunction10ad4790_7907_34b8_a150_07bc953090a9 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            CallFunc_SelectSlateColor_ReturnValue;             // 0x0014(0x0014)()
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C___ConversionFunction10ad4790_7907_34b8_a150_07bc953090a9;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.__ConversionFunction134f780b-e008-3d22-b6a7-aa1fe8a9a90b
// 0x0010 (0x0010 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C___ConversionFunction134f780b_e008_3d22_b6a7_aa1fe8a9a90b final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C___ConversionFunction134f780b_e008_3d22_b6a7_aa1fe8a9a90b;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.__ConversionFunction3dd503b6-88a7-3ab5-8cc0-2dced147ab3d
// 0x0010 (0x0010 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C___ConversionFunction3dd503b6_88a7_3ab5_8cc0_2dced147ab3d final
{
public:
	class UTexture2D*                             Icon;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_ToTankClassIcon_Icon;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C___ConversionFunction3dd503b6_88a7_3ab5_8cc0_2dced147ab3d;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.__ConversionFunction49f88815-a46f-3974-8aa0-99eb979356d5
// 0x0003 (0x0003 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C___ConversionFunction49f88815_a46f_3974_8aa0_99eb979356d5 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldPlusBeVisible_bOutResult;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C___ConversionFunction49f88815_a46f_3974_8aa0_99eb979356d5;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.__ConversionFunction749c5caa-a5d1-354d-a057-342009fbf8ed
// 0x0010 (0x0010 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C___ConversionFunction749c5caa_a5d1_354d_a057_342009fbf8ed final
{
public:
	class UTexture2D*                             Icon;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_ToTankClassIcon_Icon;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C___ConversionFunction749c5caa_a5d1_354d_a057_342009fbf8ed;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.__ConversionFunction9dd749f4-f821-35e3-b4de-b2af3bdafb36
// 0x0002 (0x0002 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C___ConversionFunction9dd749f4_f821_35e3_b4de_b2af3bdafb36 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C___ConversionFunction9dd749f4_f821_35e3_b4de_b2af3bdafb36;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.__ConversionFunctiona2f796a3-e6e7-3709-ba75-400e57f2ebb0
// 0x0010 (0x0010 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C___ConversionFunctiona2f796a3_e6e7_3709_ba75_400e57f2ebb0 final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C___ConversionFunctiona2f796a3_e6e7_3709_ba75_400e57f2ebb0;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.__ConversionFunctiona4055ae4-7ba4-3330-bee7-ac34318e8c90
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C___ConversionFunctiona4055ae4_7ba4_3330_bee7_ac34318e8c90 final
{
public:
	struct FTyrMaterialTextureParam               ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm)
	struct FTyrMaterialTextureParam               CallFunc_ToTextureMaterialParam__Texture__ReturnValue; // 0x0060(0x0060)()
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C___ConversionFunctiona4055ae4_7ba4_3330_bee7_ac34318e8c90;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.__ConversionFunctionbc0a58be-b41c-317b-a805-532229bdae73
// 0x0010 (0x0010 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C___ConversionFunctionbc0a58be_b41c_317b_a805_532229bdae73 final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C___ConversionFunctionbc0a58be_b41c_317b_a805_532229bdae73;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.__eb6e655a-4741-e9b5-3d00-31aa77680288_SourceToDest
// 0x0010 (0x0010 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C___eb6e655a_4741_e9b5_3d00_31aa77680288_SourceToDest final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C___eb6e655a_4741_e9b5_3d00_31aa77680288_SourceToDest;

// Function WBP_Scoreboard_InGame_PlayerEntry.WBP_Scoreboard_InGame_PlayerEntry_C.__f185b34f-4aa1-aca9-cef4-8dbb164a76d6_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Scoreboard_InGame_PlayerEntry_C___f185b34f_4aa1_aca9_cef4_8dbb164a76d6_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_InGame_PlayerEntry_C___f185b34f_4aa1_aca9_cef4_8dbb164a76d6_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
