#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Button_NavTab

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Button_NavTab.WBP_Button_NavTab_C.UpdateButtonText
// 0x0010 (0x0010 - 0x0000)
struct WBP_Button_NavTab_C_UpdateButtonText final
{
public:
	class FText                                   InText_UpdateButtonText;                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_Button_NavTab_C_UpdateButtonText;

// Function WBP_Button_NavTab.WBP_Button_NavTab_C.SetCategoryBreadcrumb
// 0x0008 (0x0008 - 0x0000)
struct WBP_Button_NavTab_C_SetCategoryBreadcrumb final
{
public:
	struct FGameplayTag                           InCategory;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Button_NavTab_C_SetCategoryBreadcrumb;

// Function WBP_Button_NavTab.WBP_Button_NavTab_C.ExecuteUbergraph_WBP_Button_NavTab
// 0x01D8 (0x01D8 - 0x0000)
struct WBP_Button_NavTab_C_ExecuteUbergraph_WBP_Button_NavTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x0004(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InText;                               // 0x0018(0x0010)(ConstParm)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0028(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0038(0x0060)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x0098(0x0060)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_2;                 // 0x00F8(0x0060)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_3;                 // 0x0158(0x0060)(HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x01B8(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x01C8(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Button_NavTab_C_ExecuteUbergraph_WBP_Button_NavTab;

// Function WBP_Button_NavTab.WBP_Button_NavTab_C.__e1f896a4-476f-e330-780d-2d9c65daf3d2_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Button_NavTab_C___e1f896a4_476f_e330_780d_2d9c65daf3d2_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Button_NavTab_C___e1f896a4_476f_e330_780d_2d9c65daf3d2_SourceToDest;

// Function WBP_Button_NavTab.WBP_Button_NavTab_C.__7dbc7cfd-47f7-d390-690e-3aaec860b268_SourceToDest
// 0x0028 (0x0028 - 0x0000)
struct WBP_Button_NavTab_C___7dbc7cfd_47f7_d390_690e_3aaec860b268_SourceToDest final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_GetNumUnclaimedBattles_ReturnValue;       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
};
DUMPER7_ASSERTS_WBP_Button_NavTab_C___7dbc7cfd_47f7_d390_690e_3aaec860b268_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
