#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerTitle

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_PlayerTitle.WBP_PlayerTitle_C.ExecuteUbergraph_WBP_PlayerTitle
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerTitle_C_ExecuteUbergraph_WBP_PlayerTitle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PlayerTitle_C_ExecuteUbergraph_WBP_PlayerTitle;

// Function WBP_PlayerTitle.WBP_PlayerTitle_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PlayerTitle_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PlayerTitle_C_PreConstruct;

// Function WBP_PlayerTitle.WBP_PlayerTitle_C.SetFontSize
// 0x0098 (0x0098 - 0x0000)
struct WBP_PlayerTitle_C_SetFontSize final
{
public:
	struct FSlateFontInfo                         LocFont;                                           // 0x0000(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings;             // 0x0070(0x0020)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_Size_ImplicitCast;        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PlayerTitle_C_SetFontSize;

// Function WBP_PlayerTitle.WBP_PlayerTitle_C.SetTitleData
// 0x0078 (0x0078 - 0x0000)
struct WBP_PlayerTitle_C_SetTitleData final
{
public:
	struct FTyrPlayerTitleData                    InTitleData;                                       // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings;             // 0x0058(0x0020)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PlayerTitle_C_SetTitleData;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
