#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CurrencyStore_FeaturedCard

#include "Basic.hpp"

#include "Tyr_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_CurrencyStore_FeaturedCard.WBP_CurrencyStore_FeaturedCard_C.SetFeaturedPackVM
// 0x0028 (0x0028 - 0x0000)
struct WBP_CurrencyStore_FeaturedCard_C_SetFeaturedPackVM final
{
public:
	class UVM_CurrencyPack_C*                     ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CurrencyStore_FeaturedCard_C_SetFeaturedPackVM;

// Function WBP_CurrencyStore_FeaturedCard.WBP_CurrencyStore_FeaturedCard_C.SetupFromData
// 0x0040 (0x0040 - 0x0000)
struct WBP_CurrencyStore_FeaturedCard_C_SetupFromData final
{
public:
	class FText                                   InDisplayName;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InDescription;                                     // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InPrice;                                           // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InTerms;                                           // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_CurrencyStore_FeaturedCard_C_SetupFromData;

// Function WBP_CurrencyStore_FeaturedCard.WBP_CurrencyStore_FeaturedCard_C.__0393cbd4-4b7c-ad6d-03ea-efa9ab73c7eb_SourceToDest
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_CurrencyStore_FeaturedCard_C___0393cbd4_4b7c_ad6d_03ea_efa9ab73c7eb_SourceToDest final
{
public:
	struct FTyrMaterialTextureParam               ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm)
	struct FTyrMaterialTextureParam               CallFunc_ToTextureMaterialParam__Texture__ReturnValue; // 0x0060(0x0060)()
};
DUMPER7_ASSERTS_WBP_CurrencyStore_FeaturedCard_C___0393cbd4_4b7c_ad6d_03ea_efa9ab73c7eb_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
