#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Scoreboard_PostGame_PlayerEntry_Right

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Tyr_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_Button_StyleType_structs.hpp"
#include "BP_SaluteSuccessMessage_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.BndEvt__WBP_Scoreboard_PostGame_PlayerEntry_Right_ContextMenuAnchor_K2Node_ComponentBoundEvent_0_OnShowContextMenu__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C_BndEvt__WBP_Scoreboard_PostGame_PlayerEntry_Right_ContextMenuAnchor_K2Node_ComponentBoundEvent_0_OnShowContextMenu__DelegateSignature final
{
public:
	class UTyrContextMenuWidget*                  MenuWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C_BndEvt__WBP_Scoreboard_PostGame_PlayerEntry_Right_ContextMenuAnchor_K2Node_ComponentBoundEvent_0_OnShowContextMenu__DelegateSignature;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.BndEvt__WBP_Scoreboard_PostGame_PlayerEntry_Right_WBP_Button_Icon_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C_BndEvt__WBP_Scoreboard_PostGame_PlayerEntry_Right_WBP_Button_Icon_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C_BndEvt__WBP_Scoreboard_PostGame_PlayerEntry_Right_WBP_Button_Icon_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.ExecuteUbergraph_WBP_Scoreboard_PostGame_PlayerEntry_Right
// 0x0128 (0x0128 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C_ExecuteUbergraph_WBP_Scoreboard_PostGame_PlayerEntry_Right final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0004(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate; // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FBP_SaluteSuccessMessage               Temp_struct_Variable;                              // 0x0038(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_2;          // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_3;          // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NativeCompareString_ReturnValue;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NativeCompareString_ReturnValue_1;        // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB[0x5];                                       // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTyrContextMenuWidget*                  K2Node_ComponentBoundEvent_MenuWidget;             // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FBP_SaluteSuccessMessage               Temp_struct_Variable_2;                            // 0x00D0(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x00F4(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0104(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0114(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C_ExecuteUbergraph_WBP_Scoreboard_PostGame_PlayerEntry_Right;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.GetUserMenuContent
// 0x0028 (0x0028 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C_GetUserMenuContent final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tooltip_ItemDetail_C*              K2Node_DynamicCast_AsWBP_Tooltip_Item_Detail;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C_GetUserMenuContent;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.OnMessageReceived_A0F22FC94097D2574DAF03A478120C21
// 0x0010 (0x0010 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C_OnMessageReceived_A0F22FC94097D2574DAF03A478120C21 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C_OnMessageReceived_A0F22FC94097D2574DAF03A478120C21;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.SetVM_Scoreboard_Player
// 0x0028 (0x0028 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C_SetVM_Scoreboard_Player final
{
public:
	class UVM_Scoreboard_Player_C*                ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C_SetVM_Scoreboard_Player;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.__23dcfbf4-412b-4a0e-86b4-ba830f3696ec_SourceToDest
// 0x0028 (0x0028 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C___23dcfbf4_412b_4a0e_86b4_ba830f3696ec_SourceToDest final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            CallFunc_SelectSlateColor_ReturnValue;             // 0x0014(0x0014)()
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C___23dcfbf4_412b_4a0e_86b4_ba830f3696ec_SourceToDest;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.__23f483d0-4f5d-bd86-1e96-489ab6e6083a_SourceToDest
// 0x0028 (0x0028 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C___23f483d0_4f5d_bd86_1e96_489ab6e6083a_SourceToDest final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            CallFunc_SelectSlateColor_ReturnValue;             // 0x0014(0x0014)()
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C___23f483d0_4f5d_bd86_1e96_489ab6e6083a_SourceToDest;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.__36d9d38e-47da-59d0-e188-48b9bd7f372e_SourceToDest
// 0x0028 (0x0028 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C___36d9d38e_47da_59d0_e188_48b9bd7f372e_SourceToDest final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            CallFunc_SelectSlateColor_ReturnValue;             // 0x0014(0x0014)()
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C___36d9d38e_47da_59d0_e188_48b9bd7f372e_SourceToDest;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.__476f62ef-4f69-35d8-3e91-71a4dde0a629_SourceToDest
// 0x0010 (0x0010 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C___476f62ef_4f69_35d8_3e91_71a4dde0a629_SourceToDest final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C___476f62ef_4f69_35d8_3e91_71a4dde0a629_SourceToDest;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.__8ce923fe-4372-9ef2-a132-40a72169b547_SourceToDest
// 0x0028 (0x0028 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C___8ce923fe_4372_9ef2_a132_40a72169b547_SourceToDest final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            CallFunc_SelectSlateColor_ReturnValue;             // 0x0014(0x0014)()
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C___8ce923fe_4372_9ef2_a132_40a72169b547_SourceToDest;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.__8d7f756b-4f2e-0f68-4866-e4898239fd65_SourceToDest
// 0x0028 (0x0028 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C___8d7f756b_4f2e_0f68_4866_e4898239fd65_SourceToDest final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            CallFunc_SelectSlateColor_ReturnValue;             // 0x0014(0x0014)()
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C___8d7f756b_4f2e_0f68_4866_e4898239fd65_SourceToDest;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.__8de75015-499c-b60d-f42d-f0aa18d17a20_SourceToDest
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C___8de75015_499c_b60d_f42d_f0aa18d17a20_SourceToDest final
{
public:
	struct FTyrMaterialTextureParam               ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm)
	struct FTyrMaterialTextureParam               CallFunc_ToTextureMaterialParam__Texture__ReturnValue; // 0x0060(0x0060)()
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C___8de75015_499c_b60d_f42d_f0aa18d17a20_SourceToDest;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.__b1b399ae-48e5-6d08-a985-0e9aa7691cb0_SourceToDest
// 0x0010 (0x0010 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C___b1b399ae_48e5_6d08_a985_0e9aa7691cb0_SourceToDest final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C___b1b399ae_48e5_6d08_a985_0e9aa7691cb0_SourceToDest;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.__b91b1a5a-4e7e-0e23-fda0-c6bb7e9ba8b4_SourceToDest
// 0x0010 (0x0010 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C___b91b1a5a_4e7e_0e23_fda0_c6bb7e9ba8b4_SourceToDest final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C___b91b1a5a_4e7e_0e23_fda0_c6bb7e9ba8b4_SourceToDest;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.__c76000df-49d2-b164-5988-caab0afdf6cf_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C___c76000df_49d2_b164_5988_caab0afdf6cf_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C___c76000df_49d2_b164_5988_caab0afdf6cf_SourceToDest;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.__ConversionFunction795372e0-e53a-3173-bd8a-b5327bcd35c3
// 0x0028 (0x0028 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C___ConversionFunction795372e0_e53a_3173_bd8a_b5327bcd35c3 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            CallFunc_SelectSlateColor_ReturnValue;             // 0x0014(0x0014)()
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C___ConversionFunction795372e0_e53a_3173_bd8a_b5327bcd35c3;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.__dae5e633-4a97-a317-7d78-339c069fef79_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C___dae5e633_4a97_a317_7d78_339c069fef79_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C___dae5e633_4a97_a317_7d78_339c069fef79_SourceToDest;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.__dc83a779-427d-eda7-646e-9ab1ca3400a3_SourceToDest
// 0x0010 (0x0010 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C___dc83a779_427d_eda7_646e_9ab1ca3400a3_SourceToDest final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C___dc83a779_427d_eda7_646e_9ab1ca3400a3_SourceToDest;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.__e67fd51d-4531-a393-0057-b6afa06effc8_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C___e67fd51d_4531_a393_0057_b6afa06effc8_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C___e67fd51d_4531_a393_0057_b6afa06effc8_SourceToDest;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.__f196d5db-4f4e-f2ad-e524-7194597c5f74_SourceToDest
// 0x0010 (0x0010 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C___f196d5db_4f4e_f2ad_e524_7194597c5f74_SourceToDest final
{
public:
	class UTexture2D*                             Icon;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_ToTankClassIcon_Icon;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C___f196d5db_4f4e_f2ad_e524_7194597c5f74_SourceToDest;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.__fd5957a8-4175-c65a-e5ed-84b42f600f39_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C___fd5957a8_4175_c65a_e5ed_84b42f600f39_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C___fd5957a8_4175_c65a_e5ed_84b42f600f39_SourceToDest;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.GetSaluteButtonColor
// 0x0014 (0x0014 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C_GetSaluteButtonColor final
{
public:
	bool                                          bInHasAnyConsumable;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInHasAlreadySaluted;                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x0004(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C_GetSaluteButtonColor;

// Function WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C.GetSaluteButtonType
// 0x0004 (0x0004 - 0x0000)
struct WBP_Scoreboard_PostGame_PlayerEntry_Right_C_GetSaluteButtonType final
{
public:
	bool                                          bInHasConsumable;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInHasSalutedAlready;                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Button_StyleType                            OutStyle;                                          // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Scoreboard_PostGame_PlayerEntry_Right_C_GetSaluteButtonType;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
