#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Clan_Info

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Clan_Info.WBP_Clan_Info_C.ExecuteUbergraph_WBP_Clan_Info
// 0x0020 (0x0020 - 0x0000)
struct WBP_Clan_Info_C_ExecuteUbergraph_WBP_Clan_Info final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScaleBoxSlot*                          CallFunc_SlotAsScaleBoxSlot_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVM_Clans_C*                            CallFunc_GetClansViewModel_ViewModel;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Info_C_ExecuteUbergraph_WBP_Clan_Info;

// Function WBP_Clan_Info.WBP_Clan_Info_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Clan_Info_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Info_C_PreConstruct;

// Function WBP_Clan_Info.WBP_Clan_Info_C.__6d5e015c-4c6f-380e-dad2-d7a71bb08f14_SourceToDest
// 0x0060 (0x0060 - 0x0000)
struct WBP_Clan_Info_C___6d5e015c_4c6f_380e_dad2_d7a71bb08f14_SourceToDest final
{
public:
	struct FTyrInputActionLabelParam              ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_GetLinkDiscordButtonLabel_ReturnValue;    // 0x0028(0x0010)()
	struct FTyrInputActionLabelParam              CallFunc_ToInputActionLabelParam_ReturnValue;      // 0x0038(0x0028)()
};
DUMPER7_ASSERTS_WBP_Clan_Info_C___6d5e015c_4c6f_380e_dad2_d7a71bb08f14_SourceToDest;

// Function WBP_Clan_Info.WBP_Clan_Info_C.__90af645d-4902-c6ed-5fc4-d186babc0c2f_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Clan_Info_C___90af645d_4902_c6ed_5fc4_d186babc0c2f_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Info_C___90af645d_4902_c6ed_5fc4_d186babc0c2f_SourceToDest;

// Function WBP_Clan_Info.WBP_Clan_Info_C.__935a8e25-4389-1af8-6cba-c5876fb37431_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Clan_Info_C___935a8e25_4389_1af8_6cba_c5876fb37431_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Info_C___935a8e25_4389_1af8_6cba_c5876fb37431_SourceToDest;

// Function WBP_Clan_Info.WBP_Clan_Info_C.__adc9b994-481f-78ce-ada8-b298530a4ec2_SourceToDest
// 0x0048 (0x0048 - 0x0000)
struct WBP_Clan_Info_C___adc9b994_481f_78ce_ada8_b298530a4ec2_SourceToDest final
{
public:
	struct FTyrInputActionEnableParam             ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	bool                                          CallFunc_CanLinkDiscord_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrInputActionEnableParam             CallFunc_ToInputActionEnableParam_ReturnValue;     // 0x0028(0x0020)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Clan_Info_C___adc9b994_481f_78ce_ada8_b298530a4ec2_SourceToDest;

// Function WBP_Clan_Info.WBP_Clan_Info_C.__e281c977-4530-7779-3c3b-d7a8cc647335_SourceToDest
// 0x0048 (0x0048 - 0x0000)
struct WBP_Clan_Info_C___e281c977_4530_7779_3c3b_d7a8cc647335_SourceToDest final
{
public:
	struct FTyrInputActionListenParam             ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	bool                                          CallFunc_IsDiscordUnlinked_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrInputActionListenParam             CallFunc_ToInputActionListenParam_ReturnValue;     // 0x0028(0x0020)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Clan_Info_C___e281c977_4530_7779_3c3b_d7a8cc647335_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
