#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RegionSelect

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_RegionSelect.WBP_RegionSelect_C.BndEvt__WBP_RegionSelect_WBP_Asia_K2Node_ComponentBoundEvent_5_OnRegionSelected__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_RegionSelect_C_BndEvt__WBP_RegionSelect_WBP_Asia_K2Node_ComponentBoundEvent_5_OnRegionSelected__DelegateSignature final
{
public:
	class FString                                 RegionId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_RegionSelect_C_BndEvt__WBP_RegionSelect_WBP_Asia_K2Node_ComponentBoundEvent_5_OnRegionSelected__DelegateSignature;

// Function WBP_RegionSelect.WBP_RegionSelect_C.BndEvt__WBP_RegionSelect_WBP_EU_K2Node_ComponentBoundEvent_4_OnRegionSelected__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_RegionSelect_C_BndEvt__WBP_RegionSelect_WBP_EU_K2Node_ComponentBoundEvent_4_OnRegionSelected__DelegateSignature final
{
public:
	class FString                                 RegionId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_RegionSelect_C_BndEvt__WBP_RegionSelect_WBP_EU_K2Node_ComponentBoundEvent_4_OnRegionSelected__DelegateSignature;

// Function WBP_RegionSelect.WBP_RegionSelect_C.BndEvt__WBP_RegionSelect_WBP_NAEast_K2Node_ComponentBoundEvent_3_OnRegionSelected__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_RegionSelect_C_BndEvt__WBP_RegionSelect_WBP_NAEast_K2Node_ComponentBoundEvent_3_OnRegionSelected__DelegateSignature final
{
public:
	class FString                                 RegionId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_RegionSelect_C_BndEvt__WBP_RegionSelect_WBP_NAEast_K2Node_ComponentBoundEvent_3_OnRegionSelected__DelegateSignature;

// Function WBP_RegionSelect.WBP_RegionSelect_C.BndEvt__WBP_RegionSelect_WBP_NAWest_K2Node_ComponentBoundEvent_2_OnRegionSelected__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_RegionSelect_C_BndEvt__WBP_RegionSelect_WBP_NAWest_K2Node_ComponentBoundEvent_2_OnRegionSelected__DelegateSignature final
{
public:
	class FString                                 RegionId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_RegionSelect_C_BndEvt__WBP_RegionSelect_WBP_NAWest_K2Node_ComponentBoundEvent_2_OnRegionSelected__DelegateSignature;

// Function WBP_RegionSelect.WBP_RegionSelect_C.BndEvt__WBP_RegionSelect_WBP_SouthAmerica_K2Node_ComponentBoundEvent_1_OnRegionSelected__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_RegionSelect_C_BndEvt__WBP_RegionSelect_WBP_SouthAmerica_K2Node_ComponentBoundEvent_1_OnRegionSelected__DelegateSignature final
{
public:
	class FString                                 RegionId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_RegionSelect_C_BndEvt__WBP_RegionSelect_WBP_SouthAmerica_K2Node_ComponentBoundEvent_1_OnRegionSelected__DelegateSignature;

// Function WBP_RegionSelect.WBP_RegionSelect_C.ExecuteUbergraph_WBP_RegionSelect
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_RegionSelect_C_ExecuteUbergraph_WBP_RegionSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrLocalPlayer*                        K2Node_DynamicCast_AsTyr_Local_Player;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrSettingsShared*                     CallFunc_GetSharedSettings_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrSettingsLocal*                      CallFunc_GetLocalSettings_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrOnlineSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_RegionId_4;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBestRegion_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_RegionId_3;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_RegionId_2;             // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_RegionId_1;             // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_RegionId;               // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue_1;       // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrLocalPlayer*                        K2Node_DynamicCast_AsTyr_Local_Player_1;           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrSettingsShared*                     CallFunc_GetSharedSettings_ReturnValue_1;          // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_RegionSelect_C_ExecuteUbergraph_WBP_RegionSelect;

// Function WBP_RegionSelect.WBP_RegionSelect_C.BP_GetDesiredFocusTarget
// 0x0040 (0x0040 - 0x0000)
struct WBP_RegionSelect_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrLocalPlayer*                        K2Node_DynamicCast_AsTyr_Local_Player;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrSettingsShared*                     CallFunc_GetSharedSettings_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSelectedRegion_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_RegionSelect_C_BP_GetDesiredFocusTarget;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
