#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Ranked_Leaderboards

#include "Basic.hpp"

#include "FieldNotification_structs.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Ranked_Leaderboards.WBP_Ranked_Leaderboards_C.BndEvt__WBP_Ranked_Leaderboards_Leaderboard_Tabs_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Ranked_Leaderboards_C_BndEvt__WBP_Ranked_Leaderboards_Leaderboard_Tabs_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_Leaderboards_C_BndEvt__WBP_Ranked_Leaderboards_Leaderboard_Tabs_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature;

// Function WBP_Ranked_Leaderboards.WBP_Ranked_Leaderboards_C.BndEvt__WBP_Ranked_Leaderboards_Leaderboard_Tabs_K2Node_ComponentBoundEvent_1_OnTabButtonCreation__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Ranked_Leaderboards_C_BndEvt__WBP_Ranked_Leaderboards_Leaderboard_Tabs_K2Node_ComponentBoundEvent_1_OnTabButtonCreation__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_Leaderboards_C_BndEvt__WBP_Ranked_Leaderboards_Leaderboard_Tabs_K2Node_ComponentBoundEvent_1_OnTabButtonCreation__DelegateSignature;

// Function WBP_Ranked_Leaderboards.WBP_Ranked_Leaderboards_C.ExecuteUbergraph_WBP_Ranked_Leaderboards
// 0x0070 (0x0070 - 0x0000)
struct WBP_Ranked_Leaderboards_C_ExecuteUbergraph_WBP_Ranked_Leaderboards final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_TabId_1;                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_TabButton;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTyrButtonBase*                         K2Node_DynamicCast_AsTyr_Button_Base;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RegisterTab_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTextForTabId_TabText;                  // 0x0030(0x0010)()
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId;             // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UVM_Leaderboard_C*                      CallFunc_GetSelectedLeaderboard_ReturnValue;       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue; // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RegisterTab_ReturnValue_1;                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Leaderboard_C*                      CallFunc_GetSelectedLeaderboard_ReturnValue_1;     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_Leaderboards_C_ExecuteUbergraph_WBP_Ranked_Leaderboards;

// Function WBP_Ranked_Leaderboards.WBP_Ranked_Leaderboards_C.SelectLeaderboardWithTag
// 0x000C (0x000C - 0x0000)
struct WBP_Ranked_Leaderboards_C_SelectLeaderboardWithTag final
{
public:
	struct FGameplayTag                           InLeaderboardTag;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SelectTabByID_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SelectTabByID_ReturnValue_1;              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_Leaderboards_C_SelectLeaderboardWithTag;

// Function WBP_Ranked_Leaderboards.WBP_Ranked_Leaderboards_C.GetSelectedLeaderboard
// 0x0010 (0x0010 - 0x0000)
struct WBP_Ranked_Leaderboards_C_GetSelectedLeaderboard final
{
public:
	class UVM_Leaderboard_C*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_Leaderboards_C_GetSelectedLeaderboard;

// Function WBP_Ranked_Leaderboards.WBP_Ranked_Leaderboards_C.GetTextForTabId
// 0x0020 (0x0020 - 0x0000)
struct WBP_Ranked_Leaderboards_C_GetTextForTabId final
{
public:
	class FName                                   InTabId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   TabText;                                           // 0x0008(0x0010)(Parm, OutParm)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_Leaderboards_C_GetTextForTabId;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
