#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Clan

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Clan.WBP_Clan_C
// 0x00A0 (0x05C8 - 0x0528)
class UWBP_Clan_C final : public UTyrActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Clan_TerritoryScans_Progress_C*    TerritoryScans_Progress;                           // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Selector_Segmented_C*              Sort_Selector;                                     // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTyrListView*                           Members_ListView;                                  // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockIcon;                                          // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Icon_C*                     ClansInfo_Button;                                  // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Icon_C*                     ClanSettings_Button;                               // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Text_Icon_C*                ClanCode_Button;                                   // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Clan_Chat_C*                       Chat_Embedded;                                     // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVM_Clan_C*                             VM_Clan;                                           // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTextBlock*                             ClanName_Text;                                     // 0x0578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       MemberCount_Text;                                  // 0x0580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsClaimScansButtonEnabled;                        // 0x0588(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ClaimScansButtonLabel;                             // 0x0590(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           ClaimScansButtonRefreshHandle;                     // 0x05A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTyrActionBarTrayHandle                ReadyToClaimWidgetHandle;                          // 0x05A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsClanWidgetActive;                               // 0x05C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void __289f7722_4e1d_d040_c13b_61b208a547f3();
	void AfterPush_0F288AC74E7EB6F44998409C47A84D38(class UCommonActivatableWidget* UserWidget);
	void AfterPush_2B8B03594666CD0EF7F55392A96B6FE8(class UCommonActivatableWidget* UserWidget);
	void BeforePush_0F288AC74E7EB6F44998409C47A84D38(class UCommonActivatableWidget* UserWidget);
	void BeforePush_2B8B03594666CD0EF7F55392A96B6FE8(class UCommonActivatableWidget* UserWidget);
	void BndEvt__WBP_Clan_ClanCode_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Clan_ClanSettings_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Clan_ClansInfo_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Destruct();
	void ExecuteUbergraph_WBP_Clan(int32 EntryPoint);
	void InitializeFromViewModel(class UVM_Clan_C* InViewModel);
	void InputAction_DT_InputActions_Clans_ClaimScans_Clicked();
	void InputAction_DT_InputActions_Clans_JoinClanDiscord_Clicked();
	void InputAction_DT_InputActions_Clans_ReauthorizeDiscord_Clicked();
	void InputAction_DT_InputActions_Clans_RelinkClanDiscord_Clicked();
	void InputAction_DT_InputActions_Clans_ViewClanOptions_Clicked();
	void InputAction_DT_InputActions_Clans_ViewClansInfo_Clicked();
	void OnReadyToClaimWidgetConstruct(class UUserWidget* ContentWidget);
	void OnUnclaimedScansChanged(class UObject* Object, const struct FFieldNotificationId& Field);
	void RefreshClaimScansButton();
	void RefreshReadyToClaimTrayWidget();
	void SetClanWidgetActive(bool bInIsActive);
	void SetVM_Clan(class UVM_Clan_C* ViewModel);

	struct FTyrInputActionListenParam __09a78331_4d39_7d16_ca31_b095df43b5df_SourceToDest() const;
	struct FTyrInputActionLabelParam __117e3681_41cf_01a7_9f09_dd87181e06b2_SourceToDest() const;
	struct FTyrInputActionEnableParam __43c373fe_4a18_10be_8acc_c2a2c1d76681_SourceToDest() const;
	struct FTyrInputActionListenParam __46a4b2c5_4a7c_d8d9_96a9_0e806ce56339_SourceToDest() const;
	struct FTyrInputActionListenParam __b0b9ec36_4ed5_1019_68c3_958c995cc074_SourceToDest() const;
	ESlateVisibility __b9b328e1_4d98_3ab8_f24c_f8bceebbc213_SourceToDest() const;
	struct FTyrInputActionListenParam __fc2f30da_41f1_880c_b49a_bfb7fe8327ce_SourceToDest() const;
	ESlateVisibility __fe82e588_44e0_69a7_5cbd_8fb388dd946f_SourceToDest() const;
	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Clan_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Clan_C")
	}
	static class UWBP_Clan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Clan_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Clan_C;

SDK_NAMESPACE_END
