#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Lobby_Loadout_Entry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Lobby_Loadout_Entry.WBP_Lobby_Loadout_Entry_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Lobby_Loadout_Entry_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Entry_C_BP_OnItemExpansionChanged;

// Function WBP_Lobby_Loadout_Entry.WBP_Lobby_Loadout_Entry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Lobby_Loadout_Entry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Entry_C_BP_OnItemSelectionChanged;

// Function WBP_Lobby_Loadout_Entry.WBP_Lobby_Loadout_Entry_C.ExecuteUbergraph_WBP_Lobby_Loadout_Entry
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_Lobby_Loadout_Entry_C_ExecuteUbergraph_WBP_Lobby_Loadout_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Vehicle_Loadout_C*                  K2Node_DynamicCast_AsVM_Vehicle_Loadout;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x0034(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0048(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0058(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x0068(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_4;       // 0x0078(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_5;       // 0x0088(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0098(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x00A8(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x00B8(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue_3;       // 0x00C8(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue_4;       // 0x00D8(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue_5;       // 0x00E8(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Entry_C_ExecuteUbergraph_WBP_Lobby_Loadout_Entry;

// Function WBP_Lobby_Loadout_Entry.WBP_Lobby_Loadout_Entry_C.GetAmmoIcon
// 0x0038 (0x0038 - 0x0000)
struct WBP_Lobby_Loadout_Entry_C_GetAmmoIcon final
{
public:
	int32                                         InSlot;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0008(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	class UVM_Vehicle_Loadout_LockableSlot_C*     CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Entry_C_GetAmmoIcon;

// Function WBP_Lobby_Loadout_Entry.WBP_Lobby_Loadout_Entry_C.GetComponentIcon
// 0x0038 (0x0038 - 0x0000)
struct WBP_Lobby_Loadout_Entry_C_GetComponentIcon final
{
public:
	int32                                         InSlot;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0008(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	class UVM_Vehicle_Loadout_LockableSlot_C*     CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Entry_C_GetComponentIcon;

// Function WBP_Lobby_Loadout_Entry.WBP_Lobby_Loadout_Entry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Loadout_Entry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Entry_C_OnListItemObjectSet;

// Function WBP_Lobby_Loadout_Entry.WBP_Lobby_Loadout_Entry_C.SetVM_Vehicle_Loadout
// 0x0028 (0x0028 - 0x0000)
struct WBP_Lobby_Loadout_Entry_C_SetVM_Vehicle_Loadout final
{
public:
	class UVM_Vehicle_Loadout_C*                  ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Entry_C_SetVM_Vehicle_Loadout;

// Function WBP_Lobby_Loadout_Entry.WBP_Lobby_Loadout_Entry_C.UpdateSlots
// 0x0030 (0x0030 - 0x0000)
struct WBP_Lobby_Loadout_Entry_C_UpdateSlots final
{
public:
	class UVM_Vehicle_Loadout_C*                  InVehicleLoadout;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Loadout_LockableSlot_C*     CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Loadout_LockableSlot_C*     CallFunc_Array_Get_Item_1;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Loadout_LockableSlot_C*     CallFunc_Array_Get_Item_2;                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Loadout_LockableSlot_C*     CallFunc_Array_Get_Item_3;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Loadout_LockableSlot_C*     CallFunc_Array_Get_Item_4;                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Entry_C_UpdateSlots;

// Function WBP_Lobby_Loadout_Entry.WBP_Lobby_Loadout_Entry_C.__a6bf6a8e-413c-168f-2802-eba6d07e43f1_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Lobby_Loadout_Entry_C___a6bf6a8e_413c_168f_2802_eba6d07e43f1_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Entry_C___a6bf6a8e_413c_168f_2802_eba6d07e43f1_SourceToDest;

// Function WBP_Lobby_Loadout_Entry.WBP_Lobby_Loadout_Entry_C.__eeefb36c-4bf2-2506-af29-4792efe2fedf_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Lobby_Loadout_Entry_C___eeefb36c_4bf2_2506_af29_4792efe2fedf_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Entry_C___eeefb36c_4bf2_2506_af29_4792efe2fedf_SourceToDest;

// Function WBP_Lobby_Loadout_Entry.WBP_Lobby_Loadout_Entry_C.FormatEquippedSlotName
// 0x0088 (0x0088 - 0x0000)
struct WBP_Lobby_Loadout_Entry_C_FormatEquippedSlotName final
{
public:
	class FText                                   InSlotName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0010)()
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Entry_C_FormatEquippedSlotName;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
