#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Ranked_Leaderboard_Entry

#include "Basic.hpp"

#include "Tyr_structs.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Ranked_Leaderboard_Entry.WBP_Ranked_Leaderboard_Entry_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Ranked_Leaderboard_Entry_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_Leaderboard_Entry_C_BP_OnItemExpansionChanged;

// Function WBP_Ranked_Leaderboard_Entry.WBP_Ranked_Leaderboard_Entry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Ranked_Leaderboard_Entry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_Leaderboard_Entry_C_BP_OnItemSelectionChanged;

// Function WBP_Ranked_Leaderboard_Entry.WBP_Ranked_Leaderboard_Entry_C.ExecuteUbergraph_WBP_Ranked_Leaderboard_Entry
// 0x0010 (0x0010 - 0x0000)
struct WBP_Ranked_Leaderboard_Entry_C_ExecuteUbergraph_WBP_Ranked_Leaderboard_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_Leaderboard_Entry_C_ExecuteUbergraph_WBP_Ranked_Leaderboard_Entry;

// Function WBP_Ranked_Leaderboard_Entry.WBP_Ranked_Leaderboard_Entry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Ranked_Leaderboard_Entry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_Leaderboard_Entry_C_OnListItemObjectSet;

// Function WBP_Ranked_Leaderboard_Entry.WBP_Ranked_Leaderboard_Entry_C.SetVM_Leaderboard_Player
// 0x0028 (0x0028 - 0x0000)
struct WBP_Ranked_Leaderboard_Entry_C_SetVM_Leaderboard_Player final
{
public:
	class UVM_Leaderboard_Player_C*               ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_Leaderboard_Entry_C_SetVM_Leaderboard_Player;

// Function WBP_Ranked_Leaderboard_Entry.WBP_Ranked_Leaderboard_Entry_C.__3e3de421-44c8-ff4d-1af6-f48c0af62d21_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Ranked_Leaderboard_Entry_C___3e3de421_44c8_ff4d_1af6_f48c0af62d21_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_Leaderboard_Entry_C___3e3de421_44c8_ff4d_1af6_f48c0af62d21_SourceToDest;

// Function WBP_Ranked_Leaderboard_Entry.WBP_Ranked_Leaderboard_Entry_C.__a85e9d44-4d26-03a6-1ace-319ab171d0b6_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Ranked_Leaderboard_Entry_C___a85e9d44_4d26_03a6_1ace_319ab171d0b6_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_Leaderboard_Entry_C___a85e9d44_4d26_03a6_1ace_319ab171d0b6_SourceToDest;

// Function WBP_Ranked_Leaderboard_Entry.WBP_Ranked_Leaderboard_Entry_C.__ebdd3db2-44dc-6122-6f71-10ab7c3a1c05_SourceToDest
// 0x0018 (0x0018 - 0x0000)
struct WBP_Ranked_Leaderboard_Entry_C___ebdd3db2_44dc_6122_6f71_10ab7c3a1c05_SourceToDest final
{
public:
	struct FTyrMaterialScalarParam                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FTyrMaterialScalarParam                CallFunc_ToScalarMaterialParam__Boolean__ReturnValue; // 0x000C(0x000C)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Ranked_Leaderboard_Entry_C___ebdd3db2_44dc_6122_6f71_10ab7c3a1c05_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
