#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Home

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Home.WBP_Home_C
// 0x00F0 (0x0618 - 0x0528)
class UWBP_Home_C final : public UTyrActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Home_LocalPlayer_C*                WBP_Home_LocalPlayer;                              // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               UpcomingPlaytests;                                 // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SecretDebugButton;                                 // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlaytestSchedule;                                  // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GameModeBG;                                        // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       ContentSwitcher;                                   // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HorizontalTabList_C*               ContentNav;                                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AnnouncementTitle_Text;                            // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ActionBar_C*                       ActionBar;                                         // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GameModeBGSelected;                                // 0x0580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       JoinMM;                                            // 0x0588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CancelMM;                                          // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MatchFound;                                        // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutBG;                                         // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutDarkBG;                                     // 0x05A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVM_Matchmaking_C*                      VM_Matchmaking;                                    // 0x05B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVM_MainMenu_C*                         VM_MainMenu;                                       // 0x05B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           TopBar;                                            // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  FoundMatchListener;                                // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  MatchmakingNoRulesListener;                        // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInputBlocked;                                   // 0x05D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D9[0x7];                                      // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Play_C*                            PlayPanel;                                         // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Vehicles_C*                        VehiclesPanel;                                     // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               WBP_MatchmakingNotification;                       // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_BattleHistory_C*                   BattlesPanel;                                      // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   BackActionLabel;                                   // 0x0600(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAsyncAction_ListenForGameplayMessage*  PlaytestTimesUpdatedListener;                      // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AfterPush_967DD93D4FB8AAC901FEFC9C00C2CE64(class UCommonActivatableWidget* UserWidget);
	void AfterPush_9DB6236D42478CD5F6A1F1808563D50F(class UCommonActivatableWidget* UserWidget);
	void BeforePush_967DD93D4FB8AAC901FEFC9C00C2CE64(class UCommonActivatableWidget* UserWidget);
	void BeforePush_9DB6236D42478CD5F6A1F1808563D50F(class UCommonActivatableWidget* UserWidget);
	void BndEvt__WBP_Home_Button_67_K2Node_ComponentBoundEvent_18_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Home_ContentNav_K2Node_ComponentBoundEvent_0_OnTabContentCreated__DelegateSignature(class FName TabId, class UCommonUserWidget* TabWidget);
	void BndEvt__WBP_Home_ContentNav_K2Node_ComponentBoundEvent_2_OnTabSelected__DelegateSignature(class FName TabId);
	void BndEvt__WBP_Home_ContentNav_K2Node_ComponentBoundEvent_3_OnTabButtonCreation__DelegateSignature(class FName TabId, class UCommonButtonBase* TabButton);
	void BP_OnActivated();
	void BP_OnDeactivated();
	bool BP_OnHandleBackAction();
	bool CanClearVehicleBreadcrumbs();
	void Close();
	void Construct();
	void ExecuteUbergraph_WBP_Home(int32 EntryPoint);
	void FadeInGameModeBackground();
	void GetAnnoucementVisibility(TArray<struct FRegionData>& InRegionData, ESlateVisibility* OutVis);
	bool HandleBackAction();
	void InputAction_DT_InputActions_Play_OpenProfileScreen_Clicked();
	void On_FoundMatch_Message();
	void OnInitialized();
	void OnMessageReceived_1D3C8D874A07F4A91FF6B5A2CB772572(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_BA459BD045FA956C6C2C53958C0AD7DD(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void ReturnVehiclesContentToSelectionGrid();
	void ShowBackground(bool bInShouldShow);
	void ShowBackgroundDarkenEffect(bool bInShouldShow);
	void UpdateAnnouncementBar();
	void UpdateGameMode(class UVM_GameMode_C* InGameMode);
	void UpdateIsMMVisuals(bool bInIsMatchmaking);

	ESlateVisibility __b11b0edf_47e4_e1e7_af69_7880d42da235_SourceToDest() const;
	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Home_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Home_C")
	}
	static class UWBP_Home_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Home_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Home_C;

SDK_NAMESPACE_END
