#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ArmorViewer_PenDetail

#include "Basic.hpp"

#include "UMG_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_ArmorViewer_PenDetail.WBP_ArmorViewer_PenDetail_C.SetVM_ArmorViewer_HitResult
// 0x0028 (0x0028 - 0x0000)
struct WBP_ArmorViewer_PenDetail_C_SetVM_ArmorViewer_HitResult final
{
public:
	class UVM_ArmorViewer_HitResult_C*            ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ArmorViewer_PenDetail_C_SetVM_ArmorViewer_HitResult;

// Function WBP_ArmorViewer_PenDetail.WBP_ArmorViewer_PenDetail_C.__15f82c58-4272-6ec5-c3f7-7198977944e0_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_ArmorViewer_PenDetail_C___15f82c58_4272_6ec5_c3f7_7198977944e0_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ArmorViewer_PenDetail_C___15f82c58_4272_6ec5_c3f7_7198977944e0_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
