#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Vehicle_Detail

#include "Basic.hpp"

#include "Tyr_structs.hpp"
#include "FieldNotification_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "E_Button_StyleType_structs.hpp"
#include "InputCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.BndEvt__WBP_Vehicle_Detail_Btn_Overview_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Overview_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Overview_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.BndEvt__WBP_Vehicle_Detail_Btn_Overview_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Overview_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Overview_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.BndEvt__WBP_Vehicle_Detail_Btn_Overview_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Overview_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Overview_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.BndEvt__WBP_Vehicle_Detail_Btn_Overview_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Overview_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Overview_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.BndEvt__WBP_Vehicle_Detail_Btn_Return_K2Node_ComponentBoundEvent_23_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Return_K2Node_ComponentBoundEvent_23_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Return_K2Node_ComponentBoundEvent_23_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.BndEvt__WBP_Vehicle_Detail_Btn_Return_K2Node_ComponentBoundEvent_25_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Return_K2Node_ComponentBoundEvent_25_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Return_K2Node_ComponentBoundEvent_25_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.BndEvt__WBP_Vehicle_Detail_Btn_Return_K2Node_ComponentBoundEvent_26_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Return_K2Node_ComponentBoundEvent_26_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Return_K2Node_ComponentBoundEvent_26_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.BndEvt__WBP_Vehicle_Detail_Btn_Stats_K2Node_ComponentBoundEvent_13_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Stats_K2Node_ComponentBoundEvent_13_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Stats_K2Node_ComponentBoundEvent_13_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.BndEvt__WBP_Vehicle_Detail_Btn_Stats_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Stats_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Stats_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.BndEvt__WBP_Vehicle_Detail_Btn_Stats_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Stats_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Stats_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.BndEvt__WBP_Vehicle_Detail_Btn_Stats_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Stats_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_Btn_Stats_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.BndEvt__WBP_Vehicle_Detail_TrackBooster_Button_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_TrackBooster_Button_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_TrackBooster_Button_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.BndEvt__WBP_Vehicle_Detail_TrackBooster_Button_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_TrackBooster_Button_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_TrackBooster_Button_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.BndEvt__WBP_Vehicle_Detail_TrackBooster_Button_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_TrackBooster_Button_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_BndEvt__WBP_Vehicle_Detail_TrackBooster_Button_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_Vehicle_Detail_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_BP_OnHandleBackAction;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.ExecuteUbergraph_WBP_Vehicle_Detail
// 0x02C0 (0x02C0 - 0x0000)
struct WBP_Vehicle_Detail_C_ExecuteUbergraph_WBP_Vehicle_Detail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Alpha_Info_C*                      CallFunc_PushContentToLayerForPlayer_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonGroupBase*                 CallFunc_SpawnObject_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0030(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVM_Vehicle_Purchase_C*                 CallFunc_SpawnObject_ReturnValue_1;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0048(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId;             // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_1;           // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_2;           // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue; // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue;         // 0x008C(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x009C(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00AC(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TickReturnCamera_bReturnFinished;         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_3;           // 0x00F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_4;           // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_5;           // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array_1;                          // 0x0120(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue_1; // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_13;              // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_12;              // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpEaseInOut_ReturnValue;             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_11;              // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVM_VehicleViewer_C*                    CallFunc_GetVehicleViewerViewModel_ViewModel;      // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_MainMenu_C*                         CallFunc_GetMainMenuViewModel_ViewModel;           // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_MainMenu_C*                         CallFunc_GetMainMenuViewModel_ViewModel_1;         // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_MainMenu_C*                         CallFunc_GetMainMenuViewModel_ViewModel_2;         // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0190(0x0060)(HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0200(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_10;              // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array_2;                          // 0x0218(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_9;               // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_8;               // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_7;               // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_6;               // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_5;               // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_6;           // 0x0278(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_7;           // 0x0280(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array_3;                          // 0x0288(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue_2; // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_TickReturnCamera_InDeltaTime_ImplicitCast; // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast_1;                  // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_ExecuteUbergraph_WBP_Vehicle_Detail;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.OnMouseButtonDown
// 0x0330 (0x0330 - 0x0000)
struct WBP_Vehicle_Detail_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0170(0x00B8)()
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0228(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0240(0x00B8)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetPitchAndYaw_Yaw;                       // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetPitchAndYaw_Pitch;                     // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue; // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ScreenToWidgetLocal_LocalCoordinate;      // 0x0320(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_OnMouseButtonDown;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.OnMouseButtonUp
// 0x02E8 (0x02E8 - 0x0000)
struct WBP_Vehicle_Detail_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0170(0x00B8)()
	bool                                          CallFunc_IsAtRestingPitchAndYaw_ReturnValue;       // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0230(0x00B8)()
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_OnMouseButtonUp;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.OnMouseMove
// 0x0390 (0x0390 - 0x0000)
struct WBP_Vehicle_Detail_C_OnMouseMove final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B8(0x00B8)(Parm, OutParm, ReturnParm)
	double                                        Loc_PitchDelta;                                    // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Loc_YawDelta;                                      // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Loc_MousePositionLocal;                            // 0x0180(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue; // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0198(0x00B8)()
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue; // 0x02B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x02C0(0x00B8)()
	struct FVector2D                              CallFunc_ScreenToWidgetLocal_LocalCoordinate;      // 0x0378(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_OnMouseMove;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Vehicle_Detail_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_PreConstruct;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.SetSelectedIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_Vehicle_Detail_C_SetSelectedIndex final
{
public:
	int32                                         InSelectedPilotIndex;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_SetSelectedIndex;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.SetViewModels
// 0x0018 (0x0018 - 0x0000)
struct WBP_Vehicle_Detail_C_SetViewModels final
{
public:
	class UVM_Vehicle_C*                          InVehicle;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Details_C*                  InVehicleDetails;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Levels_C*                   InVehicleLevels;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_SetViewModels;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.SetVM_Vehicle
// 0x0028 (0x0028 - 0x0000)
struct WBP_Vehicle_Detail_C_SetVM_Vehicle final
{
public:
	class UVM_Vehicle_C*                          ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_SetVM_Vehicle;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.SetVM_Vehicle_Details
// 0x0028 (0x0028 - 0x0000)
struct WBP_Vehicle_Detail_C_SetVM_Vehicle_Details final
{
public:
	class UVM_Vehicle_Details_C*                  ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_SetVM_Vehicle_Details;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.SetVM_Vehicle_Levels
// 0x0028 (0x0028 - 0x0000)
struct WBP_Vehicle_Detail_C_SetVM_Vehicle_Levels final
{
public:
	class UVM_Vehicle_Levels_C*                   ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_SetVM_Vehicle_Levels;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.SpawnVehicle
// 0x0028 (0x0028 - 0x0000)
struct WBP_Vehicle_Detail_C_SpawnVehicle final
{
public:
	class UVM_VehicleViewer_C*                    Loc_VehicleViewer;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuCameraManager_C*                K2Node_DynamicCast_AsBP_Menu_Camera_Manager;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_VehicleViewer_C*                    CallFunc_GetVehicleViewerViewModel_ViewModel;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_SpawnVehicle;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Vehicle_Detail_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_Tick;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.TickReturnCamera
// 0x0040 (0x0040 - 0x0000)
struct WBP_Vehicle_Detail_C_TickReturnCamera final
{
public:
	double                                        InDeltaTime;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReturnFinished;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetRestingPitchAndYaw_Yaw;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetRestingPitchAndYaw_Pitch;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Ease_ReturnValue;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Ease_ReturnValue_1;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_TickReturnCamera;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.__025dd191-4dec-4271-2e34-8c9000f5227f_SourceToDest
// 0x0040 (0x0040 - 0x0000)
struct WBP_Vehicle_Detail_C___025dd191_4dec_4271_2e34_8c9000f5227f_SourceToDest final
{
public:
	struct FTyrInputActionListenParam             ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FTyrInputActionListenParam             CallFunc_ToInputActionListenParam_ReturnValue;     // 0x0020(0x0020)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C___025dd191_4dec_4271_2e34_8c9000f5227f_SourceToDest;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.__0a003ae1-4eeb-5987-4073-419e8326d3f9_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Vehicle_Detail_C___0a003ae1_4eeb_5987_4073_419e8326d3f9_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C___0a003ae1_4eeb_5987_4073_419e8326d3f9_SourceToDest;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.__1cc16b33-42b8-b296-3527-329788978bf9_SourceToDest
// 0x0040 (0x0040 - 0x0000)
struct WBP_Vehicle_Detail_C___1cc16b33_42b8_b296_3527_329788978bf9_SourceToDest final
{
public:
	struct FTyrInputActionListenParam             ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FTyrInputActionListenParam             CallFunc_ToInputActionListenParam_ReturnValue;     // 0x0020(0x0020)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C___1cc16b33_42b8_b296_3527_329788978bf9_SourceToDest;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.__265d1043-4041-d6ba-46c0-189dd27bc9f2_SourceToDest
// 0x0040 (0x0040 - 0x0000)
struct WBP_Vehicle_Detail_C___265d1043_4041_d6ba_46c0_189dd27bc9f2_SourceToDest final
{
public:
	struct FTyrInputActionBreadcrumbParam         ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FTyrInputActionBreadcrumbParam         CallFunc_ToInputActionBreadcrumbParam_ReturnValue; // 0x0020(0x0020)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C___265d1043_4041_d6ba_46c0_189dd27bc9f2_SourceToDest;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.__37a369ac-47fd-abeb-8884-0b805eb9acef_SourceToDest
// 0x0048 (0x0048 - 0x0000)
struct WBP_Vehicle_Detail_C___37a369ac_47fd_abeb_8884_0b805eb9acef_SourceToDest final
{
public:
	struct FTyrInputActionListenParam             ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	bool                                          CallFunc_IsPurchasable_bIsPurchaseable;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrInputActionListenParam             CallFunc_ToInputActionListenParam_ReturnValue;     // 0x0028(0x0020)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C___37a369ac_47fd_abeb_8884_0b805eb9acef_SourceToDest;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.__47eff185-403e-f3fd-a2f2-85b3f4093f3d_SourceToDest
// 0x0060 (0x0060 - 0x0000)
struct WBP_Vehicle_Detail_C___47eff185_403e_f3fd_a2f2_85b3f4093f3d_SourceToDest final
{
public:
	struct FTyrInputActionLabelParam              ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_GetUnlockButtonLabel_ReturnValue;         // 0x0028(0x0010)()
	struct FTyrInputActionLabelParam              CallFunc_ToInputActionLabelParam_ReturnValue;      // 0x0038(0x0028)()
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C___47eff185_403e_f3fd_a2f2_85b3f4093f3d_SourceToDest;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.__65ea2534-4be4-c3f5-a404-a8874dbec753_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Vehicle_Detail_C___65ea2534_4be4_c3f5_a404_a8874dbec753_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C___65ea2534_4be4_c3f5_a404_a8874dbec753_SourceToDest;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.__6d9f886a-4d82-dccb-cf07-6d900584d4e3_SourceToDest
// 0x0048 (0x0048 - 0x0000)
struct WBP_Vehicle_Detail_C___6d9f886a_4d82_dccb_cf07_6d900584d4e3_SourceToDest final
{
public:
	struct FTyrInputActionListenParam             ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	bool                                          CallFunc_IsNotUnlocked_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrInputActionListenParam             CallFunc_ToInputActionListenParam_ReturnValue;     // 0x0028(0x0020)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C___6d9f886a_4d82_dccb_cf07_6d900584d4e3_SourceToDest;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.__b989c5f0-459d-ec05-c915-2abda9e07afe_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Vehicle_Detail_C___b989c5f0_459d_ec05_c915_2abda9e07afe_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C___b989c5f0_459d_ec05_c915_2abda9e07afe_SourceToDest;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.__be432f5d-45c3-d7fe-306c-f79471809b6f_SourceToDest
// 0x0048 (0x0048 - 0x0000)
struct WBP_Vehicle_Detail_C___be432f5d_45c3_d7fe_306c_f79471809b6f_SourceToDest final
{
public:
	struct FTyrInputActionListenParam             ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	bool                                          CallFunc_HasAnyOfConsumable_CanApply;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasReachedMaxLevel_bIsAtMaxLevel;         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrInputActionListenParam             CallFunc_ListenForPilotBoosterInput_ReturnValue;   // 0x0028(0x0020)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C___be432f5d_45c3_d7fe_306c_f79471809b6f_SourceToDest;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.__c7bf5a76-4a3c-fe9e-0e47-67b149404193_SourceToDest
// 0x0048 (0x0048 - 0x0000)
struct WBP_Vehicle_Detail_C___c7bf5a76_4a3c_fe9e_0e47_67b149404193_SourceToDest final
{
public:
	struct FTyrInputActionListenParam             ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	bool                                          CallFunc_IsNotUnlocked_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrInputActionListenParam             CallFunc_ToInputActionListenParam_ReturnValue;     // 0x0028(0x0020)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C___c7bf5a76_4a3c_fe9e_0e47_67b149404193_SourceToDest;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.__e76ff52e-4764-d6d2-9915-d0b7d64d1f0f_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Vehicle_Detail_C___e76ff52e_4764_d6d2_9915_d0b7d64d1f0f_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C___e76ff52e_4764_d6d2_9915_d0b7d64d1f0f_SourceToDest;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.__f1ed6777-422e-9d75-cd6a-7db21b77b928_SourceToDest
// 0x0040 (0x0040 - 0x0000)
struct WBP_Vehicle_Detail_C___f1ed6777_422e_9d75_cd6a_7db21b77b928_SourceToDest final
{
public:
	struct FTyrInputActionListenParam             ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FTyrInputActionListenParam             CallFunc_ToInputActionListenParam_ReturnValue;     // 0x0020(0x0020)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C___f1ed6777_422e_9d75_cd6a_7db21b77b928_SourceToDest;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.__ff0a807a-415c-a1fe-6272-968f01c15d1b_SourceToDest
// 0x0010 (0x0010 - 0x0000)
struct WBP_Vehicle_Detail_C___ff0a807a_415c_a1fe_6272_968f01c15d1b_SourceToDest final
{
public:
	class UTexture2D*                             Icon;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_ToTankClassIcon_Icon;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C___ff0a807a_415c_a1fe_6272_968f01c15d1b_SourceToDest;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_Detail_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_BP_GetDesiredFocusTarget;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.FormatAbilityName
// 0x0088 (0x0088 - 0x0000)
struct WBP_Vehicle_Detail_C_FormatAbilityName final
{
public:
	class FText                                   InAbilityName;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0010)()
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_FormatAbilityName;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.FormatVehicleCost
// 0x0088 (0x0088 - 0x0000)
struct WBP_Vehicle_Detail_C_FormatVehicleCost final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OutText;                                           // 0x0008(0x0010)(Parm, OutParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0010)()
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_FormatVehicleCost;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.GetPilotBoosterButtonType
// 0x000A (0x000A - 0x0000)
struct WBP_Vehicle_Detail_C_GetPilotBoosterButtonType final
{
public:
	bool                                          bInHasReachedMaxLevel;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInHasVehicleUnlocked;                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInHasBoosters;                                    // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Button_StyleType                            ButtonType;                                        // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Button_StyleType                            Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Button_StyleType                            Temp_byte_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Button_StyleType                            K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_GetPilotBoosterButtonType;

// Function WBP_Vehicle_Detail.WBP_Vehicle_Detail_C.ListenForPilotBoosterInput
// 0x0068 (0x0068 - 0x0000)
struct WBP_Vehicle_Detail_C_ListenForPilotBoosterInput final
{
public:
	bool                                          bInHasReachedMaxLevel;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInHasVehicleUnlocked;                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInHasBoosters;                                    // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrInputActionListenParam             ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FTyrInputActionRowHandle               K2Node_MakeStruct_TyrInputActionRowHandle;         // 0x0028(0x0018)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrInputActionListenParam             K2Node_MakeStruct_TyrInputActionListenParam;       // 0x0048(0x0020)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_C_ListenForPilotBoosterInput;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
