#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cosmetics_Skin_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C
// 0x0090 (0x1620 - 0x1590)
class UWBP_Cosmetics_Skin_Button_C final : public UTyrButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHoverEquipped;                                   // 0x1598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHoverUnequipped;                                 // 0x15A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnEquipped;                                        // 0x15A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVM_Cosmetics_Skin_C*                   VM_Cosmetics_Skin;                                 // 0x15B0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTyrLazyImage*                          Preview_Image;                                     // 0x15B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SkinAvailability_Switcher;                         // 0x15C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 RarityIndicator_Left;                              // 0x15C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 RarityIndicator_Corner;                            // 0x15D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         RarityIndicator;                                   // 0x15D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 EquippedBacker;                                    // 0x15E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       UnlockAmountLabel_Text;                            // 0x15E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTyrLazyImage*                          Stroke_Backer;                                     // 0x15F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               CornerDots;                                        // 0x15F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 DotGrid;                                           // 0x1600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 RarityIndicator_Right;                             // 0x1608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 RarityBacker;                                      // 0x1610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 StrokeLeft;                                        // 0x1618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnDeselected();
	void BP_OnEntryReleased();
	void BP_OnHovered();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnSelected();
	void BP_OnUnhovered();
	void ExecuteUbergraph_WBP_Cosmetics_Skin_Button(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void SetVM_Cosmetics_Skin(class UVM_Cosmetics_Skin_C* ViewModel);

	void __0f64e73d_478f_96e7_10e0_b7ab7ee53633_SourceToDest(ESlateVisibility* Visibility_0) const;
	struct FLinearColor __3466fa9c_4005_9fdf_730c_4b9ab1451543_SourceToDest() const;
	struct FLinearColor __49b5fc53_4cde_31a5_5b78_a8805cfa6cf1_SourceToDest() const;
	ESlateVisibility __57c2ded0_4692_36c7_ebe2_df838e6d9567_SourceToDest() const;
	struct FLinearColor __a4eaf332_4a61_1cdc_3365_16b3f2d84f82_SourceToDest() const;
	struct FTyrMaterialScalarParam __c4bee7d9_4398_c096_3ccb_0a99ada4fd70_SourceToDest() const;
	int32 __cca782b5_4fac_bbea_7270_19a51321da48_SourceToDest() const;
	void __ConversionFunction34cc10a6_e596_3e9c_b777_773d50a3c2fb(ESlateVisibility* Visibility_0) const;
	ESlateVisibility __ConversionFunction379ff6fb_a221_3614_b240_a79ee5f3e301() const;
	struct FLinearColor __ConversionFunction96ad37b3_8207_3f5e_829e_40100ef4b428() const;
	struct FLinearColor __ConversionFunction99251ad6_aa73_383d_9c8b_b6e9b44378c3() const;
	struct FLinearColor __ConversionFunctioncfc73f54_b341_306b_9ea8_22494b8841c4() const;
	struct FTyrMaterialVectorParam __d40eac64_41be_716b_e92e_51b39bb1c071_SourceToDest() const;
	struct FTyrMaterialScalarParam __f8024e13_49fb_dfe9_43e4_44af13f9c712_SourceToDest() const;
	int32 ToSkinAvailabilityIndex(bool bInEquipped, bool bInOwned, bool bInCanPurchase) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Cosmetics_Skin_Button_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Cosmetics_Skin_Button_C")
	}
	static class UWBP_Cosmetics_Skin_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Cosmetics_Skin_Button_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Cosmetics_Skin_Button_C;

SDK_NAMESPACE_END
