#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Lobby_Loadout_SlotDetail_KeystoneNode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Lobby_Loadout_SlotDetail_KeystoneNode.WBP_Lobby_Loadout_SlotDetail_KeystoneNode_C
// 0x0028 (0x0368 - 0x0340)
class UWBP_Lobby_Loadout_SlotDetail_KeystoneNode_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       SlotName_Text;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Loadout_TechTreeSlot_C*            Slot_Icon;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   NodeDescription_Text;                              // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVM_TechTree_C*                         VM_TechTree;                                       // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void SetVM_TechTree(class UVM_TechTree_C* ViewModel);
	void SetViewModel(class UVM_TechTree_C* InViewModel);
	void PreConstruct(bool IsDesignTime_PreConstruct);
	void ExecuteUbergraph_WBP_Lobby_Loadout_SlotDetail_KeystoneNode(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Lobby_Loadout_SlotDetail_KeystoneNode_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Lobby_Loadout_SlotDetail_KeystoneNode_C")
	}
	static class UWBP_Lobby_Loadout_SlotDetail_KeystoneNode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Lobby_Loadout_SlotDetail_KeystoneNode_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Lobby_Loadout_SlotDetail_KeystoneNode_C;

SDK_NAMESPACE_END
