#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Vehicle_Button

#include "Basic.hpp"

#include "Tyr_structs.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Vehicle_Button.WBP_Vehicle_Button_C.SetCanSelect
// 0x0002 (0x0002 - 0x0000)
struct WBP_Vehicle_Button_C_SetCanSelect final
{
public:
	bool                                          bInCanSelect;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Button_C_SetCanSelect;

// Function WBP_Vehicle_Button.WBP_Vehicle_Button_C.SetVM_Vehicle
// 0x0028 (0x0028 - 0x0000)
struct WBP_Vehicle_Button_C_SetVM_Vehicle final
{
public:
	class UVM_Vehicle_C*                          ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Button_C_SetVM_Vehicle;

// Function WBP_Vehicle_Button.WBP_Vehicle_Button_C.__83ddf334-4286-cc2b-76b4-af9325d56a71_SourceToDest
// 0x0018 (0x0018 - 0x0000)
struct WBP_Vehicle_Button_C___83ddf334_4286_cc2b_76b4_af9325d56a71_SourceToDest final
{
public:
	struct FTyrMaterialScalarParam                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FTyrMaterialScalarParam                CallFunc_ToScalarMaterialParam__Boolean__ReturnValue; // 0x000C(0x000C)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Vehicle_Button_C___83ddf334_4286_cc2b_76b4_af9325d56a71_SourceToDest;

// Function WBP_Vehicle_Button.WBP_Vehicle_Button_C.__8d98092e-4d0e-e1b5-8546-4180efbc3e0f_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Vehicle_Button_C___8d98092e_4d0e_e1b5_8546_4180efbc3e0f_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Button_C___8d98092e_4d0e_e1b5_8546_4180efbc3e0f_SourceToDest;

// Function WBP_Vehicle_Button.WBP_Vehicle_Button_C.__977201a4-402c-2d62-0237-caa38f21b5a8_SourceToDest
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_Button_C___977201a4_402c_2d62_0237_caa38f21b5a8_SourceToDest final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Button_C___977201a4_402c_2d62_0237_caa38f21b5a8_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
