#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cosmetics_VFX_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Cosmetics_VFX_Button.WBP_Cosmetics_VFX_Button_C
// 0x00B0 (0x1640 - 0x1590)
class UWBP_Cosmetics_VFX_Button_C final : public UTyrButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTyrLazyImage*                          Stroke_Backer;                                     // 0x1598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHoverEquipped;                                   // 0x15A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHoverUnequipped;                                 // 0x15A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnEquipped;                                        // 0x15B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVM_Cosmetics_VFX_C*                    VM_Cosmetics_VFX;                                  // 0x15B8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTyrLazyImage*                          Preview_Image;                                     // 0x15C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetSwitcher*                        VFXInfo_Switcher;                                  // 0x15C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Availability_Switcher;                             // 0x15D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 RarityIndicator_Left;                              // 0x15D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 RarityIndicator_Corner;                            // 0x15E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         RarityIndicator;                                   // 0x15E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 EquippedBacker;                                    // 0x15F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       UnlockAmountLabel_Text;                            // 0x15F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 NoVFX;                                             // 0x1600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               CornerDots;                                        // 0x1608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 DotGrid;                                           // 0x1610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 RarityIndicator_Right;                             // 0x1618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 RarityBacker;                                      // 0x1620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 StrokeLeft;                                        // 0x1628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 StrokeBottom;                                      // 0x1630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnDeselected();
	void BP_OnEntryReleased();
	void BP_OnHovered();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnSelected();
	void BP_OnUnhovered();
	void ExecuteUbergraph_WBP_Cosmetics_VFX_Button(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void SetVM_Cosmetics_VFX(class UVM_Cosmetics_VFX_C* ViewModel);

	struct FLinearColor __1bce5d3f_4ef6_65c9_4b71_e4a0ca5dd4f9_SourceToDest() const;
	struct FLinearColor __2605b33a_4850_a627_4924_16895d286d44_SourceToDest() const;
	int32 __363e15f7_4455_f246_78b7_3f93caa58411_SourceToDest() const;
	struct FLinearColor __7e2bfa82_49a1_cc43_da70_498819d69d14_SourceToDest() const;
	ESlateVisibility __ConversionFunction2a1365b6_dbb4_3881_905b_2477702a7354() const;
	void __ConversionFunction38e15988_6a79_3652_8571_b69f8c846657(ESlateVisibility* Visibility_0) const;
	struct FLinearColor __ConversionFunction4ea220e8_8871_36dc_adda_9f2bd30211c8() const;
	void __ConversionFunction8ec5456a_b51c_3424_83f8_c1d6e071ceaa(ESlateVisibility* Visibility_0) const;
	ESlateVisibility __ConversionFunctionc1a5c1e3_5e28_3f2c_a87c_575d700611b6() const;
	struct FLinearColor __ConversionFunctioncc7bb124_af3f_3cdc_8dae_6d70976fbdd3() const;
	struct FTyrMaterialScalarParam __ConversionFunctiond680fbd8_fa07_370e_9751_e39565661a1c() const;
	ESlateVisibility __ConversionFunctiond81f1270_e875_3f81_8cfb_370b5d675370() const;
	struct FLinearColor __ConversionFunctionfd8fb600_2feb_3631_8a47_37fac365e5f0() const;
	struct FLinearColor __f4372d23_4eb1_56ed_1b17_01bddf1aaf78_SourceToDest() const;
	void __fcbd62bb_488a_26c9_73e6_2ab11b34c666_SourceToDest(ESlateVisibility* Visibility_0) const;
	int32 ToVfxAvailabilityIndex(bool bInEquipped, bool bInOwned, bool bInCanPurchase) const;
	int32 ToVfxInfoIndex(const struct FGameplayTag& InCharmTag) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Cosmetics_VFX_Button_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Cosmetics_VFX_Button_C")
	}
	static class UWBP_Cosmetics_VFX_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Cosmetics_VFX_Button_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Cosmetics_VFX_Button_C;

SDK_NAMESPACE_END
