#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConfirmationDialog_TextInput

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_ConfirmationDialog_classes.hpp"
#include "UMG_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_ConfirmationDialog_TextInput.WBP_ConfirmationDialog_TextInput_C
// 0x0048 (0x05E0 - 0x0598)
class UWBP_ConfirmationDialog_TextInput_C final : public UWBP_ConfirmationDialog_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_ConfirmationDialog_TextInput_C; // 0x0598(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Button_Icon_C*                     Toggle_Button;                                     // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          TextInputField;                                    // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ErrorMessage;                                      // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrencyAvailable_Text;                            // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVM_Dialog_TextInput_C*                 VM_Dialog_TextInput;                               // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UGridPanel*                             UnderButton_GridPanel;                             // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         Toggle_Panel;                                      // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ToggleLabel_Text;                                  // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_ConfirmationDialog_TextInput_TextInputField_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__WBP_ConfirmationDialog_TextInput_Toggle_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void ExecuteUbergraph_WBP_ConfirmationDialog_TextInput(int32 EntryPoint);
	void OnSetupFinished();
	void OnSetupViewModel(class UTyrViewModel* ViewModel);
	void PreConstruct(bool IsDesignTime);
	void RefreshConfirmationButton();
	void SetVM_Dialog_TextInput(class UVM_Dialog_TextInput_C* ViewModel);
	void UpdateEnteredText();

	ESlateVisibility __1bbe2814_45f9_11bb_fa69_e5a26c875f3b_SourceToDest() const;
	ESlateVisibility __a5b8dd96_449a_00c5_accd_81943ec274de_SourceToDest() const;
	ESlateVisibility __ab0382c4_441b_10c8_c1b5_0abb3ec5eb85_SourceToDest() const;
	struct FSlateColor __fabfeb9c_46bb_712c_63f3_b7bbea6a6f70_SourceToDest() const;
	class UWidget* BP_GetDesiredFocusTarget() const;
	bool CanConfirmDialog() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ConfirmationDialog_TextInput_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ConfirmationDialog_TextInput_C")
	}
	static class UWBP_ConfirmationDialog_TextInput_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ConfirmationDialog_TextInput_C>();
	}
};
DUMPER7_ASSERTS_UWBP_ConfirmationDialog_TextInput_C;

SDK_NAMESPACE_END
