#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Button_Boolean_Selector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Button_Boolean_Selector.WBP_Button_Boolean_Selector_C
// 0x0058 (0x0398 - 0x0340)
class UWBP_Button_Boolean_Selector_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Button_Text_C*                     State_On_Button;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Text_C*                     State_Off_Button;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class FText                                   OffLabel;                                          // 0x0360(0x0010)(Edit, BlueprintVisible)
	class FText                                   OnLabel;                                           // 0x0370(0x0010)(Edit, BlueprintVisible)
	class UCommonButtonGroupBase*                 ButtonGroup;                                       // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool bIsOn)>    OnStateChanged;                                    // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_Button_Boolean_Selector_State_Off_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Button_Boolean_Selector_State_On_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_Button_Boolean_Selector(int32 EntryPoint);
	void OnInitialized();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void ShowBooleanState(bool bInIsOn);
	void ToggleBooleanState();

	bool IsBooleanStateOn() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Button_Boolean_Selector_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Button_Boolean_Selector_C")
	}
	static class UWBP_Button_Boolean_Selector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Button_Boolean_Selector_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Button_Boolean_Selector_C;

SDK_NAMESPACE_END
