#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_AutoFlipIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_HUD_AutoFlipIndicator.WBP_HUD_AutoFlipIndicator_C
// 0x0038 (0x0378 - 0x0340)
class UWBP_HUD_AutoFlipIndicator_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTyrLazyImage*                          TimerBar;                                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Timer_1;                                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Timer;                                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_41;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVM_PlayerAutoFlip_C*                   VM_PlayerAutoFlip;                                 // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_HUD_AutoFlipIndicator(int32 EntryPoint);
	void OnMessageReceived_3093E4254458D30157417AA4DFECD598(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void SetVM_PlayerAutoFlip(class UVM_PlayerAutoFlip_C* ViewModel);

	ESlateVisibility __5c4f708d_4f3d_28a8_5cc8_f696a67a96a7_SourceToDest() const;
	void __8ab75f7a_4be4_efbb_95b6_6ab4c86b18e6_SourceToDest(struct FTyrMaterialScalarParam* TyrMaterialScalarParam) const;
	class FText __d487079f_4c7b_f6e6_6ac9_af8391d32b2a_SourceToDest() const;
	void GetTimerFillProgressMaterialParam(double InCurrentTime, double InTotalTime, struct FTyrMaterialScalarParam* TyrMaterialScalarParam) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_HUD_AutoFlipIndicator_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_HUD_AutoFlipIndicator_C")
	}
	static class UWBP_HUD_AutoFlipIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_AutoFlipIndicator_C>();
	}
};
DUMPER7_ASSERTS_UWBP_HUD_AutoFlipIndicator_C;

SDK_NAMESPACE_END
