#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConfirmationDialog_TextInput

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_ConfirmationDialog_TextInput.WBP_ConfirmationDialog_TextInput_C.BndEvt__WBP_ConfirmationDialog_TextInput_TextInputField_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ConfirmationDialog_TextInput_C_BndEvt__WBP_ConfirmationDialog_TextInput_TextInputField_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_ConfirmationDialog_TextInput_C_BndEvt__WBP_ConfirmationDialog_TextInput_TextInputField_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature;

// Function WBP_ConfirmationDialog_TextInput.WBP_ConfirmationDialog_TextInput_C.BndEvt__WBP_ConfirmationDialog_TextInput_Toggle_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ConfirmationDialog_TextInput_C_BndEvt__WBP_ConfirmationDialog_TextInput_Toggle_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ConfirmationDialog_TextInput_C_BndEvt__WBP_ConfirmationDialog_TextInput_Toggle_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_ConfirmationDialog_TextInput.WBP_ConfirmationDialog_TextInput_C.ExecuteUbergraph_WBP_ConfirmationDialog_TextInput
// 0x0050 (0x0050 - 0x0000)
struct WBP_ConfirmationDialog_TextInput_C_ExecuteUbergraph_WBP_ConfirmationDialog_TextInput final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrViewModel*                          K2Node_Event_ViewModel;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0010(0x0010)(ConstParm)
	class UVM_Dialog_TextInput_C*                 K2Node_DynamicCast_AsVM_Dialog_Text_Input;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ConfirmationDialog_TextInput_C_ExecuteUbergraph_WBP_ConfirmationDialog_TextInput;

// Function WBP_ConfirmationDialog_TextInput.WBP_ConfirmationDialog_TextInput_C.OnSetupViewModel
// 0x0008 (0x0008 - 0x0000)
struct WBP_ConfirmationDialog_TextInput_C_OnSetupViewModel final
{
public:
	class UTyrViewModel*                          ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ConfirmationDialog_TextInput_C_OnSetupViewModel;

// Function WBP_ConfirmationDialog_TextInput.WBP_ConfirmationDialog_TextInput_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ConfirmationDialog_TextInput_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ConfirmationDialog_TextInput_C_PreConstruct;

// Function WBP_ConfirmationDialog_TextInput.WBP_ConfirmationDialog_TextInput_C.RefreshConfirmationButton
// 0x0018 (0x0018 - 0x0000)
struct WBP_ConfirmationDialog_TextInput_C_RefreshConfirmationButton final
{
public:
	ETyrButtonVariant                             Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrButtonVariant                             Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanConfirmDialog_ReturnValue;             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrButtonBase*                         CallFunc_GetConfirmButton_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETyrButtonVariant                             K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ConfirmationDialog_TextInput_C_RefreshConfirmationButton;

// Function WBP_ConfirmationDialog_TextInput.WBP_ConfirmationDialog_TextInput_C.SetVM_Dialog_TextInput
// 0x0028 (0x0028 - 0x0000)
struct WBP_ConfirmationDialog_TextInput_C_SetVM_Dialog_TextInput final
{
public:
	class UVM_Dialog_TextInput_C*                 ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ConfirmationDialog_TextInput_C_SetVM_Dialog_TextInput;

// Function WBP_ConfirmationDialog_TextInput.WBP_ConfirmationDialog_TextInput_C.UpdateEnteredText
// 0x0010 (0x0010 - 0x0000)
struct WBP_ConfirmationDialog_TextInput_C_UpdateEnteredText final
{
public:
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0000(0x0010)()
};
DUMPER7_ASSERTS_WBP_ConfirmationDialog_TextInput_C_UpdateEnteredText;

// Function WBP_ConfirmationDialog_TextInput.WBP_ConfirmationDialog_TextInput_C.__1bbe2814-45f9-11bb-fa69-e5a26c875f3b_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_ConfirmationDialog_TextInput_C___1bbe2814_45f9_11bb_fa69_e5a26c875f3b_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ConfirmationDialog_TextInput_C___1bbe2814_45f9_11bb_fa69_e5a26c875f3b_SourceToDest;

// Function WBP_ConfirmationDialog_TextInput.WBP_ConfirmationDialog_TextInput_C.__a5b8dd96-449a-00c5-accd-81943ec274de_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_ConfirmationDialog_TextInput_C___a5b8dd96_449a_00c5_accd_81943ec274de_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ConfirmationDialog_TextInput_C___a5b8dd96_449a_00c5_accd_81943ec274de_SourceToDest;

// Function WBP_ConfirmationDialog_TextInput.WBP_ConfirmationDialog_TextInput_C.__ab0382c4-441b-10c8-c1b5-0abb3ec5eb85_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_ConfirmationDialog_TextInput_C___ab0382c4_441b_10c8_c1b5_0abb3ec5eb85_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequiresCurrency_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ConfirmationDialog_TextInput_C___ab0382c4_441b_10c8_c1b5_0abb3ec5eb85_SourceToDest;

// Function WBP_ConfirmationDialog_TextInput.WBP_ConfirmationDialog_TextInput_C.__fabfeb9c-46bb-712c-63f3-b7bbea6a6f70_SourceToDest
// 0x002C (0x002C - 0x0000)
struct WBP_ConfirmationDialog_TextInput_C___fabfeb9c_46bb_712c_63f3_b7bbea6a6f70_SourceToDest final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_CanPurchase_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_SelectSlateColor_ReturnValue;             // 0x0018(0x0014)()
};
DUMPER7_ASSERTS_WBP_ConfirmationDialog_TextInput_C___fabfeb9c_46bb_712c_63f3_b7bbea6a6f70_SourceToDest;

// Function WBP_ConfirmationDialog_TextInput.WBP_ConfirmationDialog_TextInput_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_ConfirmationDialog_TextInput_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ConfirmationDialog_TextInput_C_BP_GetDesiredFocusTarget;

// Function WBP_ConfirmationDialog_TextInput.WBP_ConfirmationDialog_TextInput_C.CanConfirmDialog
// 0x0006 (0x0006 - 0x0000)
struct WBP_ConfirmationDialog_TextInput_C_CanConfirmDialog final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnteredTextValid_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnteredTextValid_ReturnValue_1;         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPurchase_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ConfirmationDialog_TextInput_C_CanConfirmDialog;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
