#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Home_LocalPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Home_LocalPlayer.WBP_Home_LocalPlayer_C
// 0x0028 (0x0368 - 0x0340)
class UWBP_Home_LocalPlayer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Button_Icon_C*                     PlayerProfile_Button;                              // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CurrencyBalance_C*                 Currency_RankedEnabled;                            // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVM_Party_C*                            VM_Party;                                          // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             PlayerNameText;                                    // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void AfterPush_A16A23E2453683217F34ABB52743B428(class UCommonActivatableWidget* UserWidget);
	void BeforePush_A16A23E2453683217F34ABB52743B428(class UCommonActivatableWidget* UserWidget);
	void BndEvt__WBP_Home_LocalPlayer_PlayerProfile_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_Home_LocalPlayer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Home_LocalPlayer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Home_LocalPlayer_C")
	}
	static class UWBP_Home_LocalPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Home_LocalPlayer_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Home_LocalPlayer_C;

SDK_NAMESPACE_END
