#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Scoreboard_PostGame_PlayerEntry_Right

#include "Basic.hpp"

#include "E_Button_StyleType_structs.hpp"
#include "Engine_structs.hpp"
#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Scoreboard_PostGame_PlayerEntry_Right.WBP_Scoreboard_PostGame_PlayerEntry_Right_C
// 0x00F0 (0x04C0 - 0x03D0)
class UWBP_Scoreboard_PostGame_PlayerEntry_Right_C final : public UTyrUserListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_PlayerTitle_C*                     PlayerTitle;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTyrHoverDetector*                      Player_HoverDetector;                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PartyIconBacking;                                  // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PartyIcon_1;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            KeystoneTooltipAnchor;                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KeystoneDiv;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTyrHoverDetector*                      Keystone_HoverDetector;                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTyrContextMenuAnchor*                  ContextMenuAnchor;                                 // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTyrLazyImage*                          CharPortrait;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Icon_C*                     Btn_Salute;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Backing;                                           // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHoverKeystone;                                   // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVM_Scoreboard_Player_C*                VM_Scoreboard_Player;                              // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UVM_SaluteConsumable_C*                 VM_SaluteConsumable;                               // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ClassIcon;                                         // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             PlayerName_Text;                                   // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             DamageDone_Text;                                   // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             DamageBlocked_Text;                                // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             AssistDamage_Text;                                 // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TanksKilled_Text;                                  // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                PlayerStatsBorder;                                 // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               PartyIconOverlay;                                  // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTyrLazyImage*                          Keystone;                                          // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             PlusText;                                          // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IsMeIndicator;                                     // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Entry_HoverBrackets;                               // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Keystone_HoverBrackets;                            // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  SaluteFailListener;                                // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Scoreboard_PostGame_PlayerEntry_Right_ContextMenuAnchor_K2Node_ComponentBoundEvent_0_OnShowContextMenu__DelegateSignature(class UTyrContextMenuWidget* MenuWidget);
	void BndEvt__WBP_Scoreboard_PostGame_PlayerEntry_Right_Keystone_HoverDetector_K2Node_ComponentBoundEvent_4_TyrOnHoverStateChanged__DelegateSignature();
	void BndEvt__WBP_Scoreboard_PostGame_PlayerEntry_Right_Keystone_HoverDetector_K2Node_ComponentBoundEvent_5_TyrOnHoverStateChanged__DelegateSignature();
	void BndEvt__WBP_Scoreboard_PostGame_PlayerEntry_Right_Player_HoverDetector_K2Node_ComponentBoundEvent_2_TyrOnHoverStateChanged__DelegateSignature();
	void BndEvt__WBP_Scoreboard_PostGame_PlayerEntry_Right_Player_HoverDetector_K2Node_ComponentBoundEvent_3_TyrOnHoverStateChanged__DelegateSignature();
	void BndEvt__WBP_Scoreboard_PostGame_PlayerEntry_Right_WBP_Button_Icon_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_Scoreboard_PostGame_PlayerEntry_Right(int32 EntryPoint);
	class UUserWidget* GetUserMenuContent();
	void OnMessageReceived_A0F22FC94097D2574DAF03A478120C21(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void SetVM_Scoreboard_Player(class UVM_Scoreboard_Player_C* ViewModel);

	struct FSlateColor __23dcfbf4_412b_4a0e_86b4_ba830f3696ec_SourceToDest() const;
	struct FSlateColor __23f483d0_4f5d_bd86_1e96_489ab6e6083a_SourceToDest() const;
	struct FSlateColor __36d9d38e_47da_59d0_e188_48b9bd7f372e_SourceToDest() const;
	double __476f62ef_4f69_35d8_3e91_71a4dde0a629_SourceToDest() const;
	struct FSlateColor __8ce923fe_4372_9ef2_a132_40a72169b547_SourceToDest() const;
	struct FSlateColor __8d7f756b_4f2e_0f68_4866_e4898239fd65_SourceToDest() const;
	struct FTyrMaterialTextureParam __8de75015_499c_b60d_f42d_f0aa18d17a20_SourceToDest() const;
	double __b1b399ae_48e5_6d08_a985_0e9aa7691cb0_SourceToDest() const;
	double __b91b1a5a_4e7e_0e23_fda0_c6bb7e9ba8b4_SourceToDest() const;
	ESlateVisibility __c76000df_49d2_b164_5988_caab0afdf6cf_SourceToDest() const;
	struct FSlateColor __ConversionFunction795372e0_e53a_3173_bd8a_b5327bcd35c3() const;
	ESlateVisibility __dae5e633_4a97_a317_7d78_339c069fef79_SourceToDest() const;
	double __dc83a779_427d_eda7_646e_9ab1ca3400a3_SourceToDest() const;
	struct FLinearColor __e67fd51d_4531_a393_0057_b6afa06effc8_SourceToDest() const;
	void __f196d5db_4f4e_f2ad_e524_7194597c5f74_SourceToDest(class UTexture2D** Icon) const;
	ESlateVisibility __fd5957a8_4175_c65a_e5ed_84b42f600f39_SourceToDest() const;
	void GetSaluteButtonColor(bool bInHasAnyConsumable, bool bInHasAlreadySaluted, struct FLinearColor* Color) const;
	void GetSaluteButtonType(bool bInHasConsumable, bool bInHasSalutedAlready, E_Button_StyleType* OutStyle) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Scoreboard_PostGame_PlayerEntry_Right_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Scoreboard_PostGame_PlayerEntry_Right_C")
	}
	static class UWBP_Scoreboard_PostGame_PlayerEntry_Right_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Scoreboard_PostGame_PlayerEntry_Right_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Scoreboard_PostGame_PlayerEntry_Right_C;

SDK_NAMESPACE_END
