#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Lobby_Vehicle_Button

#include "Basic.hpp"

#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Lobby_Vehicle_Button.WBP_Lobby_Vehicle_Button_C
// 0x0040 (0x15D0 - 0x1590)
class UWBP_Lobby_Vehicle_Button_C final : public UTyrButtonBase
{
public:
	class UScaleBox*                              Pilot_ScaleBox;                                    // 0x1590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTyrLazyImage*                          Pilot_Image;                                       // 0x1598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_66;                                          // 0x15A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x15A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVM_Lobby_Vehicle_C*                    VM_Lobby_Vehicle;                                  // 0x15B0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UImage*                                 LockedIcon;                                        // 0x15B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetSwitcher*                        BtnShape_Switcher;                                 // 0x15C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               AlphaLabel;                                        // 0x15C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void SetVM_Lobby_Vehicle(class UVM_Lobby_Vehicle_C* ViewModel);

	int32 __977201a4_402c_2d62_0237_caa38f21b5a8_SourceToDest() const;
	ESlateVisibility __ConversionFunctionb4e67593_2f22_37c7_89d7_a66695780c7d() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Lobby_Vehicle_Button_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Lobby_Vehicle_Button_C")
	}
	static class UWBP_Lobby_Vehicle_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Lobby_Vehicle_Button_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Lobby_Vehicle_Button_C;

SDK_NAMESPACE_END
