#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConfirmationDialog_CurrencyPurchase

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_ConfirmationDialog_CurrencyPurchase.WBP_ConfirmationDialog_CurrencyPurchase_C.ExecuteUbergraph_WBP_ConfirmationDialog_CurrencyPurchase
// 0x0070 (0x0070 - 0x0000)
struct WBP_ConfirmationDialog_CurrencyPurchase_C_ExecuteUbergraph_WBP_ConfirmationDialog_CurrencyPurchase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrButtonBase*                         CallFunc_GetConfirmButton_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCurrencyCostText_ReturnValue;          // 0x0010(0x0010)()
	bool                                          CallFunc_CanPurchase_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0010)()
	class UTyrButtonBase*                         CallFunc_GetConfirmButton_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTyrViewModel*                          K2Node_Event_ViewModel;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Currency_Purchase_C*                K2Node_DynamicCast_AsVM_Currency_Purchase;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstanceSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrFeatureFlagSubsystem*               K2Node_DynamicCast_AsTyr_Feature_Flag_Subsystem;   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFeatureEnabled_ReturnValue;             // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ConfirmationDialog_CurrencyPurchase_C_ExecuteUbergraph_WBP_ConfirmationDialog_CurrencyPurchase;

// Function WBP_ConfirmationDialog_CurrencyPurchase.WBP_ConfirmationDialog_CurrencyPurchase_C.OnSetupViewModel
// 0x0008 (0x0008 - 0x0000)
struct WBP_ConfirmationDialog_CurrencyPurchase_C_OnSetupViewModel final
{
public:
	class UTyrViewModel*                          ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ConfirmationDialog_CurrencyPurchase_C_OnSetupViewModel;

// Function WBP_ConfirmationDialog_CurrencyPurchase.WBP_ConfirmationDialog_CurrencyPurchase_C.SetVM_Currency_Purchase
// 0x0028 (0x0028 - 0x0000)
struct WBP_ConfirmationDialog_CurrencyPurchase_C_SetVM_Currency_Purchase final
{
public:
	class UVM_Currency_Purchase_C*                ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ConfirmationDialog_CurrencyPurchase_C_SetVM_Currency_Purchase;

// Function WBP_ConfirmationDialog_CurrencyPurchase.WBP_ConfirmationDialog_CurrencyPurchase_C.__17727ca5-4709-cae5-e135-5e90e966264e_SourceToDest
// 0x002C (0x002C - 0x0000)
struct WBP_ConfirmationDialog_CurrencyPurchase_C___17727ca5_4709_cae5_e135_5e90e966264e_SourceToDest final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_CanPurchase_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_SelectSlateColor_ReturnValue;             // 0x0018(0x0014)()
};
DUMPER7_ASSERTS_WBP_ConfirmationDialog_CurrencyPurchase_C___17727ca5_4709_cae5_e135_5e90e966264e_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
