#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Vehicle_MasteryTrack_Level

#include "Basic.hpp"

#include "Tyr_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Vehicle_MasteryTrack_Level.WBP_Vehicle_MasteryTrack_Level_C.SetVM_Vehicle_Level
// 0x0028 (0x0028 - 0x0000)
struct WBP_Vehicle_MasteryTrack_Level_C_SetVM_Vehicle_Level final
{
public:
	class UVM_Vehicle_Level_C*                    ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_MasteryTrack_Level_C_SetVM_Vehicle_Level;

// Function WBP_Vehicle_MasteryTrack_Level.WBP_Vehicle_MasteryTrack_Level_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_MasteryTrack_Level_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_MasteryTrack_Level_C_OnListItemObjectSet;

// Function WBP_Vehicle_MasteryTrack_Level.WBP_Vehicle_MasteryTrack_Level_C.On_MenuAnchor_GetUserMenuContent
// 0x0018 (0x0018 - 0x0000)
struct WBP_Vehicle_MasteryTrack_Level_C_On_MenuAnchor_GetUserMenuContent final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tooltip_ItemDetail_C*              CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_MasteryTrack_Level_C_On_MenuAnchor_GetUserMenuContent;

// Function WBP_Vehicle_MasteryTrack_Level.WBP_Vehicle_MasteryTrack_Level_C.ExecuteUbergraph_WBP_Vehicle_MasteryTrack_Level
// 0x0048 (0x0048 - 0x0000)
struct WBP_Vehicle_MasteryTrack_Level_C_ExecuteUbergraph_WBP_Vehicle_MasteryTrack_Level final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0020(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x0030(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_MasteryTrack_Level_C_ExecuteUbergraph_WBP_Vehicle_MasteryTrack_Level;

// Function WBP_Vehicle_MasteryTrack_Level.WBP_Vehicle_MasteryTrack_Level_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Vehicle_MasteryTrack_Level_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_MasteryTrack_Level_C_BP_OnItemSelectionChanged;

// Function WBP_Vehicle_MasteryTrack_Level.WBP_Vehicle_MasteryTrack_Level_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Vehicle_MasteryTrack_Level_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_MasteryTrack_Level_C_BP_OnItemExpansionChanged;

// Function WBP_Vehicle_MasteryTrack_Level.WBP_Vehicle_MasteryTrack_Level_C.BndEvt__WBP_Vehicle_MasteryTrack_Level_WBP_Button_Text_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_MasteryTrack_Level_C_BndEvt__WBP_Vehicle_MasteryTrack_Level_WBP_Button_Text_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_MasteryTrack_Level_C_BndEvt__WBP_Vehicle_MasteryTrack_Level_WBP_Button_Text_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Vehicle_MasteryTrack_Level.WBP_Vehicle_MasteryTrack_Level_C.BndEvt__WBP_Vehicle_MasteryTrack_Level_WBP_Button_Text_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_MasteryTrack_Level_C_BndEvt__WBP_Vehicle_MasteryTrack_Level_WBP_Button_Text_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_MasteryTrack_Level_C_BndEvt__WBP_Vehicle_MasteryTrack_Level_WBP_Button_Text_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Vehicle_MasteryTrack_Level.WBP_Vehicle_MasteryTrack_Level_C.__efb59fe2-47d1-ad22-bd35-efa15b040129_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Vehicle_MasteryTrack_Level_C___efb59fe2_47d1_ad22_bd35_efa15b040129_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_MasteryTrack_Level_C___efb59fe2_47d1_ad22_bd35_efa15b040129_SourceToDest;

// Function WBP_Vehicle_MasteryTrack_Level.WBP_Vehicle_MasteryTrack_Level_C.__a1c1c661-429f-994b-5364-ab8e43730d98_SourceToDest
// 0x0028 (0x0028 - 0x0000)
struct WBP_Vehicle_MasteryTrack_Level_C___a1c1c661_429f_994b_5364_ab8e43730d98_SourceToDest final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            CallFunc_SelectSlateColor_ReturnValue;             // 0x0014(0x0014)()
};
DUMPER7_ASSERTS_WBP_Vehicle_MasteryTrack_Level_C___a1c1c661_429f_994b_5364_ab8e43730d98_SourceToDest;

// Function WBP_Vehicle_MasteryTrack_Level.WBP_Vehicle_MasteryTrack_Level_C.__61c50112-4a9e-6ee3-88e2-8fa1aba85a39_SourceToDest
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_MasteryTrack_Level_C___61c50112_4a9e_6ee3_88e2_8fa1aba85a39_SourceToDest final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_MasteryTrack_Level_C___61c50112_4a9e_6ee3_88e2_8fa1aba85a39_SourceToDest;

// Function WBP_Vehicle_MasteryTrack_Level.WBP_Vehicle_MasteryTrack_Level_C.__4c663e4b-42c9-f34b-c809-b5afa4f44e01_SourceToDest
// 0x0010 (0x0010 - 0x0000)
struct WBP_Vehicle_MasteryTrack_Level_C___4c663e4b_42c9_f34b_c809_b5afa4f44e01_SourceToDest final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_MasteryTrack_Level_C___4c663e4b_42c9_f34b_c809_b5afa4f44e01_SourceToDest;

// Function WBP_Vehicle_MasteryTrack_Level.WBP_Vehicle_MasteryTrack_Level_C.__092bb453-4237-8fc7-bf67-8abe18202e85_SourceToDest
// 0x0018 (0x0018 - 0x0000)
struct WBP_Vehicle_MasteryTrack_Level_C___092bb453_4237_8fc7_bf67_8abe18202e85_SourceToDest final
{
public:
	struct FTyrMaterialScalarParam                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FTyrMaterialScalarParam                CallFunc_ToScalarMaterialParam__Boolean__ReturnValue; // 0x000C(0x000C)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Vehicle_MasteryTrack_Level_C___092bb453_4237_8fc7_bf67_8abe18202e85_SourceToDest;

// Function WBP_Vehicle_MasteryTrack_Level.WBP_Vehicle_MasteryTrack_Level_C.__0775c6b4-407a-4abf-e104-5ba986a8ba6f_SourceToDest
// 0x0010 (0x0010 - 0x0000)
struct WBP_Vehicle_MasteryTrack_Level_C___0775c6b4_407a_4abf_e104_5ba986a8ba6f_SourceToDest final
{
public:
	class UMaterialInterface*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_SelectMaterial_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_MasteryTrack_Level_C___0775c6b4_407a_4abf_e104_5ba986a8ba6f_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
