#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerTitle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_PlayerTitle.WBP_PlayerTitle_C
// 0x0080 (0x03C0 - 0x0340)
class UWBP_PlayerTitle_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             PlayerTitle_Text;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        FontSize;                                          // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FSlateFontInfo                         Font;                                              // 0x0358(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	ERarity                                       Rarity;                                            // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisplaysFullColors;                               // 0x03B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_PlayerTitle(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetFontSize();
	void SetTitleData(const struct FTyrPlayerTitleData& InTitleData);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_PlayerTitle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_PlayerTitle_C")
	}
	static class UWBP_PlayerTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerTitle_C>();
	}
};
DUMPER7_ASSERTS_UWBP_PlayerTitle_C;

SDK_NAMESPACE_END
