#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_AmmunitionSelected

#include "Basic.hpp"

#include "DataRegistry_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_HUD_AmmunitionSelected.WBP_HUD_AmmunitionSelected_C
// 0x0030 (0x0370 - 0x0340)
class UWBP_HUD_AmmunitionSelected_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             AmmunitionName;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowActiveAmmo;                                    // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	TArray<class UAsyncAction_ListenForGameplayMessage*> AsyncActions_UpdateAmmunition;              // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ATyrWheeledVehiclePawnBase*             CurrentPawnTarget;                                 // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CancelCurrentPawnAsyncActions();
	void Construct();
	void ExecuteUbergraph_WBP_HUD_AmmunitionSelected(int32 EntryPoint);
	void OnInitialized();
	void OnMessageReceived_7EA597594843A80153853CA752C7A8EE(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_BB1DF8B74B98E21D289663A95B259480(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_EFDB7E7A415333367D4AB8828FCF6C49(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void UpdateActiveAmmunition(const struct FGameplayTag& InNewAmmunitionTag);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_HUD_AmmunitionSelected_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_HUD_AmmunitionSelected_C")
	}
	static class UWBP_HUD_AmmunitionSelected_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_AmmunitionSelected_C>();
	}
};
DUMPER7_ASSERTS_UWBP_HUD_AmmunitionSelected_C;

SDK_NAMESPACE_END
