#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Button_Selector_Option

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Button_Selector_Option.WBP_Button_Selector_Option_C
// 0x0030 (0x15C0 - 0x1590)
class UWBP_Button_Selector_Option_C final : public UTyrButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVM_Selector_Option_C*                  VM_Selector_Option;                                // 0x1598(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UCommonTextBlock*                       ButtonTextBlock;                                   // 0x15A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ButtonIcon;                                        // 0x15A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UVM_Selector_Option_C* Option)> OnOptionSelected;            // 0x15B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void SetVM_Selector_Option(class UVM_Selector_Option_C* ViewModel);
	void ExecuteUbergraph_WBP_Button_Selector_Option(int32 EntryPoint);
	void Construct();
	void BP_OnSelected();
	void BP_OnHovered();

	ESlateVisibility __2168aa90_4a8f_393a_f04f_48b515b7e163_SourceToDest() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Button_Selector_Option_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Button_Selector_Option_C")
	}
	static class UWBP_Button_Selector_Option_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Button_Selector_Option_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Button_Selector_Option_C;

SDK_NAMESPACE_END
