#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Clan_Create_LinkDiscord_Channel_Error

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Clan_Create_LinkDiscord_Channel_Error.WBP_Clan_Create_LinkDiscord_Channel_Error_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_Channel_Error_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_Channel_Error_C_BP_OnItemExpansionChanged;

// Function WBP_Clan_Create_LinkDiscord_Channel_Error.WBP_Clan_Create_LinkDiscord_Channel_Error_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_Channel_Error_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_Channel_Error_C_BP_OnItemSelectionChanged;

// Function WBP_Clan_Create_LinkDiscord_Channel_Error.WBP_Clan_Create_LinkDiscord_Channel_Error_C.ExecuteUbergraph_WBP_Clan_Create_LinkDiscord_Channel_Error
// 0x0018 (0x0018 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_Channel_Error_C_ExecuteUbergraph_WBP_Clan_Create_LinkDiscord_Channel_Error final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_Channel_Error_C_ExecuteUbergraph_WBP_Clan_Create_LinkDiscord_Channel_Error;

// Function WBP_Clan_Create_LinkDiscord_Channel_Error.WBP_Clan_Create_LinkDiscord_Channel_Error_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_Channel_Error_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_Channel_Error_C_OnListItemObjectSet;

// Function WBP_Clan_Create_LinkDiscord_Channel_Error.WBP_Clan_Create_LinkDiscord_Channel_Error_C.SetEntry
// 0x0028 (0x0028 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_Channel_Error_C_SetEntry final
{
public:
	class UVM_Clan_Discord_Error_C*               ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_Channel_Error_C_SetEntry;

// Function WBP_Clan_Create_LinkDiscord_Channel_Error.WBP_Clan_Create_LinkDiscord_Channel_Error_C.__bafc26bd-46e8-17fc-6477-cd82e879720c_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_Channel_Error_C___bafc26bd_46e8_17fc_6477_cd82e879720c_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_Channel_Error_C___bafc26bd_46e8_17fc_6477_cd82e879720c_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
