#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_AutoFlipIndicator

#include "Basic.hpp"

#include "Tyr_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_HUD_AutoFlipIndicator.WBP_HUD_AutoFlipIndicator_C.ExecuteUbergraph_WBP_HUD_AutoFlipIndicator
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_HUD_AutoFlipIndicator_C_ExecuteUbergraph_WBP_HUD_AutoFlipIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrGameActionMessage                  Temp_struct_Variable;                              // 0x0008(0x0098)()
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate; // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTyrGameActionMessage                  Temp_struct_Variable_1;                            // 0x00C0(0x0098)()
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATyrPlayerStateBase*                    K2Node_DynamicCast_AsTyr_Player_State_Base;        // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_PlayerAutoFlip_C*                   CallFunc_GetViewModel_ReturnValue;                 // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATyrPlayerStateBase*                    K2Node_DynamicCast_AsTyr_Player_State_Base_1;      // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_PlayerAutoFlip_C*                   CallFunc_GetViewModel_ReturnValue_1;               // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreViewModelsInitialized_ReturnValue;     // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_AutoFlipIndicator_C_ExecuteUbergraph_WBP_HUD_AutoFlipIndicator;

// Function WBP_HUD_AutoFlipIndicator.WBP_HUD_AutoFlipIndicator_C.OnMessageReceived_3093E4254458D30157417AA4DFECD598
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_AutoFlipIndicator_C_OnMessageReceived_3093E4254458D30157417AA4DFECD598 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_AutoFlipIndicator_C_OnMessageReceived_3093E4254458D30157417AA4DFECD598;

// Function WBP_HUD_AutoFlipIndicator.WBP_HUD_AutoFlipIndicator_C.SetVM_PlayerAutoFlip
// 0x0028 (0x0028 - 0x0000)
struct WBP_HUD_AutoFlipIndicator_C_SetVM_PlayerAutoFlip final
{
public:
	class UVM_PlayerAutoFlip_C*                   ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_AutoFlipIndicator_C_SetVM_PlayerAutoFlip;

// Function WBP_HUD_AutoFlipIndicator.WBP_HUD_AutoFlipIndicator_C.__5c4f708d-4f3d-28a8-5cc8-f696a67a96a7_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_HUD_AutoFlipIndicator_C___5c4f708d_4f3d_28a8_5cc8_f696a67a96a7_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_AutoFlipIndicator_C___5c4f708d_4f3d_28a8_5cc8_f696a67a96a7_SourceToDest;

// Function WBP_HUD_AutoFlipIndicator.WBP_HUD_AutoFlipIndicator_C.__8ab75f7a-4be4-efbb-95b6-6ab4c86b18e6_SourceToDest
// 0x0028 (0x0028 - 0x0000)
struct WBP_HUD_AutoFlipIndicator_C___8ab75f7a_4be4_efbb_95b6_6ab4c86b18e6_SourceToDest final
{
public:
	struct FTyrMaterialScalarParam                TyrMaterialScalarParam;                            // 0x0000(0x000C)(Parm, OutParm, NoDestructor)
	struct FTyrMaterialScalarParam                CallFunc_GetTimerFillProgressMaterialParam_TyrMaterialScalarParam; // 0x000C(0x000C)(NoDestructor)
	double                                        CallFunc_GetTimerFillProgressMaterialParam_InTotalTime_ImplicitCast; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimerFillProgressMaterialParam_InCurrentTime_ImplicitCast; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_AutoFlipIndicator_C___8ab75f7a_4be4_efbb_95b6_6ab4c86b18e6_SourceToDest;

// Function WBP_HUD_AutoFlipIndicator.WBP_HUD_AutoFlipIndicator_C.__d487079f-4c7b-f6e6-6ac9-af8391d32b2a_SourceToDest
// 0x0028 (0x0028 - 0x0000)
struct WBP_HUD_AutoFlipIndicator_C___d487079f_4c7b_f6e6_6ac9_af8391d32b2a_SourceToDest final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0010(0x0010)()
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_AutoFlipIndicator_C___d487079f_4c7b_f6e6_6ac9_af8391d32b2a_SourceToDest;

// Function WBP_HUD_AutoFlipIndicator.WBP_HUD_AutoFlipIndicator_C.GetTimerFillProgressMaterialParam
// 0x0038 (0x0038 - 0x0000)
struct WBP_HUD_AutoFlipIndicator_C_GetTimerFillProgressMaterialParam final
{
public:
	double                                        InCurrentTime;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InTotalTime;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTyrMaterialScalarParam                TyrMaterialScalarParam;                            // 0x0010(0x000C)(Parm, OutParm, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTyrMaterialScalarParam                K2Node_MakeStruct_TyrMaterialScalarParam;          // 0x0028(0x000C)(NoDestructor)
	float                                         K2Node_MakeStruct_Value_ImplicitCast;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_AutoFlipIndicator_C_GetTimerFillProgressMaterialParam;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
