#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Lobby_Loadout_Slots

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FieldNotification_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.AfterPush_57BF47DC4F43659B4181F9BD9F69F6C3
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_AfterPush_57BF47DC4F43659B4181F9BD9F69F6C3 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_AfterPush_57BF47DC4F43659B4181F9BD9F69F6C3;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.BeforePush_57BF47DC4F43659B4181F9BD9F69F6C3
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_BeforePush_57BF47DC4F43659B4181F9BD9F69F6C3 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_BeforePush_57BF47DC4F43659B4181F9BD9F69F6C3;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.BndEvt__WBP_Lobby_Loadout_Slots_AmmoSlot0_Button_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_AmmoSlot0_Button_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_AmmoSlot0_Button_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.BndEvt__WBP_Lobby_Loadout_Slots_AmmoSlot0_Button_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_AmmoSlot0_Button_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_AmmoSlot0_Button_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.BndEvt__WBP_Lobby_Loadout_Slots_AmmoSlot1_Button_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_AmmoSlot1_Button_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_AmmoSlot1_Button_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.BndEvt__WBP_Lobby_Loadout_Slots_AmmoSlot1_Button_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_AmmoSlot1_Button_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_AmmoSlot1_Button_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot0_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot0_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot0_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot0_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot0_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot0_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot1_Button_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot1_Button_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot1_Button_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot1_Button_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot1_Button_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot1_Button_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot2_Button_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot2_Button_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot2_Button_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot2_Button_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot2_Button_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_ComponentSlot2_Button_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.BndEvt__WBP_Lobby_Loadout_Slots_KeystoneSlot_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_KeystoneSlot_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_KeystoneSlot_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.BndEvt__WBP_Lobby_Loadout_Slots_KeystoneSlot_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_KeystoneSlot_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_BndEvt__WBP_Lobby_Loadout_Slots_KeystoneSlot_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.CreateTooltipForLockableSlot
// 0x0028 (0x0028 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_CreateTooltipForLockableSlot final
{
public:
	class UWBP_Loadout_LockableSlot_Button_C*     InLockableSlotButton;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tooltip_ItemDetail_C*              ToolTipWidget_0;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tooltip_ItemDetail_C*              CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_CreateTooltipForLockableSlot;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.ExecuteUbergraph_WBP_Lobby_Loadout_Slots
// 0x0220 (0x0220 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_ExecuteUbergraph_WBP_Lobby_Loadout_Slots final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_TyrLobbyGameState_C*                K2Node_DynamicCast_AsBP_Tyr_Lobby_Game_State;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_11;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVM_Lobby_C*                            CallFunc_GetViewModel_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_10;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x004C(0x0014)()
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_9;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_8;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_7;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_6;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_5;               // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate;           // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button;                         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_1;                   // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrAsyncActionPushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00EC(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x00FC(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0130(0x00B0)()
	class UCommonActivatableWidget*               Temp_object_Variable;                              // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget;                     // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Lobby_Loadout_Overview_C*          K2Node_DynamicCast_AsWBP_Lobby_Loadout_Overview;   // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_2; // 0x01FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast;          // 0x020C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_ExecuteUbergraph_WBP_Lobby_Loadout_Slots;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.HideTooltipOnUnhover
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_HideTooltipOnUnhover final
{
public:
	class UMenuAnchor*                            InSlotAnchor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_HideTooltipOnUnhover;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.On_AmmoSlot0_MenuAnchor_GetUserMenuContent
// 0x0010 (0x0010 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_On_AmmoSlot0_MenuAnchor_GetUserMenuContent final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tooltip_ItemDetail_C*              CallFunc_CreateTooltipForLockableSlot_TooltipWidget; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_On_AmmoSlot0_MenuAnchor_GetUserMenuContent;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.On_AmmoSlot1_MenuAnchor_GetUserMenuContent
// 0x0010 (0x0010 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_On_AmmoSlot1_MenuAnchor_GetUserMenuContent final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tooltip_ItemDetail_C*              CallFunc_CreateTooltipForLockableSlot_TooltipWidget; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_On_AmmoSlot1_MenuAnchor_GetUserMenuContent;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.On_ComponentSlot0_MenuAnchor_GetUserMenuContent
// 0x0010 (0x0010 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_On_ComponentSlot0_MenuAnchor_GetUserMenuContent final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tooltip_ItemDetail_C*              CallFunc_CreateTooltipForLockableSlot_TooltipWidget; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_On_ComponentSlot0_MenuAnchor_GetUserMenuContent;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.On_ComponentSlot1_MenuAnchor_GetUserMenuContent
// 0x0010 (0x0010 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_On_ComponentSlot1_MenuAnchor_GetUserMenuContent final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tooltip_ItemDetail_C*              CallFunc_CreateTooltipForLockableSlot_TooltipWidget; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_On_ComponentSlot1_MenuAnchor_GetUserMenuContent;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.On_ComponentSlot2_MenuAnchor_GetUserMenuContent
// 0x0010 (0x0010 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_On_ComponentSlot2_MenuAnchor_GetUserMenuContent final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tooltip_ItemDetail_C*              CallFunc_CreateTooltipForLockableSlot_TooltipWidget; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_On_ComponentSlot2_MenuAnchor_GetUserMenuContent;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.On_KeystoneSlot_MenuAnchor_GetUserMenuContent
// 0x0068 (0x0068 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_On_KeystoneSlot_MenuAnchor_GetUserMenuContent final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0010(0x0010)()
	class FText                                   CallFunc_GetActiveKeystoneName_ReturnValue;        // 0x0020(0x0010)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetActiveKeystoneDescription_ReturnValue; // 0x0038(0x0010)()
	class UWBP_Tooltip_ItemDetail_C*              CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasActiveKeystone_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0058(0x0010)(ConstParm)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_On_KeystoneSlot_MenuAnchor_GetUserMenuContent;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.On_TechTreeKeystoneChange
// 0x0060 (0x0060 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_On_TechTreeKeystoneChange final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   Field;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_TechTree_C*                         K2Node_DynamicCast_AsVM_Tech_Tree;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActiveKeystoneNode_bHasActiveKeystone; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_TechTree_Node_C*                    CallFunc_GetActiveKeystoneNode_KeystoneNode;       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATyrPlayerStateBase*                    K2Node_DynamicCast_AsTyr_Player_State_Base;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TyrLobbyPlayerState_C*              K2Node_DynamicCast_AsBP_Tyr_Lobby_Player_State;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TyrLobbyPlayerState_C*              K2Node_DynamicCast_AsBP_Tyr_Lobby_Player_State_1;  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_On_TechTreeKeystoneChange;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.OnSlotButtonClicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_OnSlotButtonClicked final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_OnSlotButtonClicked;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_PreConstruct;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.SetLoadout
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_SetLoadout final
{
public:
	class UVM_Vehicle_Loadout_C*                  InLoadout;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bLocIsLoadedFromSelected;                          // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLoc_CanEditLoadout;                               // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Lobby_C*                            CallFunc_GetGameStateViewModel_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActiveKeystoneNode_bHasActiveKeystone; // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_TechTree_Node_C*                    CallFunc_GetActiveKeystoneNode_KeystoneNode;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TyrLobbyPlayerState_C*              K2Node_DynamicCast_AsBP_Tyr_Lobby_Player_State;    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Progression_C*                      CallFunc_GetProgressionViewModel_ViewModel;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_C*                          CallFunc_GetVehicleTrackFromTag_VehicleTrack;      // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Loadout_LockableSlot_C*     CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Vehicle_Loadout_LockableSlot_C*     CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Loadout_LockableSlot_C*     CallFunc_Array_Get_Item_2;                         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Loadout_LockableSlot_C*     CallFunc_Array_Get_Item_3;                         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Loadout_LockableSlot_C*     CallFunc_Array_Get_Item_4;                         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_SetLoadout;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.SetVM_Vehicle_LoadoutSlots
// 0x0028 (0x0028 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_SetVM_Vehicle_LoadoutSlots final
{
public:
	class UVM_Vehicle_LoadoutSlots_C*             ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_SetVM_Vehicle_LoadoutSlots;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.ShowTooltipOnHover
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C_ShowTooltipOnHover final
{
public:
	class UMenuAnchor*                            InSlotAnchor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C_ShowTooltipOnHover;

// Function WBP_Lobby_Loadout_Slots.WBP_Lobby_Loadout_Slots_C.__88d8538c-4e08-ebe2-ea73-5da9fb81b5e1_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Lobby_Loadout_Slots_C___88d8538c_4e08_ebe2_ea73_5da9fb81b5e1_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Loadout_Slots_C___88d8538c_4e08_ebe2_ea73_5da9fb81b5e1_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
