#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Lobby_Spectator_Right

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Lobby_Spectator_Right.WBP_Lobby_Spectator_Right_C.BndEvt__WBP_Lobby_Spectator_Right_Btn_SpectateTeam_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Spectator_Right_C_BndEvt__WBP_Lobby_Spectator_Right_Btn_SpectateTeam_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Right_C_BndEvt__WBP_Lobby_Spectator_Right_Btn_SpectateTeam_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Spectator_Right.WBP_Lobby_Spectator_Right_C.BndEvt__WBP_Lobby_Spectator_Right_Btn_SpectateTeam_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Spectator_Right_C_BndEvt__WBP_Lobby_Spectator_Right_Btn_SpectateTeam_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Right_C_BndEvt__WBP_Lobby_Spectator_Right_Btn_SpectateTeam_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Spectator_Right.WBP_Lobby_Spectator_Right_C.BndEvt__WBP_Lobby_Spectator_Right_Btn_SpectateTeam_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Spectator_Right_C_BndEvt__WBP_Lobby_Spectator_Right_Btn_SpectateTeam_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Right_C_BndEvt__WBP_Lobby_Spectator_Right_Btn_SpectateTeam_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Lobby_Spectator_Right.WBP_Lobby_Spectator_Right_C.BndEvt__WBP_Lobby_Spectator_Right_SpectatorDetails_MenuAnchor_K2Node_ComponentBoundEvent_1_OnShowContextMenu__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Spectator_Right_C_BndEvt__WBP_Lobby_Spectator_Right_SpectatorDetails_MenuAnchor_K2Node_ComponentBoundEvent_1_OnShowContextMenu__DelegateSignature final
{
public:
	class UTyrContextMenuWidget*                  MenuWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Right_C_BndEvt__WBP_Lobby_Spectator_Right_SpectatorDetails_MenuAnchor_K2Node_ComponentBoundEvent_1_OnShowContextMenu__DelegateSignature;

// Function WBP_Lobby_Spectator_Right.WBP_Lobby_Spectator_Right_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Lobby_Spectator_Right_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Right_C_BP_OnItemExpansionChanged;

// Function WBP_Lobby_Spectator_Right.WBP_Lobby_Spectator_Right_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Lobby_Spectator_Right_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Right_C_BP_OnItemSelectionChanged;

// Function WBP_Lobby_Spectator_Right.WBP_Lobby_Spectator_Right_C.ExecuteUbergraph_WBP_Lobby_Spectator_Right
// 0x0090 (0x0090 - 0x0000)
struct WBP_Lobby_Spectator_Right_C_ExecuteUbergraph_WBP_Lobby_Spectator_Right final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTyrContextMenuWidget*                  K2Node_ComponentBoundEvent_MenuWidget;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0040(0x0008)(NoDestructor)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x0048(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0058(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0068(0x0008)(NoDestructor)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0070(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0080(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Right_C_ExecuteUbergraph_WBP_Lobby_Spectator_Right;

// Function WBP_Lobby_Spectator_Right.WBP_Lobby_Spectator_Right_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Spectator_Right_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Right_C_OnAddedToFocusPath;

// Function WBP_Lobby_Spectator_Right.WBP_Lobby_Spectator_Right_C.OnFocusReceived
// 0x0288 (0x0288 - 0x0000)
struct WBP_Lobby_Spectator_Right_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	int32                                         Temp_int_Variable;                                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0110(0x00B8)()
	class UWidget*                                K2Node_Select_Default;                             // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_SetUserFocus_ReturnValue;                 // 0x01D0(0x00B8)()
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Right_C_OnFocusReceived;

// Function WBP_Lobby_Spectator_Right.WBP_Lobby_Spectator_Right_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Spectator_Right_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Right_C_OnListItemObjectSet;

// Function WBP_Lobby_Spectator_Right.WBP_Lobby_Spectator_Right_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Spectator_Right_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Right_C_OnRemovedFromFocusPath;

// Function WBP_Lobby_Spectator_Right.WBP_Lobby_Spectator_Right_C.SetVM_Lobby_Player
// 0x0028 (0x0028 - 0x0000)
struct WBP_Lobby_Spectator_Right_C_SetVM_Lobby_Player final
{
public:
	class UVM_Lobby_Player_C*                     ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Right_C_SetVM_Lobby_Player;

// Function WBP_Lobby_Spectator_Right.WBP_Lobby_Spectator_Right_C.__9c92eec8-44d2-a027-24ba-0bbe4951dc26_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Lobby_Spectator_Right_C___9c92eec8_44d2_a027_24ba_0bbe4951dc26_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Right_C___9c92eec8_44d2_a027_24ba_0bbe4951dc26_SourceToDest;

// Function WBP_Lobby_Spectator_Right.WBP_Lobby_Spectator_Right_C.__9f1e0592-442a-8f9e-2140-beaa6ac31d7c_SourceToDest
// 0x0008 (0x0008 - 0x0000)
struct WBP_Lobby_Spectator_Right_C___9f1e0592_442a_8f9e_2140_beaa6ac31d7c_SourceToDest final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Right_C___9f1e0592_442a_8f9e_2140_beaa6ac31d7c_SourceToDest;

// Function WBP_Lobby_Spectator_Right.WBP_Lobby_Spectator_Right_C.__da0883df-4628-b11c-21e0-b5adb3d65165_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Lobby_Spectator_Right_C___da0883df_4628_b11c_21e0_b5adb3d65165_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Right_C___da0883df_4628_b11c_21e0_b5adb3d65165_SourceToDest;

// Function WBP_Lobby_Spectator_Right.WBP_Lobby_Spectator_Right_C.__e4a2b63b-423f-152a-08b0-fb9716e05e03_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Lobby_Spectator_Right_C___e4a2b63b_423f_152a_08b0_fb9716e05e03_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Lobby_Spectator_Right_C___e4a2b63b_423f_152a_08b0_fb9716e05e03_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
