#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EchoScans_Screen

#include "Basic.hpp"

#include "Tyr_classes.hpp"
#include "TyrSharedTypes_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_EchoScans_Screen.WBP_EchoScans_Screen_C
// 0x00B8 (0x05E0 - 0x0528)
class UWBP_EchoScans_Screen_C final : public UTyrActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         Scans_Box;                                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Map_Image;                                         // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DayMonthText;                                      // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVM_TerritoryScans_C*                   VM_TerritoryScans;                                 // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	float                                         ScanAnimationDuration;                             // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C[0x4];                                      // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        SFXScanning;                                       // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ScanAnimationTimerHandle;                          // 0x0568(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FApplyDropTableResponseData            RewardData;                                        // 0x0570(0x0068)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UVM_TerritoryScans_Scan_C*              VM_TerritoryScans_Scan;                            // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	bool BP_OnHandleBackAction();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_EchoScans_Screen(int32 EntryPoint);
	class UWBP_TerritoryScans_Scan_C* GetOrCreateScanWidget(int32 InScanIndex);
	void OnScanAnimationFinished();
	void PreConstruct(bool IsDesignTime);
	void SetScanViewModels(const TArray<class UVM_TerritoryScans_Scan_C*>& InScanViewModels);
	void UpdateDateText();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_EchoScans_Screen_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_EchoScans_Screen_C")
	}
	static class UWBP_EchoScans_Screen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EchoScans_Screen_C>();
	}
};
DUMPER7_ASSERTS_UWBP_EchoScans_Screen_C;

SDK_NAMESPACE_END
