#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Vehicle_Grid

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Vehicle_Grid.WBP_Vehicle_Grid_C
// 0x00A0 (0x05C8 - 0x0528)
class UWBP_Vehicle_Grid_C final : public UTyrActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Button_AlphaProgram_C*             WBP_Button_AlphaProgram;                           // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTyrTileView*                           TankTiles_Medium;                                  // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTyrTileView*                           TankTiles_Light;                                   // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTyrTileView*                           TankTiles_Heavy;                                   // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Section_Medium;                                    // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Section_Light;                                     // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Section_Heavy;                                     // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PilotGrid;                                         // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVM_Progression_C*                      Progression_ViewModel;                             // 0x0570(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Vehicles_Button_Tank_C*>    VehicleSelectionButtons;                           // 0x0578(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         MaxColumns_Medium;                                 // 0x0588(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxColumns_Heavy;                                  // 0x058C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxColumns_Light;                                  // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594[0x4];                                      // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicEntryBox*                       InEntryBox;                                        // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UVM_Vehicle_C* VehicleViewModel, int32 SelectedPilotIndex)> OnVehicleOverview; // 0x05A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UVM_Vehicle_C* VehicleViewModel)> OnVehicleLoadout;          // 0x05B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UCommonButtonBase*                      LastFocusedVehicle;                                // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Vehicle_Grid_TankTiles_Heavy_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BndEvt__WBP_Vehicle_Grid_TankTiles_Heavy_K2Node_ComponentBoundEvent_1_OnListEntryReleasedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BndEvt__WBP_Vehicle_Grid_TankTiles_Light_K2Node_ComponentBoundEvent_4_OnListEntryGeneratedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BndEvt__WBP_Vehicle_Grid_TankTiles_Light_K2Node_ComponentBoundEvent_5_OnListEntryReleasedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BndEvt__WBP_Vehicle_Grid_TankTiles_Medium_K2Node_ComponentBoundEvent_2_OnListEntryGeneratedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BndEvt__WBP_Vehicle_Grid_TankTiles_Medium_K2Node_ComponentBoundEvent_3_OnListEntryReleasedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BndEvt__WBP_Vehicle_Grid_WBP_Button_Text2_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void ExecuteUbergraph_WBP_Vehicle_Grid(int32 EntryPoint);
	void GetNextRowColumnForVehicleClassGrid(const struct FGameplayTag& InVehicleClassTag, class UUniformGridPanel* InGrid, int32* OutRow, int32* OutColumn);
	void GetVehicleProgression(const struct FGameplayTag& InVehicleTag, class UVM_Vehicle_LoadoutSlots_C** LoadoutSlots, class UVM_Vehicle_Level_C** CurrentVehicleLevel, class UVM_Vehicle_Levels_C** VehicleLevels);
	void InputAction_DT_InputActions_Vehicles_ClearVehicleBreadcrumbs_Clicked();
	void InputAction_DT_InputActions_Vehicles_EditLoadoutsShortcut_Clicked();
	void InternalSetVehicles_Grid(TArray<class UVM_Vehicle_C*>& InVehicles, class UUniformGridPanel* InGrid);
	void On_View_Vehicle_Loadout(class UVM_Vehicle_C* VehicleViewModel);
	void On_View_Vehicle_Overview(class UVM_Vehicle_C* VehicleViewModel);
	void OnVehicleWidgetFocused(class UCommonButtonBase* InButton);
	void RefreshPilotLevels();

	struct FTyrInputActionListenParam __0120cf8f_4ee4_d330_10cd_f1b7e8c25593_SourceToDest() const;
	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Vehicle_Grid_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Vehicle_Grid_C")
	}
	static class UWBP_Vehicle_Grid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Vehicle_Grid_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Vehicle_Grid_C;

SDK_NAMESPACE_END
