#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Clan_Create_LinkDiscord

#include "Basic.hpp"

#include "Tyr_structs.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Clan_Create_LinkDiscord.WBP_Clan_Create_LinkDiscord_C.BndEvt__WBP_Clan_Create_LinkDiscord_Confirm_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_C_BndEvt__WBP_Clan_Create_LinkDiscord_Confirm_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_C_BndEvt__WBP_Clan_Create_LinkDiscord_Confirm_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Clan_Create_LinkDiscord.WBP_Clan_Create_LinkDiscord_C.BndEvt__WBP_Clan_Create_LinkDiscord_DiscordServer_TreeView_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_C_BndEvt__WBP_Clan_Create_LinkDiscord_DiscordServer_TreeView_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_C_BndEvt__WBP_Clan_Create_LinkDiscord_DiscordServer_TreeView_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature;

// Function WBP_Clan_Create_LinkDiscord.WBP_Clan_Create_LinkDiscord_C.BndEvt__WBP_Clan_Create_LinkDiscord_Dismiss_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_C_BndEvt__WBP_Clan_Create_LinkDiscord_Dismiss_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_C_BndEvt__WBP_Clan_Create_LinkDiscord_Dismiss_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Clan_Create_LinkDiscord.WBP_Clan_Create_LinkDiscord_C.BndEvt__WBP_Clan_Create_LinkDiscord_RefreshList_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_C_BndEvt__WBP_Clan_Create_LinkDiscord_RefreshList_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_C_BndEvt__WBP_Clan_Create_LinkDiscord_RefreshList_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature;

// Function WBP_Clan_Create_LinkDiscord.WBP_Clan_Create_LinkDiscord_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_C_BP_OnHandleBackAction;

// Function WBP_Clan_Create_LinkDiscord.WBP_Clan_Create_LinkDiscord_C.ExecuteUbergraph_WBP_Clan_Create_LinkDiscord
// 0x0070 (0x0070 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_C_ExecuteUbergraph_WBP_Clan_Create_LinkDiscord final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVM_Clans_C*                            CallFunc_GetClansViewModel_ViewModel;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_Clan_Discord_Channel_C*             K2Node_DynamicCast_AsVM_Clan_Discord_Channel;      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Clan_Discord_Server_C*              K2Node_DynamicCast_AsVM_Clan_Discord_Server;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x004C(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_C_ExecuteUbergraph_WBP_Clan_Create_LinkDiscord;

// Function WBP_Clan_Create_LinkDiscord.WBP_Clan_Create_LinkDiscord_C.GetDiscordServerChannels
// 0x0048 (0x0048 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_C_GetDiscordServerChannels final
{
public:
	class UObject*                                InViewModel;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        Children;                                          // 0x0008(0x0010)(Parm, OutParm)
	class UVM_Clan_Discord_Server_C*              K2Node_DynamicCast_AsVM_Clan_Discord_Server;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetChannelError_bHasError;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Clan_Discord_Error_C*               CallFunc_GetChannelError_ChannelError;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_C_GetDiscordServerChannels;

// Function WBP_Clan_Create_LinkDiscord.WBP_Clan_Create_LinkDiscord_C.__5f0a9414-4486-fcaf-2dfa-1e9a17e3b0d1_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_C___5f0a9414_4486_fcaf_2dfa_1e9a17e3b0d1_SourceToDest final
{
public:
	ETyrButtonVariant                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSelectedDiscordChannel_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETyrButtonVariant                             CallFunc_ToPrimaryVariantIfEnabled_ReturnValue;    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_C___5f0a9414_4486_fcaf_2dfa_1e9a17e3b0d1_SourceToDest;

// Function WBP_Clan_Create_LinkDiscord.WBP_Clan_Create_LinkDiscord_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_C_BP_GetDesiredFocusTarget;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
