#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Ranked_Profile

#include "Basic.hpp"

#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Ranked_Profile.WBP_Ranked_Profile_C.ExecuteUbergraph_WBP_Ranked_Profile
// 0x0008 (0x0008 - 0x0000)
struct WBP_Ranked_Profile_C_ExecuteUbergraph_WBP_Ranked_Profile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_Profile_C_ExecuteUbergraph_WBP_Ranked_Profile;

// Function WBP_Ranked_Profile.WBP_Ranked_Profile_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Ranked_Profile_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_Profile_C_PreConstruct;

// Function WBP_Ranked_Profile.WBP_Ranked_Profile_C.SetHasUnlockedRanked
// 0x0010 (0x0010 - 0x0000)
struct WBP_Ranked_Profile_C_SetHasUnlockedRanked final
{
public:
	bool                                          bInHasUnlocked;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_Profile_C_SetHasUnlockedRanked;

// Function WBP_Ranked_Profile.WBP_Ranked_Profile_C.SetVM_Leaderboard_Rank_Current
// 0x0028 (0x0028 - 0x0000)
struct WBP_Ranked_Profile_C_SetVM_Leaderboard_Rank_Current final
{
public:
	class UVM_Leaderboard_Rank_C*                 ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_Profile_C_SetVM_Leaderboard_Rank_Current;

// Function WBP_Ranked_Profile.WBP_Ranked_Profile_C.SetVM_Leaderboard_Rank_SeasonBest
// 0x0028 (0x0028 - 0x0000)
struct WBP_Ranked_Profile_C_SetVM_Leaderboard_Rank_SeasonBest final
{
public:
	class UVM_Leaderboard_Rank_C*                 ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Ranked_Profile_C_SetVM_Leaderboard_Rank_SeasonBest;

// Function WBP_Ranked_Profile.WBP_Ranked_Profile_C.UpdateMinMaxVehicle
// 0x0078 (0x0078 - 0x0000)
struct WBP_Ranked_Profile_C_UpdateMinMaxVehicle final
{
public:
	int32                                         InMinMaxVehicle;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0010)()
};
DUMPER7_ASSERTS_WBP_Ranked_Profile_C_UpdateMinMaxVehicle;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
