#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TerritoryScans_Scan

#include "Basic.hpp"

#include "UMG_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_TerritoryScans_Scan.WBP_TerritoryScans_Scan_C.EndScanAnimation
// 0x0014 (0x0014 - 0x0000)
struct WBP_TerritoryScans_Scan_C_EndScanAnimation final
{
public:
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0004(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TerritoryScans_Scan_C_EndScanAnimation;

// Function WBP_TerritoryScans_Scan.WBP_TerritoryScans_Scan_C.ExecuteUbergraph_WBP_TerritoryScans_Scan
// 0x0014 (0x0014 - 0x0000)
struct WBP_TerritoryScans_Scan_C_ExecuteUbergraph_WBP_TerritoryScans_Scan final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x0004(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TerritoryScans_Scan_C_ExecuteUbergraph_WBP_TerritoryScans_Scan;

// Function WBP_TerritoryScans_Scan.WBP_TerritoryScans_Scan_C.PlayScanAnimation
// 0x0060 (0x0060 - 0x0000)
struct WBP_TerritoryScans_Scan_C_PlayScanAnimation final
{
public:
	double                                        Duration;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue_2;              // 0x0030(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue_3;              // 0x0040(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_Duration_ImplicitCast;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_Duration_ImplicitCast_1;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TerritoryScans_Scan_C_PlayScanAnimation;

// Function WBP_TerritoryScans_Scan.WBP_TerritoryScans_Scan_C.SetMapDesaturation
// 0x0010 (0x0010 - 0x0000)
struct WBP_TerritoryScans_Scan_C_SetMapDesaturation final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TerritoryScans_Scan_C_SetMapDesaturation;

// Function WBP_TerritoryScans_Scan.WBP_TerritoryScans_Scan_C.SetVM_TerritoryScans_Scan
// 0x0028 (0x0028 - 0x0000)
struct WBP_TerritoryScans_Scan_C_SetVM_TerritoryScans_Scan final
{
public:
	class UVM_TerritoryScans_Scan_C*              ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TerritoryScans_Scan_C_SetVM_TerritoryScans_Scan;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
