#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Vehicle_Button

#include "Basic.hpp"

#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Vehicle_Button.WBP_Vehicle_Button_C
// 0x0030 (0x15C0 - 0x1590)
class UWBP_Vehicle_Button_C final : public UTyrButtonBase
{
public:
	class UScaleBox*                              Pilot_ScaleBox;                                    // 0x1590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTyrLazyImage*                          Pilot_Image;                                       // 0x1598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVM_Vehicle_C*                          VM_Vehicle;                                        // 0x15A0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidgetSwitcher*                        BtnShape_Switcher;                                 // 0x15A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               AlphaLabel;                                        // 0x15B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanSelect;                                        // 0x15B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetCanSelect(bool bInCanSelect);
	void SetVM_Vehicle(class UVM_Vehicle_C* ViewModel);

	struct FTyrMaterialScalarParam __83ddf334_4286_cc2b_76b4_af9325d56a71_SourceToDest() const;
	ESlateVisibility __8d98092e_4d0e_e1b5_8546_4180efbc3e0f_SourceToDest() const;
	int32 __977201a4_402c_2d62_0237_caa38f21b5a8_SourceToDest() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Vehicle_Button_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Vehicle_Button_C")
	}
	static class UWBP_Vehicle_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Vehicle_Button_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Vehicle_Button_C;

SDK_NAMESPACE_END
