#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Play

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Play.WBP_Play_C
// 0x0210 (0x0738 - 0x0528)
class UWBP_Play_C final : public UTyrActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_News_C*                            WBP_News;                                          // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             WaitingText;                                       // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_103;                                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTyrVisibilityBorder*                   TerritoryScan_Visibility;                          // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TerritoryScans_Button_New_C*       TerritoryScan_Button;                              // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Team1CountContainer;                               // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SquadSize;                                         // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SquadRequirement_Text;                             // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                SquadRequirement_Border;                           // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SquadHeader;                                       // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SquadContainer;                                    // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Squad;                                             // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RightSideContainer;                                // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PartyListView_Empties;                             // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonListView*                        PartyListView;                                     // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PartyListSizeBox;                                  // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_4;                                         // 0x05B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTyrVisibilityBorder*                   News_Visibility;                                   // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MMRRestriction_Text;                               // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                MMRRestriction_Border;                             // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GameModeFlavorText;                                // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           GameMode_Panel;                                    // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CreatePartyContainer;                              // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CopyIcon;                                          // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CodeHint;                                          // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Vehicles_Button_NextUnlock_C*      Btn_NextUnlock;                                    // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Icon_C*                     Btn_LeaveParty;                                    // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Icon_C*                     Btn_JoinParty;                                     // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Text_C*                     Btn_JoinDiscord;                                   // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Icon_C*                     Btn_HideCode;                                      // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Text_C*                     Btn_CreateParty;                                   // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Text_C*                     Btn_CopyCode;                                      // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Party8Created;                                     // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Party8Left;                                        // 0x0640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Party2Created;                                     // 0x0648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Party2Left;                                        // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVM_Matchmaking_C*                      VM_Matchmaking;                                    // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVM_MainMenu_C*                         VM_MainMenu;                                       // 0x0660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             GameModeTitle;                                     // 0x0668(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             MatchmakingStatus_Text;                            // 0x0670(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 FindingSpinner;                                    // 0x0678(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	ETyrGameMode                                  EGameMode;                                         // 0x0680(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bStartingMatch;                                    // 0x0681(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_682[0x6];                                      // 0x0682(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   GameModeDescriptionText;                           // 0x0688(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimespan                              Time;                                              // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle;                                       // 0x06A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeGoal;                                          // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_Modal_MenuOptions_C*               ModalMenuOptions;                                  // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ConfirmationTextInput_C*           JoinPartyModal;                                    // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  PartyCreatedListener;                              // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  PartyJoinedListener;                               // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  PartyLeftListener;                                 // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  PartyDisbandedListener;                            // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  PartyJoinFailedListener;                           // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  PartyMetadataListener;                             // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  FoundMatchListener;                                // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CreatedMatchListener;                              // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  PartyRequestDisbandListener;                       // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  PartyRefreshListener;                              // 0x0708(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               WBP_MatchmakingNotification;                       // 0x0710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bMaxSquad8;                                        // 0x0718(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_719[0x7];                                      // 0x0719(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PartyCode;                                         // 0x0720(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UObject*                                SettingsChangedListener;                           // 0x0730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AfterPush_0D6F71F9430AD30F09ABB0A2ACE71414(class UCommonActivatableWidget* UserWidget);
	void AfterPush_A2B4C08845BD3905796D15B49316CD88(class UCommonActivatableWidget* UserWidget);
	void AfterPush_B1F95A3C4F214E5626AB829655B6C1FD(class UCommonActivatableWidget* UserWidget);
	void AfterPush_BA649A84429BF4CF3B2AAF8BF9A21182(class UCommonActivatableWidget* UserWidget);
	void AfterPush_FB531C754E53A81735971FAC84E747DA(class UCommonActivatableWidget* UserWidget);
	void BeforePush_0D6F71F9430AD30F09ABB0A2ACE71414(class UCommonActivatableWidget* UserWidget);
	void BeforePush_A2B4C08845BD3905796D15B49316CD88(class UCommonActivatableWidget* UserWidget);
	void BeforePush_B1F95A3C4F214E5626AB829655B6C1FD(class UCommonActivatableWidget* UserWidget);
	void BeforePush_BA649A84429BF4CF3B2AAF8BF9A21182(class UCommonActivatableWidget* UserWidget);
	void BeforePush_FB531C754E53A81735971FAC84E747DA(class UCommonActivatableWidget* UserWidget);
	void BindToTerritoryScanEvents();
	void BndEvt__WBP_Play_Btn_Copy_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Play_Btn_CreateParty_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Play_Btn_Join_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Play_Btn_Leave_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Play_Btn_NextUnlock_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Play_WBP_Button_Icon_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Play_WBP_Button_Text_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Play_WBP_News_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Play_WBP_TerritoryScans_Button_New_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Close();
	void CloseDialog(class UCommonButtonBase* Button);
	void Construct();
	void CreateJoinCodeDialogDescriptor(class UTyrGameDialogDescriptor** Descriptor, class UVM_Dialog_TextInput_C** TextInputViewModel);
	class UVM_Dialog_TextInput_C* CreateTextInputViewModel();
	void Destruct();
	bool Enable_Based_on_Party();
	void ExecuteUbergraph_WBP_Play(int32 EntryPoint);
	ESlateVisibility Get_Create_Party_Visibility();
	ESlateVisibility Get_PlayButton_Visibility();
	ESlateVisibility Get_Waiting_Leader_Visibility();
	ESlateVisibility GetPartyVisibilityCollapsed();
	ESlateVisibility GetPartyVisibilityHidden();
	ESlateVisibility GetPartyVisibilityVisible();
	ESlateVisibility GetSteamBuildVisibility();
	void InputAction_DT_InputActions_Play_CancelMatchmaking_Clicked();
	void InputAction_DT_InputActions_Play_ChangeGameMode_Clicked();
	void InputAction_DT_InputActions_Play_JoinCustomGame_Clicked();
	void InputAction_DT_InputActions_Play_Play_Clicked();
	void InputAction_DT_InputActions_Play_Ready_Clicked();
	void InputAction_DT_InputActions_Play_Unready_Clicked();
	void InputAction_DT_InputActions_Play_WatchQuickstart_Clicked();
	void InputAction_DT_UniversalAction_OpenEscMenu_Clicked();
	void JoinParty(class UCommonButtonBase* Button);
	class UWidget* NavigateRightFromLeft(EUINavigation InNavigation);
	void On_Party_Created_Message(const struct FTyrPartyCreatedMessage& Payload);
	void On_Party_Disbanded_Message();
	void On_Party_Join_Failed_Message(const struct FTyrPartyJoinFailedMessage& Payload);
	void On_Party_Joined_Message(const struct FTyrPartyJoinedMessage& Payload);
	void On_Party_Left_Message(const struct FTyrPartyLeftMessage& Payload);
	void On_Party_Refreshed();
	void On_Request_Leave_Party_Message();
	void OnActionButtonAdded(class UTyrBoundActionButton* ActionButton, const class FName& InputAction);
	void OnActionButtonRemoved(class UTyrBoundActionButton* ActionButton, const class FName& InputAction);
	void OnMessageReceived_7E33938440A9BE36C86BA780EF04387F(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_8349A73E47EADEAE42830CA2449B792F(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_8BB891174A5F08F76FB8D69A792368A3(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_A46F69CF4E5A36CB269A25857F9BA99C(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_A82FA79B46110A7743AEBFAF11134AEE(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_D6EE23064A08B70DB4063CA408601929(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_E4A8A9DB473B125A8461C3898D6A9CF3(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_EDDA073B413F739EC06951A440D844B7(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnResult_2A7CBA6F463BE70773C763AC5CA82055(ETyrMessagingResult Result);
	void OnResult_E54796A544AFE9A423B1FB8441D99457(ETyrMessagingResult Result);
	void PartyCreatedAnim();
	void PartyLeftAnim();
	void TryShowTerritoryScanTutorial();
	void UnbindFromTerritoryScanEvents();
	void UpdateFocusOnSquadUpdate();
	void UpdateJoinCodeForParty(class UTyrOnlineUserInfo* InUserInfo);
	void UpdatePartyList();

	ESlateVisibility __079e6da0_4ea7_7343_668b_8b89c4821715_SourceToDest() const;
	struct FTyrInputActionListenParam __09004082_46f0_6d31_8db1_5a8642ac06d6_SourceToDest() const;
	ESlateVisibility __0b85c198_4535_5345_e74d_25889b02f806_SourceToDest() const;
	struct FTyrInputActionListenParam __2db42338_44da_ba60_2dfe_a094297f6c93_SourceToDest() const;
	struct FTyrInputActionEnableParam __33a5ee4a_43cb_2325_fb9f_dcb47eb371fc_SourceToDest() const;
	struct FTyrInputActionLabelParam __463417fb_4cad_6b06_59d6_d89b3dbd5f59_SourceToDest() const;
	struct FTyrInputActionEnableParam __6d5f52e4_45ba_6ba1_1923_5b88e7a1df4e_SourceToDest() const;
	struct FTyrInputActionListenParam __6e049ae9_47dc_e9b8_007d_e28bcd27fdaa_SourceToDest() const;
	ESlateVisibility __7a96fc4a_48ef_b80e_3a45_adb9617fd443_SourceToDest() const;
	struct FTyrInputActionListenParam __8a05aba6_433a_b246_2b05_cd8e242a0f16_SourceToDest() const;
	struct FTyrInputActionListenParam __b02f1281_43ef_4205_6f18_49a2e7e44a9d_SourceToDest() const;
	double __c4166072_4ef9_2300_c530_578d2e4f60d4_SourceToDest() const;
	struct FTyrInputActionLabelParam __ConversionFunction4119233f_949b_358c_9a70_173807741425() const;
	double __d9a8671a_4fb9_95d6_ec7e_1db35eec0db9_SourceToDest() const;
	ESlateVisibility __f416f6f7_42c8_cee5_6ff9_bca47a6c89ab_SourceToDest() const;
	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Play_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Play_C")
	}
	static class UWBP_Play_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Play_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Play_C;

SDK_NAMESPACE_END
