#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Loadout_TechTree_Node

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Tyr_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Loadout_TechTree_Node.WBP_Loadout_TechTree_Node_C.ExecuteUbergraph_WBP_Loadout_TechTree_Node
// 0x0004 (0x0004 - 0x0000)
struct WBP_Loadout_TechTree_Node_C_ExecuteUbergraph_WBP_Loadout_TechTree_Node final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_Node_C_ExecuteUbergraph_WBP_Loadout_TechTree_Node;

// Function WBP_Loadout_TechTree_Node.WBP_Loadout_TechTree_Node_C.OnKeyUp
// 0x02C8 (0x02C8 - 0x0000)
struct WBP_Loadout_TechTree_Node_C_OnKeyUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0080(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0138(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0150(0x00B8)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0210(0x00B8)()
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_Node_C_OnKeyUp;

// Function WBP_Loadout_TechTree_Node.WBP_Loadout_TechTree_Node_C.OnMouseButtonUp
// 0x0300 (0x0300 - 0x0000)
struct WBP_Loadout_TechTree_Node_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0170(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0188(0x00B8)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0248(0x00B8)()
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_Node_C_OnMouseButtonUp;

// Function WBP_Loadout_TechTree_Node.WBP_Loadout_TechTree_Node_C.SetupTalentNode
// 0x0018 (0x0018 - 0x0000)
struct WBP_Loadout_TechTree_Node_C_SetupTalentNode final
{
public:
	class UVM_TechTree_Node_C*                    InNodeViewModel;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVM_TechTree_Node_C* Node)> InNodeFocusedDelegate;                          // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_Node_C_SetupTalentNode;

// Function WBP_Loadout_TechTree_Node.WBP_Loadout_TechTree_Node_C.SetVM_TechTree_Node
// 0x0028 (0x0028 - 0x0000)
struct WBP_Loadout_TechTree_Node_C_SetVM_TechTree_Node final
{
public:
	class UVM_TechTree_Node_C*                    ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_Node_C_SetVM_TechTree_Node;

// Function WBP_Loadout_TechTree_Node.WBP_Loadout_TechTree_Node_C.TryAddPoint
// 0x0014 (0x0014 - 0x0000)
struct WBP_Loadout_TechTree_Node_C_TryAddPoint final
{
public:
	bool                                          CallFunc_TryAddTalentPoint_DidAdd;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x0004(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_Node_C_TryAddPoint;

// Function WBP_Loadout_TechTree_Node.WBP_Loadout_TechTree_Node_C.TryRemovePoint
// 0x0001 (0x0001 - 0x0000)
struct WBP_Loadout_TechTree_Node_C_TryRemovePoint final
{
public:
	bool                                          CallFunc_TryRemoveTalentPoint_DidRemove;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_Node_C_TryRemovePoint;

// Function WBP_Loadout_TechTree_Node.WBP_Loadout_TechTree_Node_C.__08eb53de-4bda-d1a7-30a5-ff9e60765363_SourceToDest
// 0x0024 (0x0024 - 0x0000)
struct WBP_Loadout_TechTree_Node_C___08eb53de_4bda_d1a7_30a5_ff9e60765363_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMaxPoints_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_Node_C___08eb53de_4bda_d1a7_30a5_ff9e60765363_SourceToDest;

// Function WBP_Loadout_TechTree_Node.WBP_Loadout_TechTree_Node_C.__09e229d6-4134-df7e-be23-4e9be8ba1915_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_Loadout_TechTree_Node_C___09e229d6_4134_df7e_be23_4e9be8ba1915_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMaxPoints_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_Node_C___09e229d6_4134_df7e_be23_4e9be8ba1915_SourceToDest;

// Function WBP_Loadout_TechTree_Node.WBP_Loadout_TechTree_Node_C.__5666077b-4d0e-3e8f-d1e1-69a08825628e_SourceToDest
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_Loadout_TechTree_Node_C___5666077b_4d0e_3e8f_d1e1_69a08825628e_SourceToDest final
{
public:
	struct FTyrMaterialTextureParam               ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm)
	struct FTyrMaterialTextureParam               CallFunc_ToTextureMaterialParam__Texture__ReturnValue; // 0x0060(0x0060)()
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_Node_C___5666077b_4d0e_3e8f_d1e1_69a08825628e_SourceToDest;

// Function WBP_Loadout_TechTree_Node.WBP_Loadout_TechTree_Node_C.__7238e57e-453a-644a-cf26-529c0d16efea_SourceToDest
// 0x0018 (0x0018 - 0x0000)
struct WBP_Loadout_TechTree_Node_C___7238e57e_453a_644a_cf26_529c0d16efea_SourceToDest final
{
public:
	struct FTyrMaterialScalarParam                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FTyrMaterialScalarParam                CallFunc_ToScalarMaterialParam__Boolean__ReturnValue; // 0x000C(0x000C)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_Node_C___7238e57e_453a_644a_cf26_529c0d16efea_SourceToDest;

// Function WBP_Loadout_TechTree_Node.WBP_Loadout_TechTree_Node_C.__93a1be49-4d22-8dbf-18c0-b9bb0d558b64_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Loadout_TechTree_Node_C___93a1be49_4d22_8dbf_18c0_b9bb0d558b64_SourceToDest final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_Node_C___93a1be49_4d22_8dbf_18c0_b9bb0d558b64_SourceToDest;

// Function WBP_Loadout_TechTree_Node.WBP_Loadout_TechTree_Node_C.__99c47ba6-40e8-17fa-c942-b88c4c655967_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Loadout_TechTree_Node_C___99c47ba6_40e8_17fa_c942_b88c4c655967_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_Node_C___99c47ba6_40e8_17fa_c942_b88c4c655967_SourceToDest;

// Function WBP_Loadout_TechTree_Node.WBP_Loadout_TechTree_Node_C.__f32494cb-4b87-2a6c-92c5-72b7a021b974_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_Loadout_TechTree_Node_C___f32494cb_4b87_2a6c_92c5_72b7a021b974_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMaxPoints_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_Node_C___f32494cb_4b87_2a6c_92c5_72b7a021b974_SourceToDest;

// Function WBP_Loadout_TechTree_Node.WBP_Loadout_TechTree_Node_C.__fc7b476f-4a89-5423-0f8e-61ac3fd6441e_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Loadout_TechTree_Node_C___fc7b476f_4a89_5423_0f8e_61ac3fd6441e_SourceToDest final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_WBP_Loadout_TechTree_Node_C___fc7b476f_4a89_5423_0f8e_61ac3fd6441e_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
