#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Lobby_Loadout_Overview

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Lobby_Loadout_Overview.WBP_Lobby_Loadout_Overview_C
// 0x00B0 (0x05D8 - 0x0528)
class UWBP_Lobby_Loadout_Overview_C final : public UTyrActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpacer*                                TimerSpacer;                                       // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tank_Text;                                         // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SlotName_Text;                                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Pilot_Text;                                        // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTyrListView*                           LoadoutSlots_ListView;                             // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Lobby_Loadout_SlotDetail_KeystoneNode_C* Keystone_SlotDetail;                         // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Text_C*                     Confirmation_Button;                               // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Lobby_Loadout_SlotDetail_LockableSlot_C* Component2_SlotDetail;                       // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Lobby_Loadout_SlotDetail_LockableSlot_C* Component1_SlotDetail;                       // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Lobby_Loadout_SlotDetail_LockableSlot_C* Component0_SlotDetail;                       // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Lobby_Loadout_SlotDetail_LockableSlot_C* Ammo1_SlotDetail;                            // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Lobby_Loadout_SlotDetail_LockableSlot_C* Ammo0_SlotDetail;                            // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BlinkContent;                                      // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_C*                          VM_Vehicle;                                        // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UVM_Vehicle_Levels_C*                   VM_Vehicle_Levels;                                 // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UVM_Vehicle_LoadoutSlots_C*             VM_Vehicle_LoadoutSlots;                           // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UCommonTextBlock*                       Level_Text;                                        // 0x05B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Hint_Details_Class_Icon;                           // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetSwitcher*                        LoadoutContent_Switcher;                           // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsShowingConfirmation;                            // 0x05D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Lobby_Loadout_Overview_Confirmation_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Lobby_Loadout_Overview_LoadoutSlots_ListView_K2Node_ComponentBoundEvent_0_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void BP_OnActivated();
	bool BP_OnHandleBackAction();
	void ExecuteUbergraph_WBP_Lobby_Loadout_Overview(int32 EntryPoint);
	class UWBP_Lobby_Loadout_SlotDetail_LockableSlot_C* GetAmmoSlotWidget(int32 InSlot);
	class UWBP_Lobby_Loadout_SlotDetail_LockableSlot_C* GetComponentSlotWidget(int32 InSlot);
	void OnInitialized();
	void OnResult_0C7C2F1448F3A004B9B16C8E8750A43B(ETyrMessagingResult Result);
	void OnResult_73D81F5D44AB4FC9D4B7B4BD1AE7CB49(ETyrMessagingResult Result);
	void SetViewModels(class UVM_Vehicle_C* InVehicle, class UVM_Vehicle_Levels_C* InVehicleLevels, class UVM_Vehicle_LoadoutSlots_C* InVehicleLoadoutSlots);
	void SetVM_Vehicle(class UVM_Vehicle_C* ViewModel);
	void SetVM_Vehicle_Levels(class UVM_Vehicle_Levels_C* ViewModel);
	void SetVM_Vehicle_LoadoutSlots(class UVM_Vehicle_LoadoutSlots_C* ViewModel);
	void TryShowConfirmation();
	void UpdateAmmoSlot(int32 InSlot, class UVM_Ammunition_C* InAmmunition, class UVM_Vehicle_Loadout_C* InLoadout, class UVM_Vehicle_Details_C* InVehicle);
	void UpdateComponentSlot(int32 InSlot, class UVM_Vehicle_Components_C* InComponents, class UVM_Vehicle_Loadout_C* InLoadout, class UVM_Vehicle_Details_C* InVehicle);
	void UpdateSelectedLoadout(class UVM_Vehicle_Loadout_C* InSelectedLoadout);

	int32 __52c33e3a_4bed_4ac8_99bd_c18440fa4b94_SourceToDest() const;
	void __908d8112_47ab_e2a2_5856_82867f10f5a7_SourceToDest(class UTexture2D** Icon) const;
	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Lobby_Loadout_Overview_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Lobby_Loadout_Overview_C")
	}
	static class UWBP_Lobby_Loadout_Overview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Lobby_Loadout_Overview_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Lobby_Loadout_Overview_C;

SDK_NAMESPACE_END
