#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_Scoreboard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_HUD_Scoreboard.WBP_HUD_Scoreboard_C
// 0x0038 (0x0378 - 0x0340)
class UWBP_HUD_Scoreboard_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UListView*                              EnemyDetailedList;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListView*                              AllyDetailedList;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UBP_VehicleClassPlayerInfoHolder_C*> CachedAllyPlayerInfoHolders;                   // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UBP_VehicleClassPlayerInfoHolder_C*> CachedEnemyPlayerInfoHolders;                  // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_WBP_HUD_Scoreboard(int32 EntryPoint);
	void OnMessageReceived_48DC56CB416000695A381F9B8EF9C33B(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_ED48FD544E1BDB44127F07817C15D3FB(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void Predicate_ComparePlayerStateToPlayerInfoHolder(const class UObject* InPlayerState, const class UObject* InPlayerInfoHolder, bool* OutResult);
	void UpdateAllPlayerLists();
	void UpdatePlayerInfoHoldersInPlace(TArray<class ATyrPlayerStateBase*>& InTeamPlayerStates, TArray<class UBP_VehicleClassPlayerInfoHolder_C*>& InTeamPlayerInfoHolders, bool* bOutSuccess);
	void UpdateTeamPlayerList(TArray<class ATyrPlayerStateBase*>& InPlayerStates, TArray<class UBP_VehicleClassPlayerInfoHolder_C*>& InPlayerInfoHolders, class UListView* InListView, TArray<class UBP_VehicleClassPlayerInfoHolder_C*>* OutPlayerInfoHolders);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_HUD_Scoreboard_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_HUD_Scoreboard_C")
	}
	static class UWBP_HUD_Scoreboard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_Scoreboard_C>();
	}
};
DUMPER7_ASSERTS_UWBP_HUD_Scoreboard_C;

SDK_NAMESPACE_END
