#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ClaimExperience_Unlock_Panel

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_ClaimExperience_Unlock_Panel.WBP_ClaimExperience_Unlock_Panel_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_ClaimExperience_Unlock_Panel_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimExperience_Unlock_Panel_C_BP_OnHandleBackAction;

// Function WBP_ClaimExperience_Unlock_Panel.WBP_ClaimExperience_Unlock_Panel_C.ExecuteUbergraph_WBP_ClaimExperience_Unlock_Panel
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_ClaimExperience_Unlock_Panel_C_ExecuteUbergraph_WBP_ClaimExperience_Unlock_Panel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_ClaimExperience_UnlockProgress_C* UnlockProgressWidget)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ClaimExperience_LevelProgress_C*   CallFunc_BP_AddWidget_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ClaimExperience_UnlockProgress_C*  K2Node_CustomEvent_UnlockProgressWidget_1;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasHandledBonusGains_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ClaimExperience_LevelProgress_C*   K2Node_CustomEvent_LevelProgressWidget_1;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ClaimExperience_LevelProgress_C*   K2Node_CustomEvent_LevelProgressWidget;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ClaimExperience_UnlockProgress_C*  K2Node_CustomEvent_UnlockProgressWidget;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasHandledBonusGains_ReturnValue_1;       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ClaimExperience_UnlockProgress_C*  CallFunc_BP_AddWidget_ReturnValue_1;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_ClaimExperience_UnlockProgress_C* UnlockProgressWidget)> K2Node_CreateDelegate_OutputDelegate_1; // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfWidgetsInContainer_ReturnValue; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_GetActiveWidget_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ClaimExperience_UnlockProgress_C*  CallFunc_GetActiveUnlockQueueWidget_ReturnValue;   // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayNextBonusGainAnimation_DidPlayBonusAnimation; // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ClaimExperience_LevelProgress_C*   CallFunc_GetActiveLevelQueueWidget_ReturnValue;    // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ClaimExperience_LevelProgress_C*   CallFunc_GetActiveLevelQueueWidget_ReturnValue_1;  // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryResumeUnlockAnimation_bDidResumeAnimation; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_TryResumeUnlockAnimation_RemainingDuration; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_ClaimExperience_LevelProgress_C* LevelProgressWidget)> K2Node_CreateDelegate_OutputDelegate_2; // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_ClaimExperience_LevelProgress_C* LevelProgressWidget)> K2Node_CreateDelegate_OutputDelegate_3; // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ClaimExperience_UnlockProgress_C*  CallFunc_GetActiveUnlockQueueWidget_ReturnValue_1; // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayNextBonusGainAnimation_DidPlayBonusAnimation_1; // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimExperience_Unlock_Panel_C_ExecuteUbergraph_WBP_ClaimExperience_Unlock_Panel;

// Function WBP_ClaimExperience_Unlock_Panel.WBP_ClaimExperience_Unlock_Panel_C.GetActiveLevelQueueWidget
// 0x0020 (0x0020 - 0x0000)
struct WBP_ClaimExperience_Unlock_Panel_C_GetActiveLevelQueueWidget final
{
public:
	class UWBP_ClaimExperience_LevelProgress_C*   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ClaimExperience_LevelProgress_C*   K2Node_DynamicCast_AsWBP_Claim_Experience_Level_Progress; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimExperience_Unlock_Panel_C_GetActiveLevelQueueWidget;

// Function WBP_ClaimExperience_Unlock_Panel.WBP_ClaimExperience_Unlock_Panel_C.GetActiveUnlockQueueWidget
// 0x0020 (0x0020 - 0x0000)
struct WBP_ClaimExperience_Unlock_Panel_C_GetActiveUnlockQueueWidget final
{
public:
	class UWBP_ClaimExperience_UnlockProgress_C*  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ClaimExperience_UnlockProgress_C*  K2Node_DynamicCast_AsWBP_Claim_Experience_Unlock_Progress; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimExperience_Unlock_Panel_C_GetActiveUnlockQueueWidget;

// Function WBP_ClaimExperience_Unlock_Panel.WBP_ClaimExperience_Unlock_Panel_C.InitializeFromClaimExperience
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_ClaimExperience_Unlock_Panel_C_InitializeFromClaimExperience final
{
public:
	class UVM_ClaimExperience_C*                  InClaimExperience;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Loc_VehicleUnlockProgressIndex;                    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ClaimExperience_UnlockProgress_C*  Loc_VehicleUnlockProgressWidget;                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0030(0x0010)()
	TDelegate<void(class UWBP_ClaimExperience_UnlockProgress_C* UnlockProgressWidget)> K2Node_CreateDelegate_OutputDelegate; // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_ClaimExperience_UnlockProgress_C* UnlockProgressWidget)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ClaimExperience_UnlockProgress_C*  CallFunc_BP_AddWidget_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfBattlesClaimed_ReturnValue;    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0080(0x0010)()
	bool                                          CallFunc_DidGainAnyXP_ReturnValue;                 // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfVehiclesGainingLevelExperience_NumUniqueVehicles; // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_ClaimExperience_VehicleUnlock_C*    CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimExperience_Unlock_Panel_C_InitializeFromClaimExperience;

// Function WBP_ClaimExperience_Unlock_Panel.WBP_ClaimExperience_Unlock_Panel_C.InitializeVehicleGainingLevelExperience
// 0x0070 (0x0070 - 0x0000)
struct WBP_ClaimExperience_Unlock_Panel_C_InitializeVehicleGainingLevelExperience final
{
public:
	class UVM_ClaimExperience_C*                  InClaimExperience;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ClaimExperience_LevelProgress_C*   Loc_LevelProgressWidget;                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Loc_LevelProgressIndex;                            // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_ClaimExperience_LevelProgress_C* LevelProgressWidget)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_ClaimExperience_VehicleLevel_C*     CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_ClaimExperience_VehicleLevel_C*     CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_ClaimExperience_LevelProgress_C* LevelProgressWidget)> K2Node_CreateDelegate_OutputDelegate_1; // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ClaimExperience_LevelProgress_C*   CallFunc_BP_AddWidget_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimExperience_Unlock_Panel_C_InitializeVehicleGainingLevelExperience;

// Function WBP_ClaimExperience_Unlock_Panel.WBP_ClaimExperience_Unlock_Panel_C.On Level Progress Bonus Ready
// 0x0008 (0x0008 - 0x0000)
struct WBP_ClaimExperience_Unlock_Panel_C_On_Level_Progress_Bonus_Ready final
{
public:
	class UWBP_ClaimExperience_LevelProgress_C*   LevelProgressWidget;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimExperience_Unlock_Panel_C_On_Level_Progress_Bonus_Ready;

// Function WBP_ClaimExperience_Unlock_Panel.WBP_ClaimExperience_Unlock_Panel_C.On Transition To Next Vehicle Level
// 0x0008 (0x0008 - 0x0000)
struct WBP_ClaimExperience_Unlock_Panel_C_On_Transition_To_Next_Vehicle_Level final
{
public:
	class UWBP_ClaimExperience_LevelProgress_C*   LevelProgressWidget;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimExperience_Unlock_Panel_C_On_Transition_To_Next_Vehicle_Level;

// Function WBP_ClaimExperience_Unlock_Panel.WBP_ClaimExperience_Unlock_Panel_C.On Transition To Next Vehicle Unlock
// 0x0008 (0x0008 - 0x0000)
struct WBP_ClaimExperience_Unlock_Panel_C_On_Transition_To_Next_Vehicle_Unlock final
{
public:
	class UWBP_ClaimExperience_UnlockProgress_C*  UnlockProgressWidget;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimExperience_Unlock_Panel_C_On_Transition_To_Next_Vehicle_Unlock;

// Function WBP_ClaimExperience_Unlock_Panel.WBP_ClaimExperience_Unlock_Panel_C.On Unlock Progress Queue Finished
// 0x0008 (0x0008 - 0x0000)
struct WBP_ClaimExperience_Unlock_Panel_C_On_Unlock_Progress_Queue_Finished final
{
public:
	class UWBP_ClaimExperience_UnlockProgress_C*  UnlockProgressWidget;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimExperience_Unlock_Panel_C_On_Unlock_Progress_Queue_Finished;

// Function WBP_ClaimExperience_Unlock_Panel.WBP_ClaimExperience_Unlock_Panel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ClaimExperience_Unlock_Panel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ClaimExperience_Unlock_Panel_C_PreConstruct;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
