#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cosmetics_VFX_List

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Cosmetics_VFX_List.WBP_Cosmetics_VFX_List_C
// 0x0050 (0x0578 - 0x0528)
class UWBP_Cosmetics_VFX_List_C final : public UTyrActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Button_Text_C*                     WBP_Button_Text;                                   // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTyrTileView*                           Vfx_TileView;                                      // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Rarity_Label_C*                    Vfx_RarityLabel;                                   // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RarityLabel_Text;                                  // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EquippedLabel_Border;                              // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnSelectionChanged;                                // 0x0558(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVM_Cosmetics_Vehicle_C*                VM_Cosmetics_Vehicle;                              // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UCommonTextBlock*                       VfxName_Text;                                      // 0x0568(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                VfxLocked_Indicator;                               // 0x0570(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Cosmetics_VFX_List_Vfx_TileView_K2Node_ComponentBoundEvent_2_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__WBP_Cosmetics_VFX_List_WBP_Button_Text_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void ExecuteUbergraph_WBP_Cosmetics_VFX_List(int32 EntryPoint);
	void InputAction_DT_Settings_SaveActions_SaveClose_Clicked();
	void SaveAndOrClose();
	void SetVM_Cosmetics_Vehicle(class UVM_Cosmetics_Vehicle_C* ViewModel);
	void UpdateConfirmStyleVisibility();

	double __18504218_4ee4_9b10_7c7e_5da63c6dda06_SourceToDest() const;
	ESlateVisibility __18b29822_4c3c_fd8f_2ff8_828b08ad1fa5_SourceToDest() const;
	ESlateVisibility __ConversionFunction3e414e62_adc9_3bda_92c0_fd868df075d9() const;
	ESlateVisibility __dba5f149_4f6a_8a8c_a5e8_d783941aaf06_SourceToDest() const;
	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Cosmetics_VFX_List_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Cosmetics_VFX_List_C")
	}
	static class UWBP_Cosmetics_VFX_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Cosmetics_VFX_List_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Cosmetics_VFX_List_C;

SDK_NAMESPACE_END
