#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Clan_Create_LinkDiscord_Server_Button

#include "Basic.hpp"

#include "UMG_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Clan_Create_LinkDiscord_Server_Button.WBP_Clan_Create_LinkDiscord_Server_Button_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_Server_Button_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_Server_Button_C_BP_OnItemExpansionChanged;

// Function WBP_Clan_Create_LinkDiscord_Server_Button.WBP_Clan_Create_LinkDiscord_Server_Button_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_Server_Button_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_Server_Button_C_BP_OnItemSelectionChanged;

// Function WBP_Clan_Create_LinkDiscord_Server_Button.WBP_Clan_Create_LinkDiscord_Server_Button_C.ExecuteUbergraph_WBP_Clan_Create_LinkDiscord_Server_Button
// 0x0018 (0x0018 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_Server_Button_C_ExecuteUbergraph_WBP_Clan_Create_LinkDiscord_Server_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_Server_Button_C_ExecuteUbergraph_WBP_Clan_Create_LinkDiscord_Server_Button;

// Function WBP_Clan_Create_LinkDiscord_Server_Button.WBP_Clan_Create_LinkDiscord_Server_Button_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_Server_Button_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_Server_Button_C_OnListItemObjectSet;

// Function WBP_Clan_Create_LinkDiscord_Server_Button.WBP_Clan_Create_LinkDiscord_Server_Button_C.SetEntry
// 0x0028 (0x0028 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_Server_Button_C_SetEntry final
{
public:
	class UVM_Clan_Discord_Server_C*              ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_Server_Button_C_SetEntry;

// Function WBP_Clan_Create_LinkDiscord_Server_Button.WBP_Clan_Create_LinkDiscord_Server_Button_C.__e9aa71be-4cd8-2022-987d-e58132a02266_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_Server_Button_C___e9aa71be_4cd8_2022_987d_e58132a02266_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_Server_Button_C___e9aa71be_4cd8_2022_987d_e58132a02266_SourceToDest;

// Function WBP_Clan_Create_LinkDiscord_Server_Button.WBP_Clan_Create_LinkDiscord_Server_Button_C.__f5f8b063-445e-ac86-a7b0-158dfc2f74c1_SourceToDest
// 0x0010 (0x0010 - 0x0000)
struct WBP_Clan_Create_LinkDiscord_Server_Button_C___f5f8b063_445e_ac86_a7b0_158dfc2f74c1_SourceToDest final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Clan_Create_LinkDiscord_Server_Button_C___f5f8b063_445e_ac86_a7b0_158dfc2f74c1_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
