#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Vehicle_Detail_ProgressBar

#include "Basic.hpp"

#include "UMG_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Vehicle_Detail_ProgressBar.WBP_Vehicle_Detail_ProgressBar_C.ExecuteUbergraph_WBP_Vehicle_Detail_ProgressBar
// 0x0010 (0x0010 - 0x0000)
struct WBP_Vehicle_Detail_ProgressBar_C_ExecuteUbergraph_WBP_Vehicle_Detail_ProgressBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_ProgressBar_C_ExecuteUbergraph_WBP_Vehicle_Detail_ProgressBar;

// Function WBP_Vehicle_Detail_ProgressBar.WBP_Vehicle_Detail_ProgressBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Vehicle_Detail_ProgressBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_ProgressBar_C_PreConstruct;

// Function WBP_Vehicle_Detail_ProgressBar.WBP_Vehicle_Detail_ProgressBar_C.SetVM_Vehicle_Level
// 0x0028 (0x0028 - 0x0000)
struct WBP_Vehicle_Detail_ProgressBar_C_SetVM_Vehicle_Level final
{
public:
	class UVM_Vehicle_Level_C*                    ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_ProgressBar_C_SetVM_Vehicle_Level;

// Function WBP_Vehicle_Detail_ProgressBar.WBP_Vehicle_Detail_ProgressBar_C.__9a64d9cd-4395-d876-46b4-1da7b630e907_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Vehicle_Detail_ProgressBar_C___9a64d9cd_4395_d876_46b4_1da7b630e907_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Vehicle_Detail_ProgressBar_C___9a64d9cd_4395_d876_46b4_1da7b630e907_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
