#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Loadout_TechTree_Tier

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Loadout_TechTree_Tier.WBP_Loadout_TechTree_Tier_C
// 0x0070 (0x03D8 - 0x0368)
class UWBP_Loadout_TechTree_Tier_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTyrGridPanel*                          Node_GridPanel;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Divider_SizeBox;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundGradient;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowBackgroundGradient;                            // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideBackgroundGradient;                            // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVM_TechTree_Tier_C*                    VM_TechTree_Tier;                                  // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UCommonTextBlock*                       PointsRequired_Text;                               // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	double                                        RequiredPointsDividerHeight;                       // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowRequiredPoints;                               // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPreviewNodeLinks;                                 // 0x03B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2[0x6];                                      // 0x03B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UVM_TechTree_Node_C* Node)> OnNodeFocused;                   // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        KeystoneNodeSpacing;                               // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        KeystoneLinkOffset;                                // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddNodeWidget(int32 InRow, TSubclassOf<class UUserWidget> InNodeClass, class UUserWidget** NodeWidget, class UGridSlot** GridSlot);
	void AnimateTierUnlocked(bool bInIsUnlocked);
	void ExecuteUbergraph_WBP_Loadout_TechTree_Tier(int32 EntryPoint);
	struct FMargin GetKeystoneSlotPadding(bool bInIsTopKeystone, double InOffset);
	void On_Node_Focused(class UVM_TechTree_Node_C* Node);
	void PreConstruct(bool IsDesignTime);
	void Set_Divider_Height(double InHeight);
	void SetIsTierUnlocked(bool bInIsUnlocked);
	void SetKeystoneSlotAlignment(class UGridSlot* InGridSlot, class UVM_TechTree_Node_C* InNodeViewModel, class UVM_TechTree_Tier_C* InTierViewModel, double InOffset);
	void SetupTechTreeTier(class UVM_TechTree_Tier_C* InTierViewModel);
	void SetVM_TechTree_Tier(class UVM_TechTree_Tier_C* ViewModel);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Loadout_TechTree_Tier_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Loadout_TechTree_Tier_C")
	}
	static class UWBP_Loadout_TechTree_Tier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Loadout_TechTree_Tier_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Loadout_TechTree_Tier_C;

SDK_NAMESPACE_END
