#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CombatStat

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_CombatStat.WBP_CombatStat_C.ExecuteUbergraph_WBP_CombatStat
// 0x0008 (0x0008 - 0x0000)
struct WBP_CombatStat_C_ExecuteUbergraph_WBP_CombatStat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CombatStat_C_ExecuteUbergraph_WBP_CombatStat;

// Function WBP_CombatStat.WBP_CombatStat_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CombatStat_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CombatStat_C_PreConstruct;

// Function WBP_CombatStat.WBP_CombatStat_C.SetStatAmount
// 0x0018 (0x0018 - 0x0000)
struct WBP_CombatStat_C_SetStatAmount final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
DUMPER7_ASSERTS_WBP_CombatStat_C_SetStatAmount;

// Function WBP_CombatStat.WBP_CombatStat_C.SetStatMultiplier
// 0x0018 (0x0018 - 0x0000)
struct WBP_CombatStat_C_SetStatMultiplier final
{
public:
	double                                        Amount;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0008(0x0010)()
};
DUMPER7_ASSERTS_WBP_CombatStat_C_SetStatMultiplier;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
