#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Loading_DefaultContent_Background_LobbyConnecting

#include "Basic.hpp"

#include "UMG_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Loading_DefaultContent_Background_LobbyConnecting.WBP_Loading_DefaultContent_Background_LobbyConnecting_C.UpdateConnectionProgress
// 0x0098 (0x0098 - 0x0000)
struct WBP_Loading_DefaultContent_Background_LobbyConnecting_C_UpdateConnectionProgress final
{
public:
	float                                         InPercent;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetConnectPlayersAnimatedFromPercent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetConnectPlayersAnimatedFromPercent_ReturnValue_1; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0038(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationTimeRange_ReturnValue_1;     // 0x0048(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationTimeRange_StartAtTime_ImplicitCast; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationTimeRange_StartAtTime_ImplicitCast_1; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast_2;   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationTimeRange_EndAtTime_ImplicitCast; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loading_DefaultContent_Background_LobbyConnecting_C_UpdateConnectionProgress;

// Function WBP_Loading_DefaultContent_Background_LobbyConnecting.WBP_Loading_DefaultContent_Background_LobbyConnecting_C.SetVM_Lobby_Connecting
// 0x0028 (0x0028 - 0x0000)
struct WBP_Loading_DefaultContent_Background_LobbyConnecting_C_SetVM_Lobby_Connecting final
{
public:
	class UVM_Lobby_Connecting_C*                 ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loading_DefaultContent_Background_LobbyConnecting_C_SetVM_Lobby_Connecting;

// Function WBP_Loading_DefaultContent_Background_LobbyConnecting.WBP_Loading_DefaultContent_Background_LobbyConnecting_C.RefillShuffleNames
// 0x0018 (0x0018 - 0x0000)
struct WBP_Loading_DefaultContent_Background_LobbyConnecting_C_RefillShuffleNames final
{
public:
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loading_DefaultContent_Background_LobbyConnecting_C_RefillShuffleNames;

// Function WBP_Loading_DefaultContent_Background_LobbyConnecting.WBP_Loading_DefaultContent_Background_LobbyConnecting_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Loading_DefaultContent_Background_LobbyConnecting_C_PreConstruct final
{
public:
	bool                                          IsDesignTime_PreConstruct;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loading_DefaultContent_Background_LobbyConnecting_C_PreConstruct;

// Function WBP_Loading_DefaultContent_Background_LobbyConnecting.WBP_Loading_DefaultContent_Background_LobbyConnecting_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_Loading_DefaultContent_Background_LobbyConnecting_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation_OnAnimationFinished;                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loading_DefaultContent_Background_LobbyConnecting_C_OnAnimationFinished;

// Function WBP_Loading_DefaultContent_Background_LobbyConnecting.WBP_Loading_DefaultContent_Background_LobbyConnecting_C.ExecuteUbergraph_WBP_Loading_DefaultContent_Background_LobbyConnecting
// 0x0098 (0x0098 - 0x0000)
struct WBP_Loading_DefaultContent_Background_LobbyConnecting_C_ExecuteUbergraph_WBP_Loading_DefaultContent_Background_LobbyConnecting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0004(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TDelegate<void(class UTyrGameStateViewModel* ViewModel)> K2Node_CreateDelegate_OutputDelegate;   // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTyrGameStateViewModel*                 K2Node_CustomEvent_ViewModel;                      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrGameStateViewModel*                 Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrAsyncActionGetGameStateViewModel*   CallFunc_GetGameStateViewModel_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_Lobby_Connecting_C*                 K2Node_DynamicCast_AsVM_Lobby_Connecting;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0068(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATyrLobbyPlayerController*              K2Node_DynamicCast_AsTyr_Lobby_Player_Controller;  // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loading_DefaultContent_Background_LobbyConnecting_C_ExecuteUbergraph_WBP_Loading_DefaultContent_Background_LobbyConnecting;

// Function WBP_Loading_DefaultContent_Background_LobbyConnecting.WBP_Loading_DefaultContent_Background_LobbyConnecting_C.Completed_DAA43328485DB94CEAE5AFB6B85A496D
// 0x0008 (0x0008 - 0x0000)
struct WBP_Loading_DefaultContent_Background_LobbyConnecting_C_Completed_DAA43328485DB94CEAE5AFB6B85A496D final
{
public:
	class UTyrGameStateViewModel*                 ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loading_DefaultContent_Background_LobbyConnecting_C_Completed_DAA43328485DB94CEAE5AFB6B85A496D;

// Function WBP_Loading_DefaultContent_Background_LobbyConnecting.WBP_Loading_DefaultContent_Background_LobbyConnecting_C.__c5d2ebfb-4f84-05d9-99d6-9e9eee4b0d68_SourceToDest
// 0x0008 (0x0008 - 0x0000)
struct WBP_Loading_DefaultContent_Background_LobbyConnecting_C___c5d2ebfb_4f84_05d9_99d6_9e9eee4b0d68_SourceToDest final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loading_DefaultContent_Background_LobbyConnecting_C___c5d2ebfb_4f84_05d9_99d6_9e9eee4b0d68_SourceToDest;

// Function WBP_Loading_DefaultContent_Background_LobbyConnecting.WBP_Loading_DefaultContent_Background_LobbyConnecting_C.__544f648a-439b-039a-12c6-fdb3a74c74b9_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Loading_DefaultContent_Background_LobbyConnecting_C___544f648a_439b_039a_12c6_fdb3a74c74b9_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Loading_DefaultContent_Background_LobbyConnecting_C___544f648a_439b_039a_12c6_fdb3a74c74b9_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
