#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Clan_Create_LinkDiscord_Server_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Clan_Create_LinkDiscord_Server_Button.WBP_Clan_Create_LinkDiscord_Server_Button_C
// 0x0030 (0x15C0 - 0x1590)
class UWBP_Clan_Create_LinkDiscord_Server_Button_C final : public UTyrButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       ServerName_Text;                                   // 0x1598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ExpandedIcon_Image;                                // 0x15A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVM_Clan_Discord_Server_C*              Entry;                                             // 0x15A8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UImage*                                 ChannelQuery_Spinner;                              // 0x15B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTyrLazyImage*                          ServerIcon_Image;                                  // 0x15B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_Clan_Create_LinkDiscord_Server_Button(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void SetEntry(class UVM_Clan_Discord_Server_C* ViewModel);

	ESlateVisibility __e9aa71be_4cd8_2022_987d_e58132a02266_SourceToDest() const;
	double __f5f8b063_445e_ac86_a7b0_158dfc2f74c1_SourceToDest() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Clan_Create_LinkDiscord_Server_Button_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Clan_Create_LinkDiscord_Server_Button_C")
	}
	static class UWBP_Clan_Create_LinkDiscord_Server_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Clan_Create_LinkDiscord_Server_Button_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Clan_Create_LinkDiscord_Server_Button_C;

SDK_NAMESPACE_END
