#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_Scoreboard_Horizontal_PlayerEntry

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FieldNotification_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tyr_structs.hpp"
#include "DataRegistry_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C_BP_OnItemExpansionChanged;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C_BP_OnItemSelectionChanged;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.ExecuteUbergraph_WBP_HUD_Scoreboard_Horizontal_PlayerEntry
// 0x0088 (0x0088 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C_ExecuteUbergraph_WBP_HUD_Scoreboard_Horizontal_PlayerEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVM_PlayerScoreboard_InGame_C*          K2Node_DynamicCast_AsVM_Player_Scoreboard_in_Game; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATyrPlayerRecord*                       CallFunc_GetPlayerRecord_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVM_PlayerHealth_C*                     CallFunc_GetViewModel_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate; // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C_ExecuteUbergraph_WBP_HUD_Scoreboard_Horizontal_PlayerEntry;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.OnIsLastEntryInVehicleClassChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C_OnIsLastEntryInVehicleClassChanged final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   InField;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C_OnIsLastEntryInVehicleClassChanged;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.OnIsOwningPawnValidChanged
// 0x0018 (0x0018 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C_OnIsOwningPawnValidChanged final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   InField;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C_OnIsOwningPawnValidChanged;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C_OnListItemObjectSet;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.SetVM_PlayerHealth
// 0x0028 (0x0028 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C_SetVM_PlayerHealth final
{
public:
	class UVM_PlayerHealth_C*                     ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C_SetVM_PlayerHealth;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.SetVM_PlayerScoreboard_InGame
// 0x0028 (0x0028 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C_SetVM_PlayerScoreboard_InGame final
{
public:
	class UVM_PlayerScoreboard_InGame_C*          ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C_SetVM_PlayerScoreboard_InGame;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.ShowVehicleClassIcon
// 0x0280 (0x0280 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C_ShowVehicleClassIcon final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetVehicleTag_ReturnValue;                // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataRegistryId                        K2Node_MakeStruct_DataRegistryId;                  // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EDataRegistrySubsystemGetItemResult           CallFunc_FindCachedItemBP_OutResult;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTyrVehicleUIDataTableStruct           CallFunc_FindCachedItemBP_OutItem;                 // 0x0028(0x0238)(ConstParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C_ShowVehicleClassIcon;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.__13c9739d-4e75-4d88-8d66-9cb136d8a28c_SourceToDest
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___13c9739d_4e75_4d88_8d66_9cb136d8a28c_SourceToDest final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___13c9739d_4e75_4d88_8d66_9cb136d8a28c_SourceToDest;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.__48431fd1-4d21-efd0-48d2-7ba49fc14d34_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___48431fd1_4d21_efd0_48d2_7ba49fc14d34_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___48431fd1_4d21_efd0_48d2_7ba49fc14d34_SourceToDest;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.__52205e2c-409b-1839-8c06-aaa88e39e5a5_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___52205e2c_409b_1839_8c06_aaa88e39e5a5_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___52205e2c_409b_1839_8c06_aaa88e39e5a5_SourceToDest;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.__7bfc07f5-43b7-9af2-233a-06bfe5bfbafa_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___7bfc07f5_43b7_9af2_233a_06bfe5bfbafa_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___7bfc07f5_43b7_9af2_233a_06bfe5bfbafa_SourceToDest;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.__bd060182-4b48-18e9-8a56-6694d919a788_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___bd060182_4b48_18e9_8a56_6694d919a788_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___bd060182_4b48_18e9_8a56_6694d919a788_SourceToDest;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.__cdf8eaec-4ed5-6bc2-9436-10860f627438_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___cdf8eaec_4ed5_6bc2_9436_10860f627438_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___cdf8eaec_4ed5_6bc2_9436_10860f627438_SourceToDest;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.__ConversionFunction06630535-59d7-3837-8011-48776366c374
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunction06630535_59d7_3837_8011_48776366c374 final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunction06630535_59d7_3837_8011_48776366c374;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.__ConversionFunction080530e9-5c02-3513-aa45-0b5a87d0e4e4
// 0x0002 (0x0002 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunction080530e9_5c02_3513_aa45_0b5a87d0e4e4 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunction080530e9_5c02_3513_aa45_0b5a87d0e4e4;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.__ConversionFunction4052ea85-7ba3-3408-82ac-ddfd86f6a0e5
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunction4052ea85_7ba3_3408_82ac_ddfd86f6a0e5 final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunction4052ea85_7ba3_3408_82ac_ddfd86f6a0e5;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.__ConversionFunction4b92e9d2-cc19-3eb9-8e81-c24c088597a6
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunction4b92e9d2_cc19_3eb9_8e81_c24c088597a6 final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunction4b92e9d2_cc19_3eb9_8e81_c24c088597a6;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.__ConversionFunction56bf6be9-7b21-321d-be62-083a2f683505
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunction56bf6be9_7b21_321d_be62_083a2f683505 final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunction56bf6be9_7b21_321d_be62_083a2f683505;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.__ConversionFunction59c3cb86-5d9b-3a9d-a952-5ab8e6e3f970
// 0x0002 (0x0002 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunction59c3cb86_5d9b_3a9d_a952_5ab8e6e3f970 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunction59c3cb86_5d9b_3a9d_a952_5ab8e6e3f970;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.__ConversionFunction71d2f63c-7bc1-367c-b081-5016aba6d2f8
// 0x0002 (0x0002 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunction71d2f63c_7bc1_367c_b081_5016aba6d2f8 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunction71d2f63c_7bc1_367c_b081_5016aba6d2f8;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.__ConversionFunctiona39b40d2-1798-3ffa-bd46-dc2c5a0e93c3
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunctiona39b40d2_1798_3ffa_bd46_dc2c5a0e93c3 final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunctiona39b40d2_1798_3ffa_bd46_dc2c5a0e93c3;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.__ConversionFunctionaff7e97f-6866-3ef7-af29-47adb30071dc
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunctionaff7e97f_6866_3ef7_af29_47adb30071dc final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunctionaff7e97f_6866_3ef7_af29_47adb30071dc;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.__ConversionFunctionb93bb742-a04e-38b5-a6a9-d20ce7b0b027
// 0x0002 (0x0002 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunctionb93bb742_a04e_38b5_a6a9_d20ce7b0b027 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunctionb93bb742_a04e_38b5_a6a9_d20ce7b0b027;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.__ConversionFunctiond9c897ec-4fb9-3fe5-ae61-b846a17f5bcd
// 0x0020 (0x0020 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunctiond9c897ec_4fb9_3fe5_ae61_b846a17f5bcd final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___ConversionFunctiond9c897ec_4fb9_3fe5_ae61_b846a17f5bcd;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.__e50dadb6-4139-f9b8-d510-fbac1ddd268e_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___e50dadb6_4139_f9b8_d510_fbac1ddd268e_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___e50dadb6_4139_f9b8_d510_fbac1ddd268e_SourceToDest;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.__f887bf5b-44bb-d293-ad02-809b7486091a_SourceToDest
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___f887bf5b_44bb_d293_ad02_809b7486091a_SourceToDest final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___f887bf5b_44bb_d293_ad02_809b7486091a_SourceToDest;

// Function WBP_HUD_Scoreboard_Horizontal_PlayerEntry.WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C.__fd3466d8-4fb3-6b33-0632-0988787f9974_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___fd3466d8_4fb3_6b33_0632_0988787f9974_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HUD_Scoreboard_Horizontal_PlayerEntry_C___fd3466d8_4fb3_6b33_0632_0988787f9974_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
