#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CurrencyStore_PackButton

#include "Basic.hpp"

#include "Tyr_structs.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_CurrencyStore_PackButton.WBP_CurrencyStore_PackButton_C.ExecuteUbergraph_WBP_CurrencyStore_PackButton
// 0x0180 (0x0180 - 0x0000)
struct WBP_CurrencyStore_PackButton_C_ExecuteUbergraph_WBP_CurrencyStore_PackButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ErrorMessage;                   // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate;         // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_TransactionId;                  // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_GrantStatus;                    // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_VerificationStatus;             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& TransactionId, const class FString& GrantStatus, const class FString& VerificationStatus)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTyrOnlineSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UTyrOnlineUserInfo*               CallFunc_GetUserInfoForLocalPlayerIndex_ReturnValue; // 0x00B8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USnapserProgressionSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrInventorySubsystem*                 CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& OrderId, bool bAuthorized)> K2Node_CreateDelegate_OutputDelegate_2; // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_OrderId_1;                      // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USnapserProgressionSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTyrOnlineSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UTyrOnlineUserInfo*               CallFunc_GetUserInfoForLocalPlayerIndex_ReturnValue_1; // 0x0100(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& OrderId)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USnapserAsyncActionBeginMicrotransaction* CallFunc_BeginMicrotransaction_ReturnValue;      // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_OrderId;                        // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bAuthorized;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USnapserAsyncActionFinalizeMicrotransaction* CallFunc_FinalizeMicrotransaction_ReturnValue; // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ErrorMessage_1;                 // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate_4;       // 0x0168(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CurrencyStore_PackButton_C_ExecuteUbergraph_WBP_CurrencyStore_PackButton;

// Function WBP_CurrencyStore_PackButton.WBP_CurrencyStore_PackButton_C.OnFailure_9574E8B44E8B837C475E8199D93690CB
// 0x0010 (0x0010 - 0x0000)
struct WBP_CurrencyStore_PackButton_C_OnFailure_9574E8B44E8B837C475E8199D93690CB final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CurrencyStore_PackButton_C_OnFailure_9574E8B44E8B837C475E8199D93690CB;

// Function WBP_CurrencyStore_PackButton.WBP_CurrencyStore_PackButton_C.OnFailure_AE6E2FBF482324164A4788995A89CD5A
// 0x0010 (0x0010 - 0x0000)
struct WBP_CurrencyStore_PackButton_C_OnFailure_AE6E2FBF482324164A4788995A89CD5A final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CurrencyStore_PackButton_C_OnFailure_AE6E2FBF482324164A4788995A89CD5A;

// Function WBP_CurrencyStore_PackButton.WBP_CurrencyStore_PackButton_C.OnSteamMTXAuthorized
// 0x0018 (0x0018 - 0x0000)
struct WBP_CurrencyStore_PackButton_C_OnSteamMTXAuthorized final
{
public:
	class FString                                 OrderId;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bAuthorized;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CurrencyStore_PackButton_C_OnSteamMTXAuthorized;

// Function WBP_CurrencyStore_PackButton.WBP_CurrencyStore_PackButton_C.OnSuccess_9574E8B44E8B837C475E8199D93690CB
// 0x0030 (0x0030 - 0x0000)
struct WBP_CurrencyStore_PackButton_C_OnSuccess_9574E8B44E8B837C475E8199D93690CB final
{
public:
	class FString                                 TransactionId;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GrantStatus;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 VerificationStatus;                                // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CurrencyStore_PackButton_C_OnSuccess_9574E8B44E8B837C475E8199D93690CB;

// Function WBP_CurrencyStore_PackButton.WBP_CurrencyStore_PackButton_C.OnSuccess_AE6E2FBF482324164A4788995A89CD5A
// 0x0010 (0x0010 - 0x0000)
struct WBP_CurrencyStore_PackButton_C_OnSuccess_AE6E2FBF482324164A4788995A89CD5A final
{
public:
	class FString                                 OrderId;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CurrencyStore_PackButton_C_OnSuccess_AE6E2FBF482324164A4788995A89CD5A;

// Function WBP_CurrencyStore_PackButton.WBP_CurrencyStore_PackButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CurrencyStore_PackButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CurrencyStore_PackButton_C_PreConstruct;

// Function WBP_CurrencyStore_PackButton.WBP_CurrencyStore_PackButton_C.SetPackVM
// 0x0028 (0x0028 - 0x0000)
struct WBP_CurrencyStore_PackButton_C_SetPackVM final
{
public:
	class UVM_CurrencyPack_C*                     ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CurrencyStore_PackButton_C_SetPackVM;

// Function WBP_CurrencyStore_PackButton.WBP_CurrencyStore_PackButton_C.SetupFromData
// 0x0050 (0x0050 - 0x0000)
struct WBP_CurrencyStore_PackButton_C_SetupFromData final
{
public:
	class FText                                   InCurrencyAmount;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InPrice;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         InBonusPct;                                        // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Int_ReturnValue;              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0010)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CurrencyStore_PackButton_C_SetupFromData;

// Function WBP_CurrencyStore_PackButton.WBP_CurrencyStore_PackButton_C.__057cf745-4428-b263-d7bf-d7baf9317e3a_SourceToDest
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_CurrencyStore_PackButton_C___057cf745_4428_b263_d7bf_d7baf9317e3a_SourceToDest final
{
public:
	struct FTyrMaterialTextureParam               ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm)
	struct FTyrMaterialTextureParam               CallFunc_ToTextureMaterialParam__Texture__ReturnValue; // 0x0060(0x0060)()
};
DUMPER7_ASSERTS_WBP_CurrencyStore_PackButton_C___057cf745_4428_b263_d7bf_d7baf9317e3a_SourceToDest;

// Function WBP_CurrencyStore_PackButton.WBP_CurrencyStore_PackButton_C.__fb14e8cd-4ec5-f29b-6bd6-46a66ba598c2_SourceToDest
// 0x0003 (0x0003 - 0x0000)
struct WBP_CurrencyStore_PackButton_C___fb14e8cd_4ec5_f29b_6bd6_46a66ba598c2_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBonusVisible_NewParam;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CurrencyStore_PackButton_C___fb14e8cd_4ec5_f29b_6bd6_46a66ba598c2_SourceToDest;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
