#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Loadout

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_structs.hpp"
#include "Tyr_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Loadout.WBP_Loadout_C
// 0x00D8 (0x0600 - 0x0528)
class UWBP_Loadout_C final : public UTyrActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ActionBar_C*                       WBP_ActionBar;                                     // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Loadout_TechTree_C*                Techtree;                                          // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TabName;                                           // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Loadout_Slots_C*                   SlotTabs;                                          // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Text_C*                     Rename_Button;                                     // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Loadout_SlotButtons_C*             Loadout_Tabs;                                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonAnimatedSwitcher*                Loadout_Switcher;                                  // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Loadout_QuerySwitcher;                             // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Text_C*                     Import_Button;                                     // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Text_C*                     Export_Button;                                     // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Vehicle_Detail_ProgressBar_C*      CurrentLevel_ProgressBar;                          // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CurrencyBalance_C*                 Currency_RankedEnabled;                            // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Loadout_Components_C*              Components;                                        // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Text_C*                     Clear_Button;                                      // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Loadout_Ammunition_C*              Ammunition;                                        // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x05A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RefreshLoadoutSwitcher;                            // 0x05B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Loadout_C*                  VM_Vehicle_Loadout;                                // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UVM_Vehicle_C*                          VM_Vehicle;                                        // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UVM_Vehicle_LoadoutSlots_C*             VM_Vehicle_LoadoutSlots;                           // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UVM_Vehicle_Level_C*                    VM_Vehicle_Level;                                  // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UCommonTextBlock*                       PilotName_Text;                                    // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       TankName_Text;                                     // 0x05E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentComponentSlotIndex;                         // 0x05E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentAmmoSlotIndex;                              // 0x05EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVM_Vehicle_Levels_C*                   VehicleLevels;                                     // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               PreviousActiveWidget;                              // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Loadout_Ammunition_K2Node_ComponentBoundEvent_4_OnShellClicked__DelegateSignature(class UVM_Ammunition_Shell_C* Shell);
	void BndEvt__WBP_Loadout_Clear_Button_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Loadout_Components_K2Node_ComponentBoundEvent_6_OnComponentClicked__DelegateSignature(class UVM_Vehicle_Component_C* Component);
	void BndEvt__WBP_Loadout_Export_Button_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Loadout_Import_Button_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Loadout_Loadout_Switcher_K2Node_ComponentBoundEvent_10_OnActiveIndexChangedDelegate__DelegateSignature(class UWidget* ActiveWidget, int32 ActiveIndex);
	void BndEvt__WBP_Loadout_Loadout_Tabs_K2Node_ComponentBoundEvent_1_OnTechTreeSelected__DelegateSignature();
	void BndEvt__WBP_Loadout_Loadout_Tabs_K2Node_ComponentBoundEvent_2_OnComponentSlotSelected__DelegateSignature(int32 SlotIndex);
	void BndEvt__WBP_Loadout_Loadout_Tabs_K2Node_ComponentBoundEvent_3_OnAmmoSlotSelected__DelegateSignature(int32 SlotIndex);
	void BndEvt__WBP_Loadout_Rename_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Loadout_SlotTabs_K2Node_ComponentBoundEvent_5_OnSlotSelected__DelegateSignature(int32 SlotIndex);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void CreateAmmunitionPurchaseDescriptor(class UVM_Ammunition_Shell_C* InShell, class UTyrGameDialogDescriptor** Descriptor);
	void CreateComponentPurchaseDescriptor(class UVM_Vehicle_Component_C* InComponent, class UTyrGameDialogDescriptor** Descriptor);
	class UVM_Currency_Purchase_C* CreatePurchaseViewModel(int32 InSoftCurrencyCost);
	void CreateSlotNameDialogDescriptor(class UTyrGameDialogDescriptor** Descriptor, class UVM_Dialog_TextInput_C** TextInputViewModel);
	class UVM_Dialog_TextInput_C* CreateTextInputViewModel();
	void Destruct();
	void ExecuteUbergraph_WBP_Loadout(int32 EntryPoint);
	void InputAction_DT_Settings_SaveActions_Close_Clicked();
	void InputAction_DT_Settings_SaveActions_SaveClose_Clicked();
	void InputAction_DT_UniversalAction_OpenEscMenuHidden_Clicked();
	void OnImportComplete(bool bSuccess, const struct FTyrOnlineErrorWrapper& ErrorMessage);
	void OnMessageReceived_4A3A87AC2844F38F82BEB38AC8D47CBD(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnResult_09143424468BD09309DAFCB412907332(ETyrMessagingResult Result);
	void OnResult_1ECB274941C9C2EC3395B9A5EF441FEE(ETyrMessagingResult Result);
	void OnResult_2F5011C64483335A861F07BD47F82CC9(ETyrMessagingResult Result);
	void OnResult_9359CA8D43316B468D574C884EDF2530(ETyrMessagingResult Result);
	void OnResult_A21CB97641B9A88D6FDDEFBE90EF9562(ETyrMessagingResult Result);
	void OnResult_B3767ADF4BDFE42A9741D0ABB74385F1(ETyrMessagingResult Result);
	void OnResult_B8CE8D7B432C52E8AEFBC4B220E33D92(ETyrMessagingResult Result);
	void OnResult_D273D5A24290CC3606CEF5B9CDF091A1(ETyrMessagingResult Result);
	void PlayRefreshAnimation();
	void RefreshImportButtonState();
	void SetLoadoutSlotIndex(int32 InSlotIndex);
	void SetViewModels(class UVM_Vehicle_LoadoutSlots_C* InLoadoutSlotsViewModel, class UVM_Vehicle_C* InVehicleViewModel, class UVM_Vehicle_Levels_C* InVehicleLevelsModel, int32 InSlotIndex);
	void SetVM_Vehicle(class UVM_Vehicle_C* ViewModel);
	void SetVM_Vehicle_Level(class UVM_Vehicle_Level_C* ViewModel);
	void SetVM_Vehicle_Loadout(class UVM_Vehicle_Loadout_C* ViewModel);
	void SetVM_Vehicle_LoadoutSlots(class UVM_Vehicle_LoadoutSlots_C* ViewModel);
	void TryClearCurrentAmmoSlotBreadcrumbs();
	void TryClearCurrentComponentSlotBreadcrumbs();
	void TryShowEquippedAmmunitionDetails();
	void TryShowEquippedComponentDetails();
	void UpdateAmmunitionForCurrentLoadout();
	void UpdateComponentsForCurrentLoadout();
	void UpdateInputActions(bool bInVehicleUnlocked);

	int32 __11435a38_4e90_d9b2_b8a4_e69953bd0200_SourceToDest() const;
	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Loadout_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Loadout_C")
	}
	static class UWBP_Loadout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Loadout_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Loadout_C;

SDK_NAMESPACE_END
