#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Ranked

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Ranked.WBP_Ranked_C
// 0x0060 (0x0588 - 0x0528)
class UWBP_Ranked_C final : public UTyrActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               Ranks;                                             // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ranked_Profile_C*                  RankedProfile_Team;                                // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ranked_Profile_C*                  RankedProfile_Solo;                                // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       ProfileLeaderboard_Switcher;                       // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ranked_Leaderboards_C*             Leaderboard;                                       // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Image_C*                    Info_Button;                                       // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_40;                                          // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVM_Leaderboard_C*                      VM_Leaderboard;                                    // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UVM_LocalPlayerProfile_C*               VM_LocalPlayerProfile;                             // 0x0570(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       DecayMessage_Text;                                 // 0x0578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         DecayMessage_Box;                                  // 0x0580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void AfterPush_E9BB249F4311B0089FE936A766363B29(class UCommonActivatableWidget* UserWidget);
	void BeforePush_E9BB249F4311B0089FE936A766363B29(class UCommonActivatableWidget* UserWidget);
	void BndEvt__WBP_Ranked_Info_Button_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Ranked_TeamsLeaderboard_K2Node_ComponentBoundEvent_8_OnSelectedLeaderboardChanged__DelegateSignature(class UVM_Leaderboard_C* Leaderboard_0);
	void BP_OnActivated();
	bool BP_OnHandleBackAction();
	void ExecuteUbergraph_WBP_Ranked(int32 EntryPoint);
	void SetVM_Leaderboard(class UVM_Leaderboard_C* ViewModel);

	ESlateVisibility __ConversionFunctione147edf7_3658_3cd1_b29a_c6fc2612d621() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Ranked_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Ranked_C")
	}
	static class UWBP_Ranked_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Ranked_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Ranked_C;

SDK_NAMESPACE_END
