#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TerritoryScans_Button_New

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_TerritoryScans_Button_New.WBP_TerritoryScans_Button_New_C
// 0x0040 (0x15D0 - 0x1590)
class UWBP_TerritoryScans_Button_New_C final : public UTyrButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Badge_Unread_C*                    WBP_Badge_Unread;                                  // 0x1598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x15A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Scans_Box;                                         // 0x15A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnShape;                                          // 0x15B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVM_TerritoryScans_C*                   VM_TerritoryScans;                                 // 0x15B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTyrLazyImage*                          Scans_Map;                                         // 0x15C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           RefreshTimerHandle;                                // 0x15C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_TerritoryScans_Button_New(int32 EntryPoint);
	class UWBP_TerritoryScans_ScanMinimal_C* GetOrCreateScanWidget(int32 InScanIndex, class UVM_TerritoryScans_Scan_C* InViewModel);
	void OnButtonBaseHovered_Event(class UCommonButtonBase* Button);
	void OnButtonBaseUnhovered_Event(class UCommonButtonBase* Button);
	void PreConstruct(bool IsDesignTime);
	void SetScanViewModels(const TArray<class UVM_TerritoryScans_Scan_C*>& InScanViewModels);
	void UpdateRefreshesTimer();

	ESlateVisibility __a23643e9_4b5a_c8fc_ef84_90acf51ad815_SourceToDest() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_TerritoryScans_Button_New_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_TerritoryScans_Button_New_C")
	}
	static class UWBP_TerritoryScans_Button_New_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TerritoryScans_Button_New_C>();
	}
};
DUMPER7_ASSERTS_UWBP_TerritoryScans_Button_New_C;

SDK_NAMESPACE_END
