#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Loadout_Ammunition

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Loadout_Ammunition.WBP_Loadout_Ammunition_C
// 0x0138 (0x0660 - 0x0528)
class UWBP_Loadout_Ammunition_C final : public UTyrActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             VelocityPctText;                                   // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStackBox*                              VelocityContainer;                                 // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ReloadPctText;                                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStackBox*                              ReloadContainer;                                   // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PenPctText;                                        // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStackBox*                              PenContainer;                                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_5;                                            // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_4;                                            // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_3;                                            // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_2;                                            // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_1;                                            // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_135;                                         // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStackBox*                              DspContainer;                                      // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DmgPctText;                                        // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStackBox*                              DmgContainer;                                      // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DispersionPctText;                                 // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DetectionPctText;                                  // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStackBox*                              DetContainer;                                      // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ColumnL;                                           // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTileView*                        Ammunition_TileView;                               // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVM_Ammunition_C*                       VM_Ammunition;                                     // 0x05E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       SlotHeader_Text;                                   // 0x05F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       EquippedHeader_Text;                               // 0x05F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                UnlockHeader_Border;                               // 0x0600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   ShellDescription_Text;                             // 0x0608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       ShellTitle_Text;                                   // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           DetailsPanel_InfoBox;                              // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       ErrorMessage_Text;                                 // 0x0620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       UnlockHeader_Text;                                 // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVM_Ammunition_Shell_C*                 SelectedShell;                                     // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UVM_Ammunition_Shell_C* Shell)> OnShellClicked;              // 0x0638(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   ErrorMessage;                                      // 0x0648(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bWantsAutoFocus;                                   // 0x0658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Loadout_Ammunition_Ammunition_TileView_K2Node_ComponentBoundEvent_0_OnItemIsHoveredChangedDynamic__DelegateSignature(class UObject* Item, bool bIsHovered);
	void BndEvt__WBP_Loadout_Ammunition_Ammunition_TileView_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__WBP_Loadout_Ammunition_Ammunition_TileView_K2Node_ComponentBoundEvent_3_OnListEntriesGeneratedDynamic__DelegateSignature(int32 NumEntries);
	void BP_OnActivated();
	void ClearErrorMessage();
	void Construct();
	void DisplayErrorMessage(const class FText& InErrorMessage);
	void ExecuteUbergraph_WBP_Loadout_Ammunition(int32 EntryPoint);
	void OnShowAmmoDetailsChanged(class UVM_Ammunition_Shell_C* ShellViewModel, bool bShouldShowDetails);
	void TryAutoFocus();

	ESlateVisibility __97a991f3_4760_2d1c_fbbd_3c9a37d6b32a_SourceToDest() const;
	void Convert_Modifier_to_Percent_Text(double InModifier, class FText* Result) const;
	void Get_Selected_Shell_Detection_Modifier_Color(struct FSlateColor* Visibility_0) const;
	void Get_Selected_Shell_Detection_Modifier_Text(class FText* PercentText) const;
	void Get_Selected_Shell_Detection_Modifier_Visibility(ESlateVisibility* Visibility_0) const;
	void Get_Selected_Shell_Dispersion_Modifier_Color(struct FSlateColor* Visibility_0) const;
	void Get_Selected_Shell_Dispersion_Modifier_Text(class FText* PercentText) const;
	void Get_Selected_Shell_Dispersion_Modifier_Visibility(ESlateVisibility* Visibility_0) const;
	void Get_Selected_Shell_Dmg_Modifier_Color(struct FSlateColor* Visibility_0) const;
	void Get_Selected_Shell_Dmg_Modifier_Text(class FText* NewParam) const;
	void Get_Selected_Shell_Dmg_Modifier_Visibility(ESlateVisibility* Visibility_0) const;
	void Get_Selected_Shell_Pen_Modifier_Color(struct FSlateColor* Visibility_0) const;
	void Get_Selected_Shell_Pen_Modifier_Text(class FText* PercentText) const;
	void Get_Selected_Shell_Pen_Modifier_Visibility(ESlateVisibility* Visibility_0) const;
	void Get_Selected_Shell_Reload_Modifier_Color(struct FSlateColor* Visibility_0) const;
	void Get_Selected_Shell_Reload_Modifier_Text(class FText* PercentText) const;
	void Get_Selected_Shell_Reload_Modifier_Visibility(ESlateVisibility* Visibility_0) const;
	void Get_Selected_Shell_Velocity_Modifier_Color(struct FSlateColor* Visibility_0) const;
	void Get_Selected_Shell_Velocity_Modifier_Text(class FText* PercentText) const;
	void Get_Selected_Shell_Velocity_Modifier_Visibility(ESlateVisibility* Visibility_0) const;
	class FText GetSelectedShellDescription() const;
	class FText GetSelectedShellName() const;
	class FText GetUnlockHeaderText() const;
	bool HasSelectedShell() const;
	ESlateVisibility ShowEquippedLabel() const;
	ESlateVisibility ShowPurchaseUnlockLabel() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Loadout_Ammunition_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Loadout_Ammunition_C")
	}
	static class UWBP_Loadout_Ammunition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Loadout_Ammunition_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Loadout_Ammunition_C;

SDK_NAMESPACE_END
