#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CurrencyStore_PackButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tyr_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_CurrencyStore_PackButton.WBP_CurrencyStore_PackButton_C
// 0x0080 (0x1610 - 0x1590)
class UWBP_CurrencyStore_PackButton_C final : public UTyrButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               RootOverlay;                                       // 0x1598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PriceText;                                         // 0x15A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTyrLazyImage*                          PackIconImage;                                     // 0x15A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gradient;                                          // 0x15B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x15B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrencyAmountText;                                // 0x15C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonHoverBrackets;                               // 0x15C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BonusText;                                         // 0x15D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BonusBadge;                                        // 0x15D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Backing;                                           // 0x15E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVM_CurrencyPack_C*                     PackVM;                                            // 0x15E8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 PackId;                                            // 0x15F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 PendingOrderId;                                    // 0x1600(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void Construct();
	void ExecuteUbergraph_WBP_CurrencyStore_PackButton(int32 EntryPoint);
	void HandlePackPurchaseClicked();
	void OnFailure_9574E8B44E8B837C475E8199D93690CB(const class FString& ErrorMessage);
	void OnFailure_AE6E2FBF482324164A4788995A89CD5A(const class FString& ErrorMessage);
	void OnSteamMTXAuthorized(const class FString& OrderId, bool bAuthorized);
	void OnSuccess_9574E8B44E8B837C475E8199D93690CB(const class FString& TransactionId, const class FString& GrantStatus, const class FString& VerificationStatus);
	void OnSuccess_AE6E2FBF482324164A4788995A89CD5A(const class FString& OrderId);
	void PreConstruct(bool IsDesignTime);
	void SetPackVM(class UVM_CurrencyPack_C* ViewModel);
	void SetupFromData(const class FText& InCurrencyAmount, const class FText& InPrice, int32 InBonusPct);

	struct FTyrMaterialTextureParam __057cf745_4428_b263_d7bf_d7baf9317e3a_SourceToDest() const;
	ESlateVisibility __fb14e8cd_4ec5_f29b_6bd6_46a66ba598c2_SourceToDest() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_CurrencyStore_PackButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_CurrencyStore_PackButton_C")
	}
	static class UWBP_CurrencyStore_PackButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CurrencyStore_PackButton_C>();
	}
};
DUMPER7_ASSERTS_UWBP_CurrencyStore_PackButton_C;

SDK_NAMESPACE_END
