#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameInputAction_Hint

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_GameInputAction_Hint.WBP_GameInputAction_Hint_C
// 0x0030 (0x0370 - 0x0340)
class UWBP_GameInputAction_Hint_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Text_ActionName;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTyrEnhancedInputActionWidget*          GameActionWidget;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputAction*                           EnhancedInputAction;                               // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FKey>                           DesignTimeKeys;                                    // 0x0360(0x0010)(Edit, BlueprintVisible)

public:
	void BndEvt__WBP_GameInputAction_Hint_GameActionWidget_K2Node_ComponentBoundEvent_0_OnActionWidgetVisibilityChanged__DelegateSignature();
	void ExecuteUbergraph_WBP_GameInputAction_Hint(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_GameInputAction_Hint_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_GameInputAction_Hint_C")
	}
	static class UWBP_GameInputAction_Hint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GameInputAction_Hint_C>();
	}
};
DUMPER7_ASSERTS_UWBP_GameInputAction_Hint_C;

SDK_NAMESPACE_END
