#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cosmetics_Skin_Button

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FieldNotification_structs.hpp"
#include "UMG_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Cosmetics_Skin_Button_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Skin_Button_C_BP_OnItemExpansionChanged;

// Function WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Cosmetics_Skin_Button_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Skin_Button_C_BP_OnItemSelectionChanged;

// Function WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C.ExecuteUbergraph_WBP_Cosmetics_Skin_Button
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_Cosmetics_Skin_Button_C_ExecuteUbergraph_WBP_Cosmetics_Skin_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId;             // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_1;           // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_2;           // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_3;           // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEquip_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x004C(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x005C(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x006C(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue;         // 0x007C(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x008C(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue; // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_4;           // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_MakeStruct_FieldNotificationId_5;           // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFieldNotificationId>           K2Node_MakeArray_Array_1;                          // 0x00B0(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetPropertyValueAndBroadcastFields_ReturnValue_1; // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Skin_Button_C_ExecuteUbergraph_WBP_Cosmetics_Skin_Button;

// Function WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cosmetics_Skin_Button_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Skin_Button_C_OnListItemObjectSet;

// Function WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C.SetVM_Cosmetics_Skin
// 0x0028 (0x0028 - 0x0000)
struct WBP_Cosmetics_Skin_Button_C_SetVM_Cosmetics_Skin final
{
public:
	class UVM_Cosmetics_Skin_C*                   ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Skin_Button_C_SetVM_Cosmetics_Skin;

// Function WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C.__0f64e73d-478f-96e7-10e0-b7ab7ee53633_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Cosmetics_Skin_Button_C___0f64e73d_478f_96e7_10e0_b7ab7ee53633_SourceToDest final
{
public:
	ESlateVisibility                              Visibility_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_ShowForValidRarity_Visibility;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Skin_Button_C___0f64e73d_478f_96e7_10e0_b7ab7ee53633_SourceToDest;

// Function WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C.__3466fa9c-4005-9fdf-730c-4b9ab1451543_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cosmetics_Skin_Button_C___3466fa9c_4005_9fdf_730c_4b9ab1451543_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorForRarity_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Skin_Button_C___3466fa9c_4005_9fdf_730c_4b9ab1451543_SourceToDest;

// Function WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C.__49b5fc53-4cde-31a5-5b78-a8805cfa6cf1_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cosmetics_Skin_Button_C___49b5fc53_4cde_31a5_5b78_a8805cfa6cf1_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_ToCosmeticsFillBackerColor_ReturnValue;   // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Skin_Button_C___49b5fc53_4cde_31a5_5b78_a8805cfa6cf1_SourceToDest;

// Function WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C.__57c2ded0-4692-36c7-ebe2-df838e6d9567_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_Cosmetics_Skin_Button_C___57c2ded0_4692_36c7_ebe2_df838e6d9567_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Skin_Button_C___57c2ded0_4692_36c7_ebe2_df838e6d9567_SourceToDest;

// Function WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C.__a4eaf332-4a61-1cdc-3365-16b3f2d84f82_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cosmetics_Skin_Button_C___a4eaf332_4a61_1cdc_3365_16b3f2d84f82_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorForRarity_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Skin_Button_C___a4eaf332_4a61_1cdc_3365_16b3f2d84f82_SourceToDest;

// Function WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C.__c4bee7d9-4398-c096-3ccb-0a99ada4fd70_SourceToDest
// 0x0018 (0x0018 - 0x0000)
struct WBP_Cosmetics_Skin_Button_C___c4bee7d9_4398_c096_3ccb_0a99ada4fd70_SourceToDest final
{
public:
	struct FTyrMaterialScalarParam                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FTyrMaterialScalarParam                CallFunc_ToScalarMaterialParam__Boolean__ReturnValue; // 0x000C(0x000C)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Skin_Button_C___c4bee7d9_4398_c096_3ccb_0a99ada4fd70_SourceToDest;

// Function WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C.__cca782b5-4fac-bbea-7270-19a51321da48_SourceToDest
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cosmetics_Skin_Button_C___cca782b5_4fac_bbea_7270_19a51321da48_SourceToDest final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ToSkinAvailabilityIndex_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Skin_Button_C___cca782b5_4fac_bbea_7270_19a51321da48_SourceToDest;

// Function WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C.__ConversionFunction34cc10a6-e596-3e9c-b777-773d50a3c2fb
// 0x0002 (0x0002 - 0x0000)
struct WBP_Cosmetics_Skin_Button_C___ConversionFunction34cc10a6_e596_3e9c_b777_773d50a3c2fb final
{
public:
	ESlateVisibility                              Visibility_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_ShowForValidRarity_Visibility;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Skin_Button_C___ConversionFunction34cc10a6_e596_3e9c_b777_773d50a3c2fb;

// Function WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C.__ConversionFunction379ff6fb-a221-3614-b240-a79ee5f3e301
// 0x0002 (0x0002 - 0x0000)
struct WBP_Cosmetics_Skin_Button_C___ConversionFunction379ff6fb_a221_3614_b240_a79ee5f3e301 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Skin_Button_C___ConversionFunction379ff6fb_a221_3614_b240_a79ee5f3e301;

// Function WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C.__ConversionFunction96ad37b3-8207-3f5e-829e-40100ef4b428
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cosmetics_Skin_Button_C___ConversionFunction96ad37b3_8207_3f5e_829e_40100ef4b428 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Skin_Button_C___ConversionFunction96ad37b3_8207_3f5e_829e_40100ef4b428;

// Function WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C.__ConversionFunction99251ad6-aa73-383d-9c8b-b6e9b44378c3
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cosmetics_Skin_Button_C___ConversionFunction99251ad6_aa73_383d_9c8b_b6e9b44378c3 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorForRarity_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Skin_Button_C___ConversionFunction99251ad6_aa73_383d_9c8b_b6e9b44378c3;

// Function WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C.__ConversionFunctioncfc73f54-b341-306b-9ea8-22494b8841c4
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cosmetics_Skin_Button_C___ConversionFunctioncfc73f54_b341_306b_9ea8_22494b8841c4 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorForRarity_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Skin_Button_C___ConversionFunctioncfc73f54_b341_306b_9ea8_22494b8841c4;

// Function WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C.__d40eac64-41be-716b-e92e-51b39bb1c071_SourceToDest
// 0x0040 (0x0040 - 0x0000)
struct WBP_Cosmetics_Skin_Button_C___d40eac64_41be_716b_e92e_51b39bb1c071_SourceToDest final
{
public:
	struct FTyrMaterialVectorParam                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FLinearColor                           CallFunc_ResetMaterialOffset_PilotMaterialOffset;  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTyrMaterialVectorParam                CallFunc_ToVectorMaterialParam__LinearColor__ReturnValue; // 0x0028(0x0018)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Skin_Button_C___d40eac64_41be_716b_e92e_51b39bb1c071_SourceToDest;

// Function WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C.__f8024e13-49fb-dfe9-43e4-44af13f9c712_SourceToDest
// 0x0018 (0x0018 - 0x0000)
struct WBP_Cosmetics_Skin_Button_C___f8024e13_49fb_dfe9_43e4_44af13f9c712_SourceToDest final
{
public:
	struct FTyrMaterialScalarParam                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FTyrMaterialScalarParam                CallFunc_ToScalarMaterialParam__Boolean__ReturnValue; // 0x000C(0x000C)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Skin_Button_C___f8024e13_49fb_dfe9_43e4_44af13f9c712_SourceToDest;

// Function WBP_Cosmetics_Skin_Button.WBP_Cosmetics_Skin_Button_C.ToSkinAvailabilityIndex
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cosmetics_Skin_Button_C_ToSkinAvailabilityIndex final
{
public:
	bool                                          bInEquipped;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInOwned;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInCanPurchase;                                    // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Cosmetics_Skin_Button_C_ToSkinAvailabilityIndex;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
