#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WInd_Struct

#include "Basic.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct WInd_Struct.WInd_Struct
// 0x0048 (0x0048 - 0x0000)
struct FWInd_Struct final
{
public:
	double                                        Force_2_3BEFEF0E4742F73D2BBA29BA1DC503D7;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Reactivity_11_DE0671044DBC95BE5FF74582C182D83A;    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TurbulenceFrequency_12_29C1DA7E47E1B257AA5D5E9A6A6B0D20; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TurbulenceStrength_13_873E278D4D9DBE34E56EB794CB26CE5A; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GustStrength_14_5D86AD524CE9CAADE30279A6CC2EC425;  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GustRandomDIrection_15_D0AF434D440C965FC3ADFC84699F0978; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GustRandomForce_16_8C242CF24B36E0265B8BFAB42B52A501; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GustRandomReactivity_17_59C4500B4F01861B47CEBEA7C80965E5; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PushStrength_18_ABB30BAE476EE6D15ECBB093A0F8CC3D;  // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FWInd_Struct;

SDK_NAMESPACE_END
